{
  "title": "10 Best Microsoft SharePoint Alternatives to Consider in 2024 (Free & Paid)",
  "authors": [
    "Yiyang Zhang"
  ],
  "tags": [
    "Content"
  ],
  "description": "Explore the best Microsoft SharePoint alternatives in 2024 for work. Find the perfect fit for your workflow and organization needs.",
  "created": 1702857600000,
  "updated": 1702857600000,
  "layout": "blog",
  "id": "Dhr1vRRivDpbwJ-xpgGuD",
  "slug": "10-best-microsoft-sharepoint-alternatives-consider-2024-free-paid",
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/Gc5AkBVvrQblYnPZv5hV8BFEMr8cpt3AWwHehDcoT2s=.webp",
  "md": "---\n\ntitle: \"10 Best Microsoft SharePoint Alternatives to Consider in 2024 (Free & Paid)\"\n\nauthor: \"Yiyang Zhang\"\n\ntags: Content\n\nslug: 10-best-microsoft-sharepoint-alternatives-consider-2024-free-paid\n\ndescription: \"Explore the best Microsoft SharePoint alternatives in 2024 for work. Find the perfect fit for your workflow and organization needs.\"\n\ncreated: 2023-12-18\n\nupdated: 2023-12-18\n\nlayout: blog\n\npublish: true\n\n---\n\nArtificial intelligence has been the stage for a riveting showdown between Google's Gemini AI and OpenAI's ChatGPT. ChatGPT has been in the limelight, but Gemini AI has been diligently enhancing its capabilities, poised for the perfect moment to reveal its strengths. Recently, Gemini made a significant impact with its impressive performance, challenging the established norms in the AI world. For the past year, Google has been a silent observer as ChatGPT captured global attention.\n\n\n\n\n![Gc5AkBVvrQblYnPZv5hV8BFEMr8cpt3AWwHehDcoT2s=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/Gc5AkBVvrQblYnPZv5hV8BFEMr8cpt3AWwHehDcoT2s=.webp)\n\nAttention all businesses seeking to revolutionize collaboration and productivity! You must know about Microsoft SharePoint alternatives. Microsoft SharePoint may be a popular choice for document management, content sharing, and team collaboration, but it's time to explore other powerful tools that can give SharePoint a run for its money. In today's rapidly evolving digital landscape, these alternatives are a game-changer. Don't miss out on this opportunity to boost your organization's success.\n\nWhether you're looking for more cost-effective solutions or simply want to explore different features and functionalities, this article will take you on a journey through the 10 best Microsoft SharePoint alternatives and competitors in 2024. So buckle up as we dive into the world of innovative platforms that can transform the way your teams work together seamlessly!\n\n### What is Microsoft SharePoint?\n\nMicrosoft SharePoint is a robust web-based platform developed by Microsoft, serving as a central hub for collaboration, document management, and content sharing within organizations. It allows users to create customizable websites for storing and sharing documents, integrating seamlessly with other Microsoft products. SharePoint's key strengths include real-time collaboration, powerful search capabilities, and advanced security features for protecting sensitive data. Overall, it enhances team productivity and streamlines workflows by providing a comprehensive solution for organizational collaboration and document management.\n\n### What Should You Look for in Microsoft SharePoint Alternatives?\n\nWhen considering alternatives to Microsoft SharePoint, it's important to carefully evaluate your specific needs and requirements. While SharePoint offers a range of features for collaboration and document management, there may be other solutions that better suit your organization's unique circumstances.\n\n\n![IYgmW5QTT5AoX4ruTLkrPg5QPOycyLiJtMqOIuZtLTM=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/IYgmW5QTT5AoX4ruTLkrPg5QPOycyLiJtMqOIuZtLTM=.webp)\n\n* **Ease of Use**. When exploring alternatives to Microsoft SharePoint, prioritize platforms with an intuitive interface that requires minimal training. A user-friendly solution can significantly boost adoption rates among your employees, ensuring a smooth transition and quick onboarding.\n\n* **Scalability**. As your organization grows, it's crucial to choose an alternative that can seamlessly accommodate increased data and users without sacrificing performance. Scalability guarantees that the chosen platform remains effective and aligned with your evolving needs over the long term.\n\n* **Integration Capabilities**. Consider the integration capabilities of potential alternatives. Seamless integration with existing tools, such as CRM or project management software, is essential for streamlining workflows and enhancing overall productivity. Look for solutions that complement your current software ecosystem.\n\n* **Security Measures**. Never compromise on security when seeking an alternative to SharePoint. Verify that prospective options implement robust security measures, including encryption protocols, access controls, and regular updates. These features are critical for safeguarding sensitive data from unauthorized access or breaches.\n\n### 10 Best Microsoft SharePoint Alternatives & Competitors in 2024\n\nWhen it comes to finding the right Microsoft SharePoint alternative, there are plenty of options out there to consider. Whether you're looking for a free solution or are willing to invest in a paid platform, these ten alternatives are worth exploring.\n\n**1.AFFiNE**\n\n\n![5VZZiy69UNGfpn8KOwMVuvVmBr6icqfRjmd42C36r9g=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/5VZZiy69UNGfpn8KOwMVuvVmBr6icqfRjmd42C36r9g=.webp)\n\nAFFiNE provides professionals with a unified platform that enables them to plan a knowledge base, collaborate with teammates, and develop content. This flexible tool empowers users to brainstorm, take notes, and set their goals while staying in sync and building content with blocks. The limitless workspace stimulates user-driven innovation. AFFiNE offers safe data storage, open-source benefits, and collaborative functionality. Users can visualize and connect information effortlessly, making data management an engaging and enjoyable experience.\n\n**Key features:**\n\n* **Centralized Communication & Collaboration**: You can easily write, draw, plan and edit specific notes with your team members or clients to ensure they stay informed about progress updates in one workspace, allowing for efficient teamwork and idea sharing in AFFiNE. Invite your team members into your workspace regardless of their location or time zone. Brainstorming, exchanging ideas, and providing feedback in real time through AFFiNE. With AFFiNE, everyone can contribute to the same set of notes in real-time.\n\n\n![O88V12dZ7eALpdMD8-6eyyfRec5yZyWiQxCnvNEb3r0=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/O88V12dZ7eALpdMD8-6eyyfRec5yZyWiQxCnvNEb3r0=.webp)\n\n* **Unified Data Management with Database**: AFFiNE integrates a potent database with Kanban and Table Views, transforming charts into dynamic tools, where unified data management takes center stage through the versatile Kanban and Table Views. Experience the efficiency of Kanban for visual project organization and teamwork, coupled with the detailed insights provided by the Table view. AFFiNE ensures synchronized and organized project information, optimizing collaboration and data management within its platform.\n\n\n![bY0EkoVLJfBpOjymBoGUxE0LAiQuW1bNgYA-FU1OQlA=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/bY0EkoVLJfBpOjymBoGUxE0LAiQuW1bNgYA-FU1OQlA=.webp)\n\n* **Enhanced Your File Organization in Collection**: With the remarkable AFFiNE collection, you can now enjoy concurrent support for manual multi-page selection and incorporate articles into collections through predefined rules. You have the flexibility to add pages to collections by manual selection, filtering based on favorites or tags, and even dragging and dropping directly from the All Pages section.  Notably, the ability to delete manually added pages and rules within collections offers unparalleled flexibility, allowing users to fine-tune and customize their collections for a more streamlined and tailored document management experience in AFFiNE.\n\n2.**[Google Workspace](https://affine.pro/blog/how-to-create-timeline-template-google-docs-step-by-step-guide)**\n\n\n![gXVDWIJirUsWHJIXgf0zEbQcqLCnZNcEtZIrJm66_X4=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/gXVDWIJirUsWHJIXgf0zEbQcqLCnZNcEtZIrJm66_X4=.webp)\n\nGoogle Workspace, formerly known as G Suite, is a cloud-based suite of productivity and collaboration tools by Google. It includes popular applications such as Gmail, Google Drive, Google Docs, Sheets, Slides, and more. Google Workspace is designed to enhance communication and collaboration within teams and organizations, providing a seamless and integrated environment for productivity.\n\n**Key Features:**\n\n* Real-time Collaboration: Users can collaborate on documents, [spreadsheets](https://affine.pro/blog/best-project-planning-tools-software-for-teams-2023), and presentations, fostering teamwork and productivity.\n\n* Cloud Storage: Google Drive offers secure cloud storage for documents, files, and media, accessible from anywhere with an internet connection.\n\n* Integrated Communication: Gmail, Google Meet, and Chat facilitate seamless [communication](https://affine.pro/blog/top-asynchronous-communication-tools-free-2024), allowing users to connect and collaborate effortlessly.\n\n**Pros**\n\n* Collaboration and Accessibility: Facilitates easy collaboration and access to documents from various devices, promoting efficient teamwork.\n\n* Integrated Communication: Integrating email, video conferencing, and chat simplifies communication and enhances productivity.\n\n**Cons**\n\n* Learning Curve: Users new to the platform may experience a learning curve when adapting to the extensive features and functionalities.\n\n* Dependency on the Internet: The suite heavily relies on Internet connectivity, which may be a limitation in areas with poor or no Internet access.\n\n3.**[Alfresco](https://www.hyland.com/en/products/alfresco-platform)**\n\n\n![48NvFVyIqR-ErYAVD0LoV15jTixJ72K4crYHVBTMkNA=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/48NvFVyIqR-ErYAVD0LoV15jTixJ72K4crYHVBTMkNA=.webp)\n\nAlfresco is a content management system that provides a platform for document management, collaboration, and business process automation. It allowed organizations to manage and organize their content, streamline business processes, and collaborate effectively across teams.\n\n**Key features:**\n\n* Document Management: Alfresco facilitated the creation, organization, and secure management of documents and content.\n\n* Collaboration Tools: The platform included collaboration features to enhance teamwork and communication within organizations.\n\n* Business Process Automation: Alfresco supported the automation of business processes, improving efficiency and reducing manual work.\n\n**Pros**\n\n* Open Source Foundation: Alfresco historically had an open-source foundation, providing flexibility for organizations to customize and extend the platform to meet specific needs.\n\n* Document Management: Strong document management capabilities, allowing for efficient organization, version control, and collaboration on documents.\n\n* Integration Capabilities: Alfresco often boasted good integration capabilities with other enterprise systems, fostering a connected IT ecosystem.\n\n**Cons**\n\n* User Interface (UI): While this can be subjective, some users found the user interface to be less intuitive compared to other solutions, impacting user adoption.\n\n* Resource Intensive: Depending on the scale and complexity of the implementation, Alfresco could be resource-intensive, requiring robust infrastructure.\n\n4.**[Confluence](https://www.atlassian.com/software/confluence?&aceid=&adposition=&adgroup=138055852541&campaign=18312196225&creative=679816905333&device=c&keyword=confluence&matchtype=e&network=g&placement=&ds_kids=p72969649871&ds_e=GOOGLE&ds_eid=700000001542923&ds_e1=GOOGLE&gad_source=1&gclid=CjwKCAiAg9urBhB_EiwAgw88mRDtTOK6H8OfYWNPGpKIeCYeNvKkkuNiA_zm-6j6eYzxWuqU9RbvqRoCB2QQAvD_BwE&gclsrc=aw.ds)**\n\n\n![Vlfb_-ETv7ScfCALLFncW_GtA0602ktFh8n203YLMi8=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/Vlfb_-ETv7ScfCALLFncW_GtA0602ktFh8n203YLMi8=.webp)\n\nConfluence is a collaboration and documentation platform developed by Atlassian. It is designed to facilitate team collaboration by providing a centralized space for creating, sharing, and organizing content. Confluence is widely used for creating and managing documents, meeting notes, [project plans](https://affine.pro/blog/10-best-free-performance-review-templates-examples-2023), and other types of collaborative content within teams and organizations.\n\n**Key Features:**\n\n* Rich Content Creation: Confluence allows users to create rich and interactive content using a simple editor, making it easy to document ideas, projects, and processes.\n\n* Team Collaboration: The platform supports real-time collaboration, enabling team members to work together on documents, provide feedback, and stay informed about updates.\n\n* Integration with Atlassian Tools: Confluence seamlessly integrates with other Atlassian products, such as Jira and Bitbucket, providing a comprehensive solution for project management, development, and collaboration.\n\n**Pros**\n\n* Easy Collaboration: Confluence makes it easy for teams to collaborate and share information, fostering better communication and knowledge sharing.\n\n* Integration Ecosystem: Its integration with other Atlassian tools and a wide range of third-party apps enhances its functionality and adaptability to various workflows.\n\n**Cons**\n\n* Cost: Depending on the scale and features required, the cost of Confluence may be a consideration for smaller teams or organizations.\n\n* Learning Curve: Some users may find a learning curve when initially using Confluence, especially if they are not familiar with Atlassian's ecosystem.\n\n5.**[Zoho](https://www.zoho.com/)**\n\n\n![ccmdU_RJoNzPk3xlKjZlgGTPUQ2Q3rqcq6sCYk6WDM4=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/ccmdU_RJoNzPk3xlKjZlgGTPUQ2Q3rqcq6sCYk6WDM4=.webp)\n\nZoho is a software company that provides a suite of cloud-based applications for businesses. Zoho's product offerings cover a wide range of business functions, including customer relationship management (CRM), [project management](https://affine.pro/blog/how-to-memorize-things-fast-8-best-memorization-techniques-step-by-step-guide), collaboration, email, finance, and more. Offering cloud-based document storage and collaboration capabilities similar to SharePoint but with budget-friendly pricing plans.\n\n**Key Features:**\n\n* Integrated Suite: Zoho offers a comprehensive suite of business applications that can be used individually or integrated seamlessly to manage various aspects of business operations.\n\n* Customization: Many of Zoho's applications are highly customizable, allowing businesses to adapt the software to their specific needs and workflows.\n\n* Cloud-Based Collaboration: Zoho emphasizes cloud-based collaboration tools, enabling teams to work together from different locations and devices.\n\n**Pros:**\n\n* Affordability: Zoho is known for offering [cost-effective](https://affine.pro/blog/8-free-printable-vision-board-templates-examples-2023) solutions, making it accessible for small and medium-sized businesses.\n\n* Integration: The suite's applications are designed to work together seamlessly, providing a cohesive experience for users across different business functions.\n\n6.**[Jira](https://affine.pro/blog/15-best-free-jira-alternatives-agile-project-management-2023)**\n\n\n![GJ2ZGUFV4aQm76CcK_E_mNblGvUuthoBN3BWty0jTc0=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/GJ2ZGUFV4aQm76CcK_E_mNblGvUuthoBN3BWty0jTc0=.webp)\n\nJira is a widely used [time management](https://affine.pro/blog/top-10-best-time-management-software-tools-2023) and issue-tracking software developed by Atlassian. It is particularly popular among software development teams but is also utilized in various other industries for managing projects, tracking tasks, and facilitating collaboration.\n\n**Key Features:**\n\n* Issue Tracking: Jira provides a robust issue-tracking system, allowing teams to create, prioritize, and track tasks, bugs, and other project-related issues.\n\n* Agile Project Management: Jira supports agile methodologies with features like Scrum and Kanban boards, sprint planning, and backlog management, making it a valuable tool for agile software development.\n\n* Custom Workflows: Users can design custom workflows to match their specific project requirements, ensuring that processes align with the team's way of working.\n\n**Pros**\n\n* Real-time Collaboration: The instant messaging and real-time collaboration features make communication quick and efficient.\n\n* Integration Ecosystem: Slack offers a rich ecosystem of integrations with various tools and services, allowing users to streamline workflows and access information from different applications within Slack.\n\n**Cons**\n\n* Pricing: While Slack offers a free version, some users may find the pricing for premium plans to be relatively higher, especially for larger teams.\n\n* Learning Curve: Depending on the user's familiarity with similar tools, there might be a learning curve associated with understanding and maximizing the features of Slack.\n\n7.**[Trello](https://affine.pro/blog/best-trello-alternatives-2023-project-management)**\n\n\n![-mkrGOwY--i5vzyjwYvo-cIIO5RW_frGkZmXCX1p_JI=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/-mkrGOwY--i5vzyjwYvo-cIIO5RW_frGkZmXCX1p_JI=.webp)\n\nTrello is a visually oriented project management tool that simplifies tasks and project organization through boards, lists, and [mindmaps](https://affine.pro/blog/8-top-best-mindmap-making-software-project-planning-2023). It's widely used for its user-friendly interface and flexibility, making it suitable for teams of various sizes. A visual task management tool that allows users to organize their projects using boards and cards while collaborating with team members effortlessly.\n\n**Key Features:**\n\n* Boards, Lists, and Cards: Trello uses a visual system of boards, lists, and cards to represent projects. Boards contain lists, and lists contain cards representing individual tasks or items.\n\n* Drag-and-Drop Interface: Trello's user interface is designed for simplicity, allowing users to easily  [drag and drop cards](https://affine.pro/blog/10-best-flowchart-software-tools-2023-features-pricing) between lists, making task management straightforward.\n\n* Collaboration: Trello supports collaboration through features like comments, attachments, and due dates on cards, enabling teams to communicate and work together effectively.\n\n**Pros**\n\n* Visual Task Management: Trello's visual representation makes it easy to grasp project progress and individual tasks at a glance.\n\n* User-Friendly: Intuitive and easy to use, requiring minimal training for team members to get started.\n\n* Collaboration: Facilitates collaboration through comments, attachments, and real-time updates on tasks.\n\n**Cons**\n\n* Limited Advanced Features: It may lack some advanced project management features found in more robust tools.\n\n* Dependency on User Discipline: Success heavily relies on consistent use and updates by team memb\n\n8.**[Basecamp](https://basecamp.com/)**\n\n\n![mAZvVeli9jeyRtd0npgHSANAh1lXyoJybw_WqwsvutE=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/mAZvVeli9jeyRtd0npgHSANAh1lXyoJybw_WqwsvutE=.webp)\n\nBasecamp is a project management and team collaboration platform developed by Basecamp, LLC. It is designed to help teams and organizations [manage projects](https://affine.pro/blog/top-10-best-agile-project-scheduling-software-2023), share files, communicate, and collaborate effectively. Basecamp has been a popular choice for its simplicity and focus on centralizing project-related information in an easily accessible and organized manner.\n\nBasecamp is a project management and team collaboration platform developed by Basecamp, LLC. It is designed to help teams and organizations [manage projects](https://affine.pro/blog/top-10-best-agile-project-scheduling-software-2023), share files, communicate, and collaborate effectively. Basecamp has been a popular choice for its simplicity and focus on centralizing project-related information in an easily accessible and organized manner.\n\n**Key Features:**\n\n* Projects and To-Do Lists: Basecamp allows users to create projects and organize tasks using to-do lists, facilitating project planning and task management.\n\n* Message Boards and Discussions: The platform includes [message boards](https://affine.pro/blog/8-best-habit-tracker-apps-your-need-2023-features-price)  for team discussions, providing a centralized space for communication and updates.\n\n* File Sharing: Basecamp supports file sharing, enabling team members to upload and share documents, images, and other project-related files.\n\n**Pros**\n\n* User-Friendly Interface: Basecamp is known for its intuitive and user-friendly interface, making it easy for teams to adopt and use.\n\n* Centralized Communication: The platform centralizes communication, reducing the need for scattered emails and facilitating organized discussions.\n\n**Cons**\n\n* Limited Advanced Features: Some users may find that Basecamp lacks certain advanced project management features present in more complex tools.\n\n* Integration Limitations: While Basecamp does offer integrations, the options may be more limited compared to other project management tools.\n\n9.**[Slack](https://slack.com/intl/en-gb/)**\n\n\n![Td9FnFrXjNg-ZPHDQBfriiePqjGbTJBCHagGb7nRVwk=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/Td9FnFrXjNg-ZPHDQBfriiePqjGbTJBCHagGb7nRVwk=.webp)\n\nSlack is a widely used team collaboration platform that provides messaging, file sharing, and collaboration features for teams and businesses. It is known for its real-time communication capabilities and has gained popularity as a tool for improving team collaboration and reducing reliance on email. While primarily known as a messaging app, Slack's file-sharing capabilities make it a viable option for small teams needing basic document collaboration features.\n\n**Key Features:**\n\n* Channels: Slack organizes communication into channels, allowing teams to create dedicated spaces for specific projects, departments, or topics.\n\n* Real-time Messaging: Users can send direct messages, and group messages, and participate in real-time conversations, facilitating quick and efficient communication.\n\n* File Sharing and Integration: Slack allows users to share files, documents, and links directly within the platform. It also integrates with a wide range of third-party apps and services, enhancing its functionality.\n\n**Pros**\n\n* Real-time Collaboration: The instant messaging and real-time collaboration features make communication quick and efficient.\n\n* Integration Ecosystem: Slack offers a rich ecosystem of integrations with various tools and services, allowing users to streamline workflows and access information from different applications within Slack.\n\n**Cons**\n\n* Pricing: While Slack offers a free version, some users may find the pricing for premium plans to be relatively higher, especially for larger teams.\n\n* Learning Curve: Depending on the user's familiarity with similar tools, there might be a learning curve associated with understanding and maximizing the features of Slack.\n\n10.**[Airtable](https://www.airtable.com/platform)**\n\n\n![GREiz3MiNRkvq4Vd28sjVarkfE7VV-R_anSq0dMJALk=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/GREiz3MiNRkvq4Vd28sjVarkfE7VV-R_anSq0dMJALk=.webp)\n\nAirtable is a cloud-based collaboration platform that combines the features of a spreadsheet with a flexible database. It is known for its versatility and is used for various purposes, including [project management](https://affine.pro/blog/best-work-schedule-apps-2023-review), content planning, customer relationship management (CRM), and more.\n\n**Key features:**\n\n* Flexible Database Structure: Airtable allows users to create custom databases with a variety of field types, including text, attachments, checkboxes, and more. This flexibility makes it adaptable for different use cases.\n\n* Collaboration: Teams can collaborate on databases in real-time, similar to working on a shared spreadsheet. Multiple users can view and edit data simultaneously.\n\n* Rich Integrations: Airtable supports integrations with a wide range of apps and services, allowing users to connect their databases with other tools to streamline workflows.\n\n### AFFiNE: The Best Microsoft SharePoint Alternative for You\n\nAfter exploring the various alternatives and competitors to Microsoft SharePoint, it's clear that there are several robust options available in 2024. However, one solution stands out from the rest - **AFFiNE**. What sets AFFiNE apart from other alternatives is its focus on simplicity without compromising functionality. It provides a seamless user experience with easy-to-use features that require minimal training or technical expertise. With regular updates and enhancements based on users' feedback and industry trends, **AFFiNE** ensures that you stay ahead in today's rapidly evolving digital landscape.\n\n\n![zbG3OyD2z9FPXJE_MjOWGrV4jNdF8d6VWCmrXhUGi6w=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/zbG3OyD2z9FPXJE_MjOWGrV4jNdF8d6VWCmrXhUGi6w=.webp)\n\nWhile there are several options available, AFFiNE emerges as the best. Now that you have learned about what to look for in Microsoft SharePoint alternatives, it's time to put your knowledge into action. And what better way to do that than with **AFFiNE**? Commence xx by using AFFiNE's user-friendly tool. Presently, **AFFiNE** has launched its **[Stable Version](https://affine.pro/download)**, with ongoing efforts to develop a more comprehensive and dependable iteration. Join us on our voyage through our social media channels and be part of the experience. **Come and join us on our journey over on our media platforms. 🚀**\n\n* Official Website: [https://affine.pro/](https://affine.pro/)\n\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n\n* Twitter: [https://twitter.com/AffineOfficial](https://twitter.com/AffineOfficial)\n\n",
  "publish": true
}