{
  "title": "A UX Approach Towards Product Development",
  "authors": [
    "Guozhu Liu",
    "Ran Chen",
    "Fanjing Zhang"
  ],
  "tags": [
    "UX Open Day"
  ],
  "description": "As a fortnightly event, UX Open Day plays two roles",
  "created": 1656633600000,
  "updated": 1656633600000,
  "layout": "blog",
  "id": "ce5f68c1e9fb4097b5991291796eff7c",
  "slug": "a-ux-approach-towards-product-development",
  "cover": "https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/cwfPRfHYpcAhz3Ev4Le0Zh_684nvCE7M3nUo0LmaggI=.webp",
  "md": "---\n\ntitle: A UX Approach Towards Product Development\n\nauthor: Guozhu Liu , Ran Chen, Fanjing Zhang\n\ntags: UX Open Day\n\nslug: a-ux-approach-towards-product-development\n\ndescription: As a fortnightly event, UX Open Day plays two roles\n\ncreated: 2022-07-01\n\nupdated: 2022-07-01\n\nlayout: blog\n\npublish: true\n\n---\n\n\n![cwfPRfHYpcAhz3Ev4Le0Zh_684nvCE7M3nUo0LmaggI=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/cwfPRfHYpcAhz3Ev4Le0Zh_684nvCE7M3nUo0LmaggI=)\n\nAs a fortnightly event, UX Open Day plays two roles:\n\n* a lecture about UX;\n* a bridge connecting designers, developers and managers;\nWe hope that it deepens our understanding of UX, accelerates our R&D speed, and eventually reflects our slogan \"To shape, not to adapt\".\n\nIn this very first lecture, we talk about UX, its importance and the lessons we learned from other apps.\n\n# What are we talking about when we talk about UX\n\n## UX ensures that your product helps rather than hinders users\n\nA cup that fulfills the principle of utility (that is to say, absolutely functional as a cup holding water) may not be a good cup in the sense of UX because its design hinders users instead of helping them:\n\n\n![5Q0QklEI2S06N0OTkka0_MuflOvPDVF25v1ga4QGnwc=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/5Q0QklEI2S06N0OTkka0_MuflOvPDVF25v1ga4QGnwc=)\n\n## UX guides design and the subsequent development\n\nA design solution, which did not consider UX, may not satisfy the need of users, even if it has some value in aesthetics. Users would like to seek a natural way to complete the task, like well-demonstrated in this picture:\n\n\n![jjnFk7wroWdAb7lrokdngz9W21tniMtSe8pAZaz7Wdk=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/jjnFk7wroWdAb7lrokdngz9W21tniMtSe8pAZaz7Wdk=)\n\nhttps://uxmag.com/articles/three-lessons-a-meme-taught-me-about-user-experience\n\nDuring product development, it’s the duty of UX designers to seek the needs of users, then provide better solutions.\n\n## UX is not another buzzword\n\n* Usability = Usable User\n* Experience = User-Friendly\n* Usability: Can users accomplish their goal?\n* User Experience: Is user experience as delightful as possible?\n> The design is not just what it looks like and feels like. The design is how it works — Steve Jobs\n\n# Ready for aesthetic challenges?\n\n## Function first\n\nBack to the old days (and the golden days of engineers), in a world where software fought hard to be useful, functions were the ultimate needs of final users, who focused mainly on how to fulfill practical tasks. Like my Base:\n\n\n![cTfVS7uJnI-PGeceWRlDS_8iILuCXWjAB9BAfh1YIz0=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/cTfVS7uJnI-PGeceWRlDS_8iILuCXWjAB9BAfh1YIz0=)\n\n## Aesthetic rises\n\nWhen there had been enough alternatives for users to choose, UIs, especially good-looking UIs, started to gain more attention. Like Evernote:\n\n\n![wUb0LRiZG58meOYlAASGIakCLyfbQ4LIfxSk982rMAk=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/wUb0LRiZG58meOYlAASGIakCLyfbQ4LIfxSk982rMAk=)\n\n## Aesthetic rules\n\nNowadays, users are flooded with choices, they become too fussy and are paying more and more attention to the design. Intentionallly limiting users' choices becomes the dominant design solution. For example, the limited but carefully-selected color palette of Notion prevails over the traditional solution which is afarid of restricting users’ choices.\n\n\n![eYsPxdbIJFzH_hZ9c4BMPRKitcImrz3U772eWWq4yk0=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/eYsPxdbIJFzH_hZ9c4BMPRKitcImrz3U772eWWq4yk0=)\n\n## Aesthetic is all\n\nThe increase of alternatives in almost every field will finally lead to the situation that UX become the decisive factor that users make their judgement.\n\nThink of CleanMyMac X, it offers very basic file management functions that Apple itself has. However, it looks so good and simply by its look is enough to attract users.\n\n\n![7bilaKwsPPBo3oz_F6zavhXiwbhIa3kJKOH6wIG67VI=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/7bilaKwsPPBo3oz_F6zavhXiwbhIa3kJKOH6wIG67VI=)\n\n## The Arms Race of UI/UX continues…\n\nThis situation challenges designers in both technical and aesthetical aspects. As the threshold of UX is being risen up higher and higher, even [a timeline](https://www.google.com/search/howsearchworks/our-history/) has to be very impressive in its visual presentation, so much so that it needs to be a work of art to please users.\n\n# What are we talking about when we talk about UX in Affine\n\nAs a UX designer, making fancy, superficial requirements to the dev guys sometimes would be too offensive…\n\n\n![c3vcry67Bxbkho4XUiNuW3erM5yPkozRzSc5kxinEhA=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/c3vcry67Bxbkho4XUiNuW3erM5yPkozRzSc5kxinEhA=)\n\n## The balance between Usability and UX regarding the approaching deadline of delivery/handoff\n\n* Don’t be afraid of letting the low-fi prototyping to be a part of an MVP;\n* Invite real users to take part in the heuristic evaluation;\n* Try dedicated/professional user testing tools. 🔬[2021 Design Tools Survey | UX Tools](https://uxtools.co/survey-2021#user-testing)\n",
  "publish": true,
  "order": 55
}