{
  "title": "AFFiNE 0.8.0 preview - Launch Week - Day 1/5",
  "authors": [
    "Xuan Pang",
    "Jackie Peng",
    "Enther"
  ],
  "tags": [
    "Release Note"
  ],
  "description": "Discover the power of AFFiNE, the ultimate alternative to Notion, Miro, and Monday. This article presents the upcoming AFFiNE 0.8.0, revealing revolutionary features that encompass a revamped UI/UX, upgraded Notion import functionality, accelerated loading speeds, and exciting plugin support preview.",
  "created": 1692576000000,
  "updated": 1692576000000,
  "layout": "blog",
  "id": "pNNzTy0vYM",
  "slug": "affine-080-launch-week-day1",
  "cover": "https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/gchsXagdFwSHwz-ECiC6cQ42CE6_Ak5aFRlMXOgE-qQ=.webp",
  "md": "---\n\ntitle: \"AFFiNE 0.8.0 preview - Launch Week - Day 1/5\"\n\nauthor: Xuan Pang, Jackie Peng, Enther\n\ntags: Release Note\n\nslug: affine-080-launch-week-day1\n\ndescription: \"Discover the power of AFFiNE, the ultimate alternative to Notion, Miro, and Monday. This article presents the upcoming AFFiNE 0.8.0, revealing revolutionary features that encompass a revamped UI/UX, upgraded Notion import functionality, accelerated loading speeds, and exciting plugin support preview.\"\n\ncreated: 2023-08-21\n\nupdated: 2023-08-21\n\nlayout: blog\n\npublish: true\n\n---\n\n\n\n\n![gchsXagdFwSHwz-ECiC6cQ42CE6_Ak5aFRlMXOgE-qQ=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/gchsXagdFwSHwz-ECiC6cQ42CE6_Ak5aFRlMXOgE-qQ=)\n\n**Welcome to the highly anticipated launch week of AFFiNE 0.8.0!** We are thrilled to present an array of groundbreaking features and a redesigned user experience that will speed AFFiNE up from the inside out.\n\nOn the first day of the AFFiNE 0.8.0 launch week, we will introduce you to the exciting updates, including revamped UI/UX, upgraded import functionality with Notion, accelerated loading speeds, and exciting plugin support preview. Get ready to unlock new levels of productivity and immerse yourself in a seamless and efficient workflow.\n\n**Join us as an early access sponsor for the AFFiNE Cloud, and unlock advanced collaboration capabilities while upholding the local-first nature of your data.**\n\n**Support Us:** [https://community.affine.pro/checkout/affine-cloud-early-supporter](https://community.affine.pro/checkout/affine-cloud-early-supporter)\n\n\n\n## A better file system for faster navigation\n\n### ① Redesigned Sidebar - Effortless Workspace Switching\n\nWe noticed that many of you have been switching between a number of workspaces. In our redesigned sidebar, we’ve improved the navigation panel to enhance speed and efficiency when creating, resorting, or managing workspaces & files.\n\n\n![4Rgf9WnFoDfDZ6RuHyEZQ7DisF42H25NeCHx4yzHSso=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/4Rgf9WnFoDfDZ6RuHyEZQ7DisF42H25NeCHx4yzHSso=)\n\n## ② Enhanced UI for Settings Icons: Aesthetic Refinement Across the Board\n\nOur sidebar, all pages, settings, and all pop-ups in AFFiNE now have a more consistent and refined look. A stunning makeover of our design system that began with version 0.7.0 has further enhanced the overall aesthetic across the app. We believe in the beauty of details, and this update is about making your experience with AFFiNE not only functional but also a delight to look at.\n\nSupporting multiple editing modes in one editor can be a significant undertaking, especially when it comes to the UI components systems. The technical difficulties arise from our aim to provide a consistent look for AFFiNE, a React application, with Radix UI and BlockSuite as the editing framework built on lit with raw JS and CSS.\n\nThe UI component library and design system of AFFiNE have been independently open-sourced as AFFiNE-UI and AFFiNE Design respectively, and issues, comments, PRs or any of your contributions will all be appreciated!\n\n\n![e6OHT76RDKqrl-mZo4XPgQBiGJmbgYAO0bH2Y_ywvZY=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/e6OHT76RDKqrl-mZo4XPgQBiGJmbgYAO0bH2Y_ywvZY=)\n\n\n![HKeCGa5TzNNvQ7QgqX8mXm9rsrFa0Rc9cpPobd4cTCc=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/HKeCGa5TzNNvQ7QgqX8mXm9rsrFa0Rc9cpPobd4cTCc=)\n\n### ③ Elevated Notion Import - Import Your Database with One Click\n\nSome users complain that many apps still don't support Notion database imports. But guess what? AFFiNE has tackled this head-on. With our elevated Notion Import feature, you can now bring in your database with just one click.\n\n\n![9PPonIQJsf1E1RaQYcOj62GxPOl2zoKSXZNDTj4rBDs=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/9PPonIQJsf1E1RaQYcOj62GxPOl2zoKSXZNDTj4rBDs=)\n\n\n\n# Total speed-up for loading and switching between contents\n\n### ① Enhanced Workspace Execution Speed - Turbocharge Your Workflow\n\nFor the developers, the compilation speed in AFFiNE 0.8.0 has been boosted by four to five times; for users, individual workspace loading has accelerated by around three times, with the loading speed of workspaces comprising several hundred pages now matching that of a single-page workspace. Now, you can take advantage of the \"⌘+R\" or \"Ctrl+R\" shortcut to refresh the workspace and directly witness the noticeable acceleration!\n\n\n![raXiuidRf_YxZxFuLhZX0y3_z6A7bCHiRnw6aQ1VixU=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/raXiuidRf_YxZxFuLhZX0y3_z6A7bCHiRnw6aQ1VixU=)\n\n### ② Boosting App Speed for Optimal Performance\n\n\n![YZ1xawg-qWKzm9hUXoCK13cqGkpN7jKzfEImGLrLsr4=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/YZ1xawg-qWKzm9hUXoCK13cqGkpN7jKzfEImGLrLsr4=)\n\nSwitching between workspaces and files are never this fast before. We have overhauled our app's loading logic to significantly improve the speed of file initialization. To be more specific, we have eliminated Next.js and meticulously tailored our webpack build configuration. Next.js may be a great framework for multi-page sites, but it is definitely not ideal for a data-centric application like AFFiNE. Total Control of What Is Inside AFFiNE -- Open Plugin System Preview\n\n### ①  Automation & Integration - Simplify Your Complex Workflows\n\nAutomation is the process of enhancing work and productivity through the provision of APIs/SDKs that can directly manipulate your application's data to users, enabling you to leverage plugin systems or streamlined robotic workflows or even integrations with other platforms. From simplifying complex workflows to creating synergy between various apps and devices, our platform will empower you to take control.\n\n### **② Theme and customized behavior - Personalize Your Experience**\n\nWith our theme and customized behavior features preview, we're putting you in the driver's seat. Through open APIs and user-friendly interfaces, you will be able to tailor the format, layout, and aesthetics of your workspace to mirror your unique style.\n\n### **③ Support of Third-Party Blocks - Unleash Possibilities**\n\nWe're thrilled to introduce the ability to seamlessly incorporate external blocks, such as bookmark, into your projects in the future. You are allowed to elevate your designs with specialized features, from websites to presentations and explore a diverse range of options and expand your creative toolkit.\n\n\n![0hGbQTucXas4qOw0k332k4OrNGZdGkzyZ8WyQ3jipdM=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/0hGbQTucXas4qOw0k332k4OrNGZdGkzyZ8WyQ3jipdM=)\n\n### ④ **Built-in control of network&storage permissions of plugins - Empower Your Privacy**\n\nWe prioritize your privacy and data ownership. Any component that requires a web access will be made as a plugin in AFFiNE, and we will make sure that you can have a total control over their permissions on both local and remote storage. That's why we're excited to introduce our local-first approach, putting you in command of your information. With built-in networks and storage permission controls for plugins, you can trust that your data stays secure and under your control.\n\n\n![i67_fIXFLRo4UgGkvaWOQ7uxg_4s-zv6WOuchZZsjKE=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/i67_fIXFLRo4UgGkvaWOQ7uxg_4s-zv6WOuchZZsjKE=)\n\nIn this update, we're putting speed at the forefront, transforming your interaction from the inside out. For developers, compilation speed has taken a leap forward, turbocharging efficiency. Meanwhile, users will revel in faster loading times, experiencing a seamless journey.\n\nGet ready to unlock new levels of productivity\n\n* Official Website: [https://affine.pro/](https://affine.pro/)\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n* Telegram: [https://t.me/affineworkos](https://t.me/affineworkos)\n\n\nRelease Week:\n\nDay 1: [https://affine.pro/blog/affine-080-launch-week-day1](https://affine.pro/blog/affine-080-launch-week-day1)\n\nDay 2: [https://affine.pro/blog/affine-080-launch-week-day2](https://affine.pro/blog/affine-080-launch-week-day2)\n\nDay 3: [https://affine.pro/blog/affine-080-launch-week-day3](https://affine.pro/blog/affine-080-launch-week-day3)\n\nDay 4: [https://affine.pro/blog/affine-080-launch-week-day4](https://affine.pro/blog/affine-080-launch-week-day4)\n\nDay 5: [https://affine.pro/blog/affine-080-launch-week-day5](https://affine.pro/blog/affine-080-launch-week-day5)\n\n\n\n**AFFiNE v0.8.0 Release Week Video Highlights: [https://www.youtube.com/playlist?list=PLxPzPSyKaafTenqYnRKRBOzAuopZmV2BK](https://www.youtube.com/playlist?list=PLxPzPSyKaafTenqYnRKRBOzAuopZmV2BK)**\n\n\n\n## Support Us: Become an Early Access Sponsor to try out AFFiNE Cloud starting from September!\n\n\n![flDBAikMzQhG8jKLpZtfJH2pOuwCSeLvU8kuuh0bGpw=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/flDBAikMzQhG8jKLpZtfJH2pOuwCSeLvU8kuuh0bGpw=)\n\nJoin us as an early access sponsor for the AFFiNE Cloud, and unlock advanced collaboration capabilities while upholding the local-first nature of your data. As a token of our appreciation, you'll enjoy:\n\n* **Early Access,** be among the first to experience AFFiNE Cloud's powerful features, including permission settings and control.\n* **One-year Free Pro Plan,** have a complimentary one-year premium AFFiNE Pro Plan subscription, packed with advanced tools to boost your productivity and creativity.\n* **Lifetime 50% Discount on Pro Plan**, benefit from a lasting 50% discount as long as you continue to find value in your subscription.\n* **Other details:**\n  * AFFiNE Cloud enhances collaboration without compromising your data's local-first\n  * The free plan will remain available and always an option, with ongoing improvements.\n* More details: [https://affine.pro/blog/affine-cloud-early-access](https://affine.pro/blog/affine-cloud-early-access)\n",
  "publish": true
}