{
  "id": "xgfpVKe1rr",
  "title": "AFFINE v0.8.0 Release Week Day 5",
  "author": "Xuan Pang, Jackie Peng, Enther",
  "tags": [
    "Release Note"
  ],
  "slug": "affine-080-launch-week-day5",
  "description": "Discover the power of AFFiNE, the ultimate alternative to Notion, Miro, and Monday. This article presents the upcoming AFFiNE 0.8.0, revealing exciting AFFiNE Cloud.",
  "created": 1692921600000,
  "updated": 1692921600000,
  "layout": "blog",
  "publish": true,
  "authors": [
    "Xuan Pang",
    "Jackie Peng",
    "Enther"
  ],
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/sTMOBt9tvZaGkH_8uXD02w6s6agn5NW5XeTaVQSKn58=",
  "coverAlt": "",
  "md": "\n\n\n\n\n\n**Welcome to the highly anticipated launch week of AFFiNE 0.8.0!** We are thrilled to present an array of groundbreaking features and a redesigned user experience that will redefine the way you work.\n\n\n**On the last day** of the AFFiNE 0.8.0 Preview launch week, we are excited to introduce you to a new function: **AFFiNE Cloud**. With AFFiNE Cloud, you can unlock a range of powerful capabilities designed to enhance your productivity and collaboration.\n\n\n**Join us as an early access sponsor for the AFFiNE Cloud, and unlock advanced collaboration capabilities while upholding the local-first nature of your data.**\n\n\n**Support Us:** https://community.affine.pro/checkout/affine-cloud-early-supporter\n\n\n\n\n\n## Real-time Sync Local First AFFiNE Cloud, Finally Available\n\n\n\n\n\n### ① Local-First: Embrace Independence from Cloud during Creation\n\n\n\n\n\n1. Offline Support: Picture this scenario: you're deeply engrossed in creating, and suddenly, your internet connection falters. Fear not! AFFiNE preserves all your data on your device. Even if your internet drops, your progress remains intact.\n\n\n1. Free from Login Account Requirement: Unlike most software that insists on online presence and logging in, AFFiNE bucks the trend. You can dive into creation without an account. Your work stays close to you, no entanglements required.\n\n\n\n\n\n\n![9ceTNxWRv68Qy9lQ3BCttqAbAl79pgcPam3GqCEvufo=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/9ceTNxWRv68Qy9lQ3BCttqAbAl79pgcPam3GqCEvufo=)\n\n\n\n\n\n### ② Multi-Endpoint Real-time Sync: Seamlessly Link Your Devices\n\n\n1. Sync Swiftly: Thanks to AFFiNE Cloud, your creative endeavors can flow effortlessly across various devices. Picture commencing a project on your computer and effortlessly picking it up on other devices. Upon reconnecting, your edits sync up rapidly and seamlessly, ensuring your workflow remains uninterrupted.\n\n\n1. Harmonious Coherence: In stark contrast to some other softwares, where offline writing can lead to chaos upon returning online, AFFiNE Cloud's technology guarantees the smooth convergence of your work, regardless of where you were creating.\n\n\n\n\n\n\n![cBaHvmUB9zHgaUfNsC86B42gzWonBsk94kxu2WcQqVU=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/cBaHvmUB9zHgaUfNsC86B42gzWonBsk94kxu2WcQqVU=)\n\n\n\n\n\n### ③ Upcoming Self-Hosting Service: Empowering Your Data and Connections\n\n\n1. Privacy Assured: Imagine owning a self-hosted AFFiNE. With the soon-to-arrive self-host Docker solution, seamless synchronization between devices becomes reality. Your data remains exclusively yours, devoid of central server involvement. All uploads reach your server, not some distant corporation's.\n\n\n\n\n\n\n![X8OP9Ob_50YnkRITd5-QFfFyug4sd6bfk0ajsJQ3Ho0=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/X8OP9Ob_50YnkRITd5-QFfFyug4sd6bfk0ajsJQ3Ho0=)\n\n\n\n\n\nRelease Week:\n\n\nDay 1: https://affine.pro/blog/affine-080-launch-week-day1\n\n\nDay 2: https://affine.pro/blog/affine-080-launch-week-day2\n\n\nDay 3: https://affine.pro/blog/affine-080-launch-week-day3\n\n\nDay 4: https://affine.pro/blog/affine-080-launch-week-day4\n\n\nDay 5: https://affine.pro/blog/affine-080-launch-week-day5\n\n\n\n\n\n**AFFiNE v0.8.0 Release Week Video Highlights: [https://www.youtube.com/playlist?list=PLxPzPSyKaafTenqYnRKRBOzAuopZmV2BK](https://www.youtube.com/playlist?list=PLxPzPSyKaafTenqYnRKRBOzAuopZmV2BK)**\n\n\n\n\n\n# **Get ready to unlock new levels of productivity**\n\n\n* Official Website: [https://affine.pro/](https://affine.pro/)\n\n\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n\n\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n\n\n* Telegram: [https://t.me/affineworkos](https://t.me/affineworkos)\n\n\n## Support Us: Become an Early Access Sponsor to try out AFFiNE Cloud starting from September!\n\n\n\n![flDBAikMzQhG8jKLpZtfJH2pOuwCSeLvU8kuuh0bGpw=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/flDBAikMzQhG8jKLpZtfJH2pOuwCSeLvU8kuuh0bGpw=)\n\n\nJoin us as an early access sponsor for the AFFiNE Cloud, and unlock advanced collaboration capabilities while upholding the local-first nature of your data. As a token of our appreciation, you'll enjoy:\n\n\n* **Early Access,** be among the first to experience AFFiNE Cloud's powerful features, including permission settings and control.\n\n\n* **One-year Free Pro Plan,** have a complimentary one-year premium AFFiNE Pro Plan subscription, packed with advanced tools to boost your productivity and creativity.\n\n\n* **Lifetime 50% Discount on Pro Plan**, benefit from a lasting 50% discount as long as you continue to find value in your subscription.\n\n\n* **Other details:**\n\n\n  * AFFiNE Cloud enhances collaboration without compromising your data's local-first\n\n\n  * The free plan will remain available and always an option, with ongoing improvements.\n\n\n* More details: [https://affine.pro/blog/affine-cloud-early-access](https://affine.pro/blog/affine-cloud-early-access)\n\n\n",
  "createDate": 1692934991409,
  "updatedDate": 1695365449204,
  "favorite": false,
  "guid": "b907524e-02dc-4d29-b4aa-c3c3253f90c2",
  "valid": true,
  "relatedBlogIds": [],
  "linkedPageIds": [],
  "relatedBlogs": []
}