{
  "author": "Jiachen He, Fangyuan Zheng, Xiwen Tu",
  "authors": [
    "Jiachen He",
    "Fangyuan Zheng",
    "Xiwen Tu"
  ],
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/oSmlB48rgShBiKSetZZnBGQS1qfcpu7uQPKpVVp2pUU=",
  "coverAlt": "",
  "createDate": 1680147991871,
  "created": 1658448000000,
  "description": "Thank you very much for your attention to AFFiNE! Some exciting changes in AFFiNE are as follows",
  "guid": "089f4245-252b-4d7f-b313-4297e1ddaf18",
  "id": "b1cfcca7765247e68cb298ee6ddefe5a",
  "layout": "blog",
  "linkedPageIds": [
  ],
  "md": "**Thank you very much for your attention to AFFiNE! Some exciting changes in AFFiNE are as follows:**\n\n\n### **Bug Fixes**\n\n\nIn our continued effort to make AFFiNE the most reliable workOS platform, fixing bugs is always our main concern. Here's our work in the last few days:\n\n\n* Fixed: When executing paste in input-component, content is rendered in the block;\n\n\n* Fixed: In the editor, a part of the content will be covered when the toolbar is active at the bottom;\n\n\n* Fixed: Can’t auto resize images, and a part of the content will be covered when separate images are inside a multi-column grid;\n\n\n* Fixed: Occur a “JS Error” when deleting the YouTuBe block;\n\n\n* Fixed: “Align” property isn’t persistent in Inline Menu.\n\n\n### Improvement\n\n\nIn our continued effort to make AFFiNE the most reliable all in one knowledge base 展开, optimizing user experience is always our main concern. Here's our work in the last few days:\n\n\n* Improvement: Autofocus in the title area when a new page is created;\n\n\n* Improvement: Replace GrouyBy Setting Icon in Kanban view;\n\n\n* Improvement: Add a border to inner components in Kanban view;\n\n\n* Improvement: Dragging card add opacity in Kanban view;\n\n\n* Improvement: Favicon upgraded to a new design;\n\n\n* Improvement: Welcome page and landing page merged into one page.\n\n\nAFFiNE is currently in the early alpha stage with limited access, and public early access will be available in the autumn of 2022.\n\n\nAFFiNE is an open-source project which can be viewed on Github: [https://github.com/toeverything/AFFiNE#readme](https://github.com/toeverything/AFFiNE#readme)\n\n\nIf you endorse this open source project, please help us by clicking the GitHub star, which is crucial for the future development of AFFiNE.\n\n\nAFFiNE is very grateful to all open source contributors and will work to build a more positive open source ecosystem.\n\n\nHope you have a nice time with AFFiNE!\n\n\n",
  "publish": true,
  "relatedBlogIds": [
  ],
  "relatedBlogs": [
  ],
  "slug": "affine-0722-v0.0.1-alpha.0.2.2-release-notes",
  "tags": [
    "Release Note"
  ],
  "title": "AFFiNE 0722 V0.0.1-alpha.0.2.2 Release Notes",
  "updated": 1658448000000,
  "valid": true
}