{
  "author": "Yuhang Zhao, Yixuan Guo, Meng Cen",
  "authors": [
    "Yuhang Zhao",
    "Yixuan Guo",
    "Meng Cen"
  ],
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/DioZFnJGG7MAFwGSdNxCC6txNIgIM1yR4Cgms7mFxHk=",
  "coverAlt": "",
  "createDate": 1709200924579,
  "created": 1709164800000,
  "description": "Explore enhanced creativity with Day 2 of our 0.12.0 launch week! This update empowers users to control content visibility, access the Whiteboard Scissors Tool effortlessly, and boost productivity with versatile new templates.",
  "guid": "8ecSFwszDfpIf3dLs3af5",
  "id": "8ecSFwszDfpIf3dLs3af5",
  "layout": "blog",
  "linkedPageIds": [
  ],
  "md": "\n\n\nStep into the world of curated creativity with Day 2 of our 0.12.0 launch week! This update introduces significant features to enhance your workflow: now you can dictate the visibility of your content, easily access the Whiteboard Scissors Tool, and experience increased productivity through the versatility of our new templates.\n\n\n\n\n\n**We're excited to announce that AFFiNE has secured 2nd Place as Product of the Day on ProductHunt—thanks to your incredible support! The voting isn't over yet, and we'd love for you to keep backing us in this thrilling adventure: [AFFiNE on ProductHunt](https://www.producthunt.com/leaderboard/daily/2024/2/26/all).**\n\n\n\n\n\n# **Control Your Own Content: The Ability to Decide The Visibility of Content**\n\n\n\n\n\nWhether on a page or whiteboard, you now have the option to **selectively display specific content**. Simply switch to Edgeless Mode and choose your preferred **Display Mode option (show in Edgeless/Page/Both)**. This empowers you to present more flexible and diverse content structures, **putting you in full control of how your content is showcased!**\n\n\n<video muted autoplay loop preload=\"auto\" playsinline>\n  <source src=\"https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/-M7z9LZQus--dzUO2Fb8isAyQGUEQ73N904a3RX1DIA=\" type=\"video/mp4\" />\n</video>\n\n\n# **Whiteboard Scissors Tool Now Easily Accessible**\n\n\n\n\n\nIn our latest update, version 0.12.0, we've revamped the layout of our whiteboard interface to enhance user experience. One notable change is the relocation of the scissors tool, now conveniently nestled on the right side of the toolbar. This adjustment serves a crucial purpose: to safeguard your creative endeavors from unintended alterations. Now, when you select a note, the scissors icon is readily accessible, reducing the likelihood of accidental modifications while you engage with the whiteboard's features.\n\n\n<video muted autoplay loop preload=\"auto\" playsinline>\n  <source src=\"https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/4Gfe-jG4d3g_0UNH2URtCPXIATTb4xaH9q_fG2s_vAU=\" type=\"video/mp4\" />\n</video>\n\n\n# **Next-Level Productivity: The Power of Our New Templates**\n\n\n## 1. 5W2H Critical Questions\n\n\nThe 5W2H Critical Questions template systematically analyzes problems or projects by addressing Who, What, When, Where, Why, How, and How much. It ensures thorough examination, clarity, alignment, and effective problem-solving. Pain points such as lack of direction, incomplete analysis, miscommunication, and ineffective solutions are addressed through comprehensive utilization of the template, leading to better decision-making and problem-solving outcomes.\n\n\n##### User case | Analyzing the 5W2H of Reducing Customer Wait Times at a Restaurant\n\n\nThis case examines how a restaurant used the 5W2H analysis to cut down customer wait times, serving as a practical guide for restaurant managers and service optimization experts. It moves from pinpointing the issue to rolling out solutions, underlining the commitment to bettering customer experience and service speed. By looking into the causes of wait times, who's involved, when and where they happen, and the steps taken to improve, the case shows how reducing wait times not only boosts customer satisfaction but also gives the restaurant a competitive edge. This reflects the restaurant's focus on improving service flow and enhancing customer loyalty.\n\n\n\n![zj3_cPSSQ5olTdWecugNjXbQ6fKubANZcxleOYkszSU=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/zj3_cPSSQ5olTdWecugNjXbQ6fKubANZcxleOYkszSU=)\n\n\n## 2. 4P Marketing Matrix\n\n\nFaced with the challenge of launching a new product or enhancing market share? The 4P Marketing Mix model offers a solution by allowing you to outline four controllable elements—product, place, promotion, and pricing. This approach enables you to craft the ideal strategy for introducing a new product or service to the market successfully.\n\n\n##### User case | Analyzing Jellycat's Marketing Strategy Through the 4P Marketing Matrix\n\n\nThis brief encapsulates the application of the 4P Marketing Matrix to Jellycat's strategic approach, designed for marketing enthusiasts and professionals. It delineates the progression from distinctive product creation to securing a coveted market position, emphasizing Jellycat's dedication to offering uniquely designed, high-quality plush toys, adopting premium pricing strategies, selecting exclusive distribution channels, and leveraging targeted promotion efforts. This matrix reflects Jellycat's commitment to maintaining brand integrity and market differentiation, underscoring its pursuit of excellence and customer loyalty in the competitive landscape of plush toys.\n\n\n\n![Gm0mGBHBhrQrkro3H9AQRjyEu8hONPltMwW0X1ir8JE=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/Gm0mGBHBhrQrkro3H9AQRjyEu8hONPltMwW0X1ir8JE=)\n\n\n## 3. Project Planning Template\n\n\nA project planning template offers a standardized framework for planning, enhancing efficiency, clarity, and alignment among team members and stakeholders. It assists in risk management, resource allocation, and tracking progress.\n\n\n##### User case | Designing an Innovative Smart Home Thermostat\n\n\nThis case highlights the development of a user-friendly and energy-efficient smart home thermostat, targeting product designers and technology developers. It outlines the process from idea to market, focusing on strategic planning, user-centric design, and smart ecosystem integration. The case shows how understanding user behavior and applying innovative design principles can lead to a device that optimizes comfort and energy use, emphasizing the importance of innovation and customer engagement in the smart home market.\n\n\n\n![E3hrDCm7S1K4K4ABoT9bhPzGBOR9RmrpdENpdcbo5fY=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/E3hrDCm7S1K4K4ABoT9bhPzGBOR9RmrpdENpdcbo5fY=)\n\n\n# **Get Ready to Unlock New Levels of Productivity**\n\n\nAs we wrap up our AFFiNE 0.12.0 launch week, we want to extend our heartfelt appreciation for your interest and backing. Our journey to optimize AFFiNE is ongoing, and we're dedicated to improving it. **Now, let's take a brief moment to look back at the informative articles we shared throughout this dynamic launch week:**\n\n\nDay 1: [https://affine.pro/blog/affine-0-12-0-launch-week-day1-3-a-new-frontier-in-note-taking-daily-notes-card-views-bookmarks-and-everything-in-between](https://affine.pro/blog/affine-0-12-0-launch-week-day1-3-a-new-frontier-in-note-taking-daily-notes-card-views-bookmarks-and-everything-in-between)\n\n\n\n\n\n* Official Website:[https://affine.pro/](https://affine.pro/)\n\n\n* GitHub:[https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n\n\n* Twitter:[https://twitter.com/AffineOfficial](https://twitter.com/AffineOfficial)\n\n\n* Community:[https://community.affine.pro/home](https://community.affine.pro/home)\n\n\n* Discord:[https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n\n\n* Telegram:[https://t.me/affineworkos](https://t.me/affineworkos)\n\n\n\n\n\n**Gratitude again for propelling AFFiNE to 2nd Place on ProductHunt! Your ongoing encouragement holds immense value for us. Come and support AFFiNE here: [AFFiNE on ProductHunt](https://www.producthunt.com/leaderboard/daily/2024/2/26/all).**\n\n\n",
  "publish": true,
  "relatedBlogIds": [
  ],
  "relatedBlogs": [
  ],
  "slug": "AFFiNE-0.12.0-Launch-Week-Day2-3-Display-Management-and-Template-Refinement-Enhanced-Visibility-More-Possibilities",
  "tags": [
    "Release Note"
  ],
  "title": "AFFiNE - 0.12.0 Launch Week - Day2/3: Display Management and Template Refinement: Enhanced Visibility, More Possibilities",
  "updated": 1709164800000,
  "updatedDate": 1709288060327,
  "valid": true
}