{
  "author": "Jackie Peng, Xuan Pang",
  "authors": [
    "Jackie Peng",
    "Xuan Pang"
  ],
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/CQiQ9Wwl-paqEsllgzTqLP9xOpow_hUGKXfYcAYtEIk=",
  "coverAlt": "",
  "createDate": 1691720466596,
  "created": 1691625600000,
  "description": "Unlock the future of collaboration with AFFiNE Cloud's Early Access sponsorship. Gain exclusive benefits like early feature access, a free one-year Pro Plan subscription, and a permanent 50% discount. Shape the evolution of seamless and secure collaboration today!",
  "favorite": false,
  "guid": "12465ecb-f5c9-453a-a07f-d5b7f9ffc798",
  "id": "Wy2uLJj036",
  "layout": "blog",
  "linkedPageIds": [
  ],
  "md": "## 1) Cloud Functionalities showcase\n\n\n### **① Effortless Login for Instant Connectivity**\n\n\n\n![o6609t8AwTqbA8fIr09I7W-ydUfKiGOFq1juFEbGy7M=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/o6609t8AwTqbA8fIr09I7W-ydUfKiGOFq1juFEbGy7M=)\n\n\nBegin your collaborative journey effortlessly through a user-friendly login, leaving behind complex authentication. Our streamlined process ensures seamless project access, with **upcoming support for multiple emails, self-host support and one-click log-in**.\n\n\n### ② E**mpowerment through Permissions for Precise Control**\n\n\n\n![_2G4QNY-HRnQxhnk1sEm_K1EQsFAY8oq-rzdozanyMI=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/_2G4QNY-HRnQxhnk1sEm_K1EQsFAY8oq-rzdozanyMI=)\n\n\nCollaboration thrives in an environment of trust and control. At AFFiNE Cloud, we've crafted a robust permission system that empowers document owners to dictate edit and view rights. This level of granularity guarantees that sensitive information remains confidential while facilitating collaboration.\n\n\n### ③ **Unleash Creativity with Collaborative Edgeless Mode**\n\n\nWe understand that collaboration is a widespread concept, and many applications provide this functionality. Wait, doesn't the idea of being confined to document-based collaboration sometimes feel a bit boring?\n\n\nWell, at AFFiNE Cloud, it's time to break free from boring stuff and reimagined collaboration beyond the confines of traditional document modes: collaborative whiteboarding - where you can leverage pens, shapes, images and connectors to collaborate with others on a canvas as limitless as your imagination.\n\n\n\n![jjKkV-ai7hORH_aVcXIsd_GGYmLYifhYodvCBZDBDJY=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/jjKkV-ai7hORH_aVcXIsd_GGYmLYifhYodvCBZDBDJY=)\n\n\n### ④ **Single Page Sharing - Precision Collaboration Made Simple**\n\n\nYes, we know sharing a specific page without divulging the entirety of your workspace matters a lot to users, so we make it happen.\n\n\nHere in AFFiNE, no longer will you need to expose unrelated pages – focus on precision collaboration, sharing only what's necessary while keeping the rest securely tucked away.\n\n\n\n![Jm2FmncnepN67lM_0VnXic6k6NIcH2VGgnvB8S3lwU0=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/Jm2FmncnepN67lM_0VnXic6k6NIcH2VGgnvB8S3lwU0=)\n\n\n## 2) Sponsor us for Early Access to AFFiNE Cloud\n\n\nWe firmly believe that innovation goes beyond surface appeal, it's about redefining collaboration itself and authentically bringing value to users. Your support is crucial in making this vision a reality. Join us as a sponsor for early access to AFFiNE Cloud, not only gaining exclusive experience but actively shaping its future. Through your sponsorship, you'll be at the forefront of innovation and directly influence the product's evolution to align with your collaboration needs.\n\n\n### ① What is sponsorship?\n\n\n* Sponsorship is more than just support – it's a partnership that propels our growth. Your generous backing helps us maintain and enhance the app, while granting you exclusive benefits and early access to exciting features. Join us in making a meaningful impact on AFFiNE's future!\n\n\n* **Noted that you still have to wait around one month to get early access to Cloud after you pay.**\n\n\n### ② What benefits will sponsors REAP?\n\n\n* **Early Access to AFFiNE Cloud**: As a sponsor, you'll access AFFiNE Cloud early, gaining firsthand experience with its potent capabilities, including permission settings and control. Join our internal test, providing feedback crucial to refining the service for enhanced stability and user-friendliness.\n\n\n* **Free One-year Subscription to Personal Pro Plan**: In addition to early bird AFFiNE Cloud access, sponsors also snag a free one-year premium AFFiNE Pro Plan subscription (Note: the one-year begins when the public releases). Packed with advanced tools, it keeps you organized, productive, and creatively unleashed!\n\n\n* **Permanent discount**: Guess what, as a special gesture for our **early sponsors** like you, we're thrilled to **extend a permanent 50% discount** **for as long as you find value in the subscription and choose to continue**. Your support means the world to us!\n\n\n### ③ What does \"cloud\" mean for a local-first application?\n\n\n* Our cloud is a plugin on AFFiNE. Just like all other plugins, you have to have full control over their internet accessibility\n\n\n* Your data will still be fully local-first, accessible on your local device. The cloud is there for backups and real-time syncs.\n\n\n* Pugin system network control\" involves activating plugins using checkboxes, enabling personalized app experiences and **extending infinite core functionality**. Additionally, a settings component ensures **control over internet access for features like bookmarking while safeguarding locally stored sensitive information**.\n\n\n\n![SIye9EQeIuEwtKmb1_fmNnmkzGi5kYfFb_UhsQ0Qi9c=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/SIye9EQeIuEwtKmb1_fmNnmkzGi5kYfFb_UhsQ0Qi9c=)\n\n\n\n![0IfnNZqGDoWBjZzn5Kj9QE5gduozoVQvhamTnfB22T4=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/0IfnNZqGDoWBjZzn5Kj9QE5gduozoVQvhamTnfB22T4=)\n\n\n### ④ Does this imply the removal of the free plan?\n\n\n* Rest assured, **this sponsorship will not have any adverse effects on the availability of our free plan**. In fact, we are actively developing and expediting the release of the free plan to exceed your expectations. Just as we've promised with \"community free forever,\" **the free plan will always remain an option**, albeit with limited storage and collaboration capabilities.\n\n\n### ⑤ Is there a specific timeframe for becoming a sponsor?\n\n\n* Well, It's all about ensuring the best experience and rewards for our supportive early sponsors. This opportunity will be available in full **September**. Don't miss out on unique perks – get involved before then. Your support means a lot to us.\n\n\n### ⑥ Where can I sponsor this project?\n\n\n* You can check out the link below and visit our [community](https://community.affine.pro/c/general-discussion/), where you'll find a page with more details about this sponsorship. More questions are welcome to propose within the community at any time.\n\n\n* **Sponsor us**: [https://community.affine.pro/c/insider-general/](https://community.affine.pro/c/insider-general/)\n\n\n* Note: remember this early access **will be available at around September.**\n\n\n\n\n\nTo learn more about sponsorship opportunities and how you can support AFFiNE, feel free to get in touch with us through the following channels:\n\n\n* Official Website: [https://affine.pro/](https://affine.pro/)\n\n\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n\n\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n\n\n* Telegram: [https://t.me/affineworkos](https://t.me/affineworkos)\n\n\n* Twitter: [https://twitter.com/AffineOfficial](https://twitter.com/AffineOfficial)\n\n\n",
  "publish": true,
  "relatedBlogIds": [
  ],
  "relatedBlogs": [
  ],
  "slug": "affine-cloud-early-access",
  "tags": [
    "Content"
  ],
  "title": "Support Us: Become an Early Access Sponsor for AFFiNE Cloud",
  "updated": 1691712000000,
  "valid": true
}