{
  "title": "AFFiNE 0.8.0 preview - Launch Week - Day 4/5",
  "authors": [
    "Xuan Pang",
    "Jackie Peng",
    "Enther"
  ],
  "tags": [
    "Release Note"
  ],
  "description": "Discover the power of AFFiNE, the ultimate alternative to Notion, Miro, and Monday. This article presents the upcoming AFFiNE 0.8.0, revealing revolutionary features of Edgeless Mode that encompass flowchart,  presentation and collaboration on AFFiNE Cloud.",
  "created": 1692835200000,
  "updated": 1692835200000,
  "layout": "blog",
  "id": "GgrbjxBGO1",
  "slug": "affine-080-launch-week-day4",
  "cover": "https://insider.affine.pro/api/workspaces/H6vffRmJbCfA-r3kq_36_/blobs/njNBxGM88kQC6h8WThGDhM4wz1mKI_9N4wxhWPNDLO8=.webp",
  "md": "---\n\ntitle: \"AFFiNE 0.8.0 preview - Launch Week - Day 4/5\"\n\nauthor: Xuan Pang, Jackie Peng, Enther\n\ntags: Release Note\n\nslug: affine-080-launch-week-day4\n\ndescription: \"Discover the power of AFFiNE, the ultimate alternative to Notion, Miro, and Monday. This article presents the upcoming AFFiNE 0.8.0, revealing revolutionary features of Edgeless Mode that encompass flowchart,  presentation and collaboration on AFFiNE Cloud.\"\n\ncreated: 2023-08-24\n\nupdated: 2023-08-24\n\nlayout: blog\n\npublish: true\n\n---\n\n\n\n\n\n\n![njNBxGM88kQC6h8WThGDhM4wz1mKI_9N4wxhWPNDLO8=](https://insider.affine.pro/api/workspaces/H6vffRmJbCfA-r3kq_36_/blobs/njNBxGM88kQC6h8WThGDhM4wz1mKI_9N4wxhWPNDLO8=)\n\n\n\nWelcome to the highly anticipated launch week of AFFiNE 0.8.0! We are thrilled to present an array of groundbreaking features and a redesigned user experience that will redefine the way you work. On the fourth day of the AFFiNE 0.8.0 launch week, we will introduce you to the exciting updates of Edgeless Mode, including flowchart,  presentation and collaboration on AFFiNE Cloud. Get ready to unlock new levels of productivity and immerse yourself in a seamless and efficient workflow.\n\nJoin us as an early access sponsor for the AFFiNE Cloud, and unlock advanced collaboration capabilities while upholding the local-first nature of your data.Support Us: [https://community.affine.pro/checkout/affine-cloud-early-supporter](https://community.affine.pro/checkout/affine-cloud-early-supporter)\n\n## Create Your Customized Flowcharts with Ease - Streamline Your Workflow Effortlessly\n\n## \n\n### ① Simplified Flowcharts and Mind Maps - Lighten Your Workload\n\nGone are the days of manually shaping every element in your edgeless mode mind maps or flowcharts and linking them together. With a single click, our new feature allows shapes to automatically extend from one another, saving you time and energy and making the process more convenient.\n\n\n\n\n\n\n![q1kRb852K7CyMTlg9CXig9gOklaMKSlob1bGxmyH11k=](https://insider.affine.pro/api/workspaces/H6vffRmJbCfA-r3kq_36_/blobs/q1kRb852K7CyMTlg9CXig9gOklaMKSlob1bGxmyH11k=)\n\n\n\n### ② Tailor Your Workflow - Explore a Spectrum of Options\n\nTo elevate your flowchart experience, we offer shape customization options, including colors and styles. Click to create a new shape, and watch it harmonize seamlessly with the previous one, giving you a cohesive toolkit to play with.\n\n\n![ndYv530Fmd8nIV8PHF_XOI1aj477zMkeAS-kuPxZRG8=](https://insider.affine.pro/api/workspaces/H6vffRmJbCfA-r3kq_36_/blobs/ndYv530Fmd8nIV8PHF_XOI1aj477zMkeAS-kuPxZRG8=)\n\n## Effortless Presentation - Elevate Your Work's Visual Impact with Ease\n\n\n\n### ① Frame Your Ideas - Showcase Specific Sections with Precision\n\nHave you ever felt like making a PowerPoint was a bit of a hassle? First get all your stuff ready, then open up the software, make a slide, and mess around with the layout. It can be a real chore. But guess what? We've made things way easier. In edgeless mode, you can now just create your content and easily make frames (kind of like slides) in any area you want. No more complication. Your presentation is good to go!\n\n\n\n\n![mc-tecJzzQGQoXiHUrr2CiT3aqdnsXiUOiMDa5tzxe8=](https://insider.affine.pro/api/workspaces/H6vffRmJbCfA-r3kq_36_/blobs/mc-tecJzzQGQoXiHUrr2CiT3aqdnsXiUOiMDa5tzxe8=)\n\n### ② Unleash Your Creativity - Present Your Vision with Confidence\n\nOnce your frames are set up, just tap the presentation button to bring your ideas to life. This marks another stride towards our all-in-one goal.[\n\n\n\n\n\n\n![hlDar9sQbC_vpT_YhcnRDWldiPTaaF6ExWmYnjS1aTI=](https://insider.affine.pro/api/workspaces/H6vffRmJbCfA-r3kq_36_/blobs/hlDar9sQbC_vpT_YhcnRDWldiPTaaF6ExWmYnjS1aTI=)\n\n\n\n## AFFiNE Cloud - Seamlessly Elevate Collaborative Efforts\n\n\n\n① Edgeless Mode Remote Selection Support - Enhance CollaborationIn AFFiNE 0.8.0, we've fine-tuned the remote collaboration feature in edgeless mode, allowing you to effortlessly view your teammates' remote selections, fostering a smoother collaborative environment. For a more comprehensive look into AFFiNE Cloud, stay tuned for tomorrow's launch week blog (Day 5), where we'll dive into the specifics.\n\n\n\n\n\n\n\n\n![OIyfBAVKP_wzQ_VATaIzfhVKc858C0QnKtae0Mt0vTA=](https://insider.affine.pro/api/workspaces/H6vffRmJbCfA-r3kq_36_/blobs/OIyfBAVKP_wzQ_VATaIzfhVKc858C0QnKtae0Mt0vTA=)\n\n\n\n\n\nRelease Week:\n\nDay 1: https://affine.pro/blog/affine-080-launch-week-day1\n\nDay 2: https://affine.pro/blog/affine-080-launch-week-day2\n\nDay 3: https://affine.pro/blog/affine-080-launch-week-day3\n\nDay 4: https://affine.pro/blog/affine-080-launch-week-day4\n\nDay 5: https://affine.pro/blog/affine-080-launch-wee5-y\n\n\n\n**AFFiNE v0.8.0 Release Week Video Highlights: [https://www.youtube.com/playlist?list=PLxPzPSyKaafTenqYnRKRBOzAuopZmV2BK](https://www.youtube.com/playlist?list=PLxPzPSyKaafTenqYnRKRBOzAuopZmV2BK)**\n\n\n\n# **Get ready to unlock new levels of productivity**\n\n* Official Website: [https://affine.pro/](https://affine.pro/)\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n* Telegram: [https://t.me/affineworkos](https://t.me/affineworkos)\n## Support Us: Become an Early Access Sponsor to try out AFFiNE Cloud starting from September!\n\n\n![flDBAikMzQhG8jKLpZtfJH2pOuwCSeLvU8kuuh0bGpw=](https://insider.affine.pro/api/workspaces/H6vffRmJbCfA-r3kq_36_/blobs/flDBAikMzQhG8jKLpZtfJH2pOuwCSeLvU8kuuh0bGpw=)\n\nJoin us as an early access sponsor for the AFFiNE Cloud, and unlock advanced collaboration capabilities while upholding the local-first nature of your data. As a token of our appreciation, you'll enjoy:\n\n* **Early Access,** be among the first to experience AFFiNE Cloud's powerful features, including permission settings and control.\n* **One-year Free Pro Plan,** have a complimentary one-year premium AFFiNE Pro Plan subscription, packed with advanced tools to boost your productivity and creativity.\n* **Lifetime 50% Discount on Pro Plan**, benefit from a lasting 50% discount as long as you continue to find value in your subscription.\n* **Other details:**\n  * AFFiNE Cloud enhances collaboration without compromising your data's local-first\n  * The free plan will remain available and always an option, with ongoing improvements.\n* More details: [https://affine.pro/blog/affine-cloud-early-access](https://affine.pro/blog/affine-cloud-early-access)\n",
  "publish": true
}