{
  "title": "AFFiNE New Logo: A Symbol of Infinite Possibility and Innovation",
  "authors": [
    "Guozhu Liu",
    "Jiachen He"
  ],
  "tags": [
    "Content"
  ],
  "description": "The new logo of AFFiNE. There can be more than Notion and Miro. AFFiNE is a next-gen knowledge base that brings planning, sorting and creating all together. Privacy first, open-source, customizable and ready to use.",
  "created": 1681171200000,
  "updated": 1681171200000,
  "layout": "blog",
  "id": "5sbnILoLRZ",
  "slug": "affine-new-logo-infinite-possibility-innovation",
  "cover": "https://insider.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/0BiaxXwdOnS_iRpCSK7k5uE2ZxXjz_jYAarbI1DRFM0=.webp",
  "md": "---\n\ntitle: \"AFFiNE New Logo: A Symbol of Infinite Possibility and Innovation\"\n\nauthor: Guozhu Liu, Jiachen He\n\ntags: Content\n\nslug: affine-new-logo-infinite-possibility-innovation\n\ndescription: The new logo of AFFiNE. There can be more than Notion and Miro. AFFiNE is a next-gen knowledge base that brings planning, sorting and creating all together. Privacy first, open-source, customizable and ready to use.\n\ncreated: 2023-04-11\n\nupdated: 2023-04-11\n\nlayout: blog\n\npublish: true\n\n---\n\n\n\n\n![0BiaxXwdOnS_iRpCSK7k5uE2ZxXjz_jYAarbI1DRFM0=](https://insider.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/0BiaxXwdOnS_iRpCSK7k5uE2ZxXjz_jYAarbI1DRFM0=)\n\n> In Euclidean geometry, an affine transformation or affinity is a geometric transformation that preserves lines and parallelism, but not necessarily Euclidean distances and angles. [Wikipedia](https://en.wikipedia.org/wiki/Affine_transformation)\n\n\n\n<div style=\"text-align:center;\">\n\n<iframe style=\"border-radius: 15px;\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/VfN8TnlOuEQ\" title=\"AFFiNE - New Logo Reveal - The Next-Gen Knowledge Base - Open-Source Notion/Miro Alternative\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n\n</div>\n\n\n\nTwo years ago, when we conceived the cross-border product AFFiNE, we established a resolute and unchanging foundation from which its mission has continued to grow and evolve. In essence, our goal is to use blocks as fundamental, infrastructural elements for building various types of documents for writing, recording, planning, and even drawing. A key concept that runs throughout AFFiNE is transformation, whereby a document can be turned into a canvas or a heading can be changed into an item of a numbered list, and so on. With this unique capability, AFFiNE has the potential to play a pivotal role in every aspect of our digital lives and the business world.\n\n\n![zaFAx1uVZi_n4TTnQtMo2zC1JgPOBZnYf2BxYVInhc0=](https://insider.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/zaFAx1uVZi_n4TTnQtMo2zC1JgPOBZnYf2BxYVInhc0=)\n\nThis very conceptualization is at the heart of our logo redesign and rebranding for AFFiNE. While the previous logo conveyed a sense of **forging ahead** and **seeking steady progress**, the new logo fully embodies the core idea of AFFiNE—the mathematical concept of affine transformation.\n\n> Affine transformation is a linear mapping method that preserves points, straight lines, and planes. Sets of parallel lines remain parallel after an affine transformation. (It contains) translation, scale, shear, and rotation.  [MathWorks](https://www.mathworks.com/discovery/affine-transformation.html)\n\n\n\nIn the new logo, starting from the largest outer triangle, four consecutive triangles are generated through a series of down-scaling and rotation—essentially, a series of affine transformations—resulting in a harmonious arrangement. These triangles represent similar shapes, indicating that in an AFFiNE document, all content blocks share a universal origin. However, affine transformations provide unlimited possibilities rather than identical appearances while ensuring consistency within a common space and possessing a set of fields and properties to construct different database views. All these meanings are combined in a center-symmetrical graphic with beautiful ratios and perfect balance.\n\n\n<img src=\"https://insider.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/eXZ-jcT5_x5TMi-hchwC86PbAx_QmgGq8pXAupFyqAQ=\" width=\"444\" height=\"386.890625\" crossorigin=\"anonymous\" />\n\nThe striking curves produced by the points and vertices of these triangles are called [Pursuit Curves](http://mathtourist.blogspot.com/2020/12/pursuing-pursuit-curves.html), a fitting term that represents both the nature of the curve itself and the diligent, tireless pursuit of Toeverything Pte. Ltd., the open-source company behind AFFiNE. Our goal is to [create tools that help distill knowledge from a wide range of information without fragmenting information or increasing entropy](https://youtu.be/LFygOiGBJhU). In the new logo, we wanted to convey this continuous pursuit, so we emphasized it in the simplified version, which consists of two triangles and will be used primarily in small spaces, such as website favicons in browser tabs (16 x 16 px).\n\n\n<img src=\"https://insider.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/mmHW2QKjKVkb8PCwOB3lSxuARC1_uQonVKydiOQUUXc=\" width=\"436\" height=\"378.015625\" crossorigin=\"anonymous\" />\n\nWhile the play on words could seemingly continue endlessly, our primary goal in creating the new logo is to demonstrate that a great product will always transform itself to meet users' needs and adapt to changing times. In other words, the aim is always to shape, not merely to adapt.\n\nAs for the entire logotype, we have also dramatically changed the font shape from its original, hefty appearance to a modern, elegant, and considerate style, creating an affinity between the modest user interface design of the AFFiNE app and the creative environment it presents to users.\n\n\n![ZWjXfO8qRerYjyAnvd_jO2zb3n5bSnsyLWeppbnufEk=](https://insider.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/ZWjXfO8qRerYjyAnvd_jO2zb3n5bSnsyLWeppbnufEk=)\n\nWith the precision and accuracy of its mathematical generation process and the creativity and elegance of its visual appearance, our new logo powerfully represents the AFFiNE brand and the values we stand for. By incorporating mathematical principles into the design, we have created a visual identity that reflects our commitment to precision, innovation, and efficiency in our products. We are excited to embark on this new chapter on our journey and look forward to continuing to provide exceptional solutions and experiences for our customers. Finally, there are two more things -- please look forward to the logos of BlockSuite and OctoBase, by which AFFiNE is based and supported.\n\n\n---\n\nAFFiNE is still in alpha, but we are continuing to build to a more feature-rich and stable build. Come and join us on our journey over on our media platforms.\n\n* Official Website: [https://affine.pro/](https://affine.pro/)\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n* Telegram: [https://t.me/affineworkos](https://t.me/affineworkos)\n",
  "publish": true
}