{
  "title": "AFFiNE 0.7.0 Preview - Launch week - day 5/5",
  "authors": [
    "Xuan Pang"
  ],
  "tags": [
    "Release Note"
  ],
  "description": "Discover the power of AFFiNE, the ultimate alternative to Notion, Miro, and Monday. This article introduces the latest AFFiNE 0.7.0 Preview, unveiling an upcoming feature: AFFiNE Cloud.",
  "created": 1689206400000,
  "updated": 1689292800000,
  "layout": "blog",
  "id": "8yu3_BTi6_",
  "slug": "affine-070-launch-week-day5",
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/9yNGrVCEqX43tpQkFe6PjUK-p9ITOf4ISHNsbPZPZDw=.webp",
  "md": "---\n\ntitle: \"AFFiNE 0.7.0 Preview - Launch week - day 5/5\"\n\nauthor: Xuan Pang\n\ntags: Release Note\n\nslug: affine-070-launch-week-day5\n\ndescription: \"Discover the power of AFFiNE, the ultimate alternative to Notion, Miro, and Monday. This article introduces the latest AFFiNE 0.7.0 Preview, unveiling an upcoming feature: AFFiNE Cloud.\"\n\ncreated: 2023-07-13\n\nupdated: 2023-07-14\n\nlayout: blog\n\npublish: true\n\n---\n\n**Welcome to the highly anticipated launch week of AFFiNE 0.7.0 Preview!** We are thrilled to present an array of groundbreaking features and a redesigned user experience that will redefine the way you work. **On the last day** of the AFFiNE 0.7.0 Preview launch week, we are excited to introduce you to a new function: **AFFiNE Cloud**. With AFFiNE Cloud, you can unlock a range of powerful capabilities designed to enhance your productivity and collaboration.\n\n**Please note** that AFFiNE Cloud is currently undergoing internal testing and will be available in the near future. It's important to keep in mind that all the features mentioned in this article are prototypes and are subject to potential changes in the final version.\n\n\n![9yNGrVCEqX43tpQkFe6PjUK-p9ITOf4ISHNsbPZPZDw=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/9yNGrVCEqX43tpQkFe6PjUK-p9ITOf4ISHNsbPZPZDw=.webp)\n\n## Local-first Support with Cloud Backup\n\nWe understand the need for a consistent work experience across multiple devices. The local-first support ensures that your documents are synchronized across devices, enabling you to start working on one device and seamlessly continue on another. Say goodbye to the hassle of manually transferring files between devices.\n\n\n![9a_9HM2vfDl0edwyQ37HEXmjKSbqnXtpxHQaZ6Uhra0=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/9a_9HM2vfDl0edwyQ37HEXmjKSbqnXtpxHQaZ6Uhra0=.webp)\n\n## Real-time Collaboration\n\nWith AFFiNE Cloud, you can invite your team members to collaborate in real-time within a shared workspace. This feature tackles common challenges faced by teams, making your collaborative work smoother and more efficient. Communicate instantly, share ideas, and make decisions in real-time, fostering seamless discussions that boost productivity. Say goodbye to conflicts and delays as you work together on a single document simultaneously.\n\n\n![rf20Afslvf-ZIWK0e0p9SLFGXx5ahi9jQNLPoNilqXs=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/rf20Afslvf-ZIWK0e0p9SLFGXx5ahi9jQNLPoNilqXs=.webp)\n\n## Share Content with One Click\n\nWith AFFiNE Cloud, sharing your content will become much easier! Once you publish your work, all it takes is a single click to share it with others. Just copy and share the provided link, and your friends, colleagues, or clients can instantly access and view your content on the web. Bid farewell to those complicated sharing processes and say hello to effortless content sharing with AFFiNE Cloud!\n\n\n![Aacqw68X1tC9o8W7LwP3jUEQMlCCrZI0fEfXrHX5l1E=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/Aacqw68X1tC9o8W7LwP3jUEQMlCCrZI0fEfXrHX5l1E=.webp)\n\n## Self-host Docker\n\nAnother key feature of AFFiNE Cloud is the Self-host Docker option. This allows you to deploy AFFiNE on your own servers, giving you full control over your data and ensuring maximum security. With Self-host Docker, you can customize the deployment to meet your specific needs, creating a tailored and efficient working environment.\n\n\n![bzcwyORhOikIfR_ZRMnv7WtAxuBCAIGQFAKK34Qf8mM=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/bzcwyORhOikIfR_ZRMnv7WtAxuBCAIGQFAKK34Qf8mM=.webp)\n\nWith AFFiNE Cloud and its innovative features like Real-time collaboration, Share, and Self-host Docker, you can  collaborate, share your work and revolutionize the way you work. We are continuously working to refine and enhance the functionality of AFFiNE Cloud to deliver the best possible experience for our users. Stay tuned for updates as we approach the official release of AFFiNE Cloud.\n\nAs we conclude our launch week of AFFiNE 0.7.0 Preview, we would like to express our sincere gratitude for your attention and support. We assure you that the official release of AFFiNE Preview 0.7.0 is just around the corner, and please stay tuned. Now, let's take a moment to reflect on the **previous articles** posted during this exciting launch week:\n\n**[AFFiNE 0.7.0 Preview - Launch Week - Day 1/5](https://affine.pro/blog/affine-070-launch-week-day1)**\n\nEnhanced organization with Filter and Collections, as well as a visually revamped UI/UX.\n\n**[AFFiNE 0.7.0 Preview - Launch Week - Day 2/5](https://affine.pro/blog/affine-070-launch-week-day2)**\n\nEnhanced Docs & Text editing and the addition of PDF & PNG Export functionality.\n\n**[AFFiNE 0.7.0 Preview - Launch Week - Day 3/5](https://affine.pro/blog/affine-070-launch-week-day3)**\n\nText-to-database conversion, selection and drag functionality and the more properties/ block types\n\n**[AFFiNE 0.7.0 Preview - Launch Week - Day 4/5](https://affine.pro/blog/affine-070-launch-week-day4)**\n\nEdgeless Mode, including a redesigned toolbar, new eraser, new connector, blockslicer, integrated canvas text and copy as PNG, etc.\n\n## **Get ready to unlock new levels of productivity**\n\n* Official Website: [https://affine.pro/](https://affine.pro/)\n\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n\n* Telegram: [https://t.me/affineworkos](https://t.me/affineworkos)\n\n",
  "publish": true
}