{
  "title": "AFFiNE 0812 V0.0.1-alpha.0.4.1 Release Notes",
  "authors": [
    "Jiachen He",
    "Christopher Smolak",
    "Fangyuan Zheng",
    "Fanjing Zhang"
  ],
  "tags": [
    "Release Note"
  ],
  "description": "Thank you very much for your interest in AFFiNE! Some new and exciting changes are as follows",
  "created": 1660262400000,
  "updated": 1660262400000,
  "layout": "blog",
  "id": "246d067fba3e45238851dec8c69da17c",
  "slug": "affine-0812-v0.0.1-alpha.0.4.1-release-notes",
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/6VRed784f7jyEctOTJiQR8ir11tFfOQsV4kubVrH0bQ=.webp",
  "md": "---\n\ntitle: AFFiNE 0812 V0.0.1-alpha.0.4.1 Release Notes\n\nauthor: Jiachen He, Christopher Smolak, Fangyuan Zheng, Fanjing Zhang\n\ntags: Release Note\n\nslug: affine-0812-v0.0.1-alpha.0.4.1-release-notes\n\ndescription: Thank you very much for your interest in AFFiNE! Some new and exciting changes are as follows\n\ncreated: 2022-08-12\n\nupdated: 2022-08-12\n\nlayout: blog\n\npublish: true\n\n---\n\n\n![6VRed784f7jyEctOTJiQR8ir11tFfOQsV4kubVrH0bQ=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/6VRed784f7jyEctOTJiQR8ir11tFfOQsV4kubVrH0bQ=)\n\n**Thank you very much for your interest in AFFiNE! Some new and exciting changes are as follows:**\n\n### **Bug Fixes**\n\nIn our continued effort to make AFFiNE the most reliable all-in-one knowledge base, fixing bugs is always our main concern. Here's our work over the last few days:\n\n* Fixed: Text was obscured by inline menu in paper mode;\n* Fixed: Props format with errors and were showing in the console;\n* Fixed: When the user presses the shift key to draw consecutive straight lines, the starting point of the second line now coincides with the ending point of the first line;\n* Fixed: Tag-app caused page crashes during use;\n* Fixed: The page view did not accurately recognize the mouse selection;\n* Fixed: After switching pages, the behavior of selection feature did not meet expectations;\n* Fixed: AFFiNE was prompting a window during the installation process indicating that the installation has failed;\n* Fixed: Alignment of page styles with design drawings;\n* Fixed: In paper mode, no background colors could be added to the text;\n* Fixed: The GitBook URL now uses AFFiNE's domain name;\n* Fixed: The GitHub ReadMe badge has been updated;\n* Fixed: Low priority console warnings where React does not recognize isDisabled.\nAFFiNE is currently in the early alpha stage with limited access, and public early access will be available in the autumn of 2022.\n\nAFFiNE is an open-source project which can be viewed on Github:[https://github.com/toeverything/AFFiNE#readme](https://github.com/toeverything/AFFiNE#readme)\n\nThe official website for AFFiNE is [https://affine.pro/](https://affine.pro/)\n\nIf you endorse this open source project, please help us by clicking the GitHub star, which is crucial for the future development of AFFiNE.\n\nAFFiNE is very grateful to all open source contributors and will work to build a more positive open source ecosystem.\n\nHope you have a nice time with AFFiNE!\n\n",
  "publish": true
}