{
  "title": "AFFiNE Alpha is coming! The first version is for the Markdown Editor!",
  "authors": [
    "Fangyuan Zheng",
    "Christopher Smolak"
  ],
  "tags": [
    "Release Note"
  ],
  "description": "AFFiNE Alpha is coming! The first version is for the Markdown Editor!",
  "created": 1666656000000,
  "updated": 1666656000000,
  "layout": "blog",
  "id": "4116a572f3ef4bb19629692ce64193a5",
  "slug": "affine-alpha-is-coming",
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/GLQ6NjwMUt0tuHdAaENRaSg4Vr88UKBimS3wYBICI20=.webp",
  "md": "---\n\ntitle: AFFiNE Alpha is coming! The first version is for the Markdown Editor!\n\nauthor:  Fangyuan Zheng, Christopher Smolak\n\ntags: Release Note\n\nslug: affine-alpha-is-coming\n\ndescription: AFFiNE Alpha is coming! The first version is for the Markdown Editor!\n\ncreated: 2022-10-25\n\nupdated: 2022-10-25\n\nlayout: blog\n\npublish: true\n\n---\n\n\n![GLQ6NjwMUt0tuHdAaENRaSg4Vr88UKBimS3wYBICI20=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/GLQ6NjwMUt0tuHdAaENRaSg4Vr88UKBimS3wYBICI20=)\n\n[AFFiNE Alpha](https://pathfinder.affine.pro/) will be launched soon! Thank you very much for your continued interest and trust in the AFFiNE team.Since the launch of AFFiNE pre-Alpha, we have received many private messages and emails from our users, and they have given us lots of feedback. We realised that there were still many problems with AFFiNE pre-Alpha, whether that was user experience, page stability, or something else. After considering many aspects, we decided to refactor AFFiNE - start again from the ground up and we are now excited to announce AFFiNE Alpha.\n\n**Key words**：Markdown, Shortcuts, Dark Mode, Export, Page redesign, Export.\n\n## The Goal of [AFFiNE Alpha](https://pathfinder.affine.pro/)\n\n  In order to be able to carry more complex functions in future development while **maintaining the stability of AFFiNE**, our development team decided to refactor the project and **standardise the code structure**. The new version of AFFiNE Alpha will provide a more stable experience for users and a more organised structure for developers.\n\n  Secondly, the refactoring also saw a lot of changes to the design of pages. To a certain extent, a good UI design solution makes the user experience more fluid. In previous versions, users have been confused by the design of the pages. Our product and design teams have held many meetings and long conversations about these issues and have come up with a more user-focussed design for AFFiNE Alpha. The aim is to give users **a better visual effect and operating experience**.\n\n\n![t-DClOwKx4mCCPGfbD7zSRscB9wE5U1t0nu6npRgPWk=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/t-DClOwKx4mCCPGfbD7zSRscB9wE5U1t0nu6npRgPWk=)\n\n## 1. What are the advantages of [AFFiNE Alpha](https://pathfinder.affine.pro/)?\n\n  This rebuilt AFFiNE will provide users with **a smoother editing experience and a more stable system environment**. We will ensure a more focused creative environment for our users. **Markdown was also a key focus of this refactoring**. We have improved the Markdown system and overcome some previous typographical issues. For the Markdown syntax system, we also consider how 'deletion' and 'secondary editing' can be implemented, while ensuring that the style is aesthetically pleasing.\n\n  By collating user feedback, we have also learnt that there is **a strong demand for dark mode**. This is why AFFiNE Alpha has been built with a dark mode as a core feature, which can be developed with new features to offer a much smoother light mode/dark mode transition and editing experience. In addition, export is another new key features of this AFFiNE Alpha release. The functionality of previous versions were limited and made it hard to truly export data for other means, as .affine files were onlyy really readable by AFFiNE. This imposes many limitations on users. So as we go live, improved **export support was one of our focuses** and now you can export your data into various file types in this alpha release. We will also introduce you to each of these advantages in turn in the following sections.\n\n## 2. Key Feature Points\n\n### 2.1 Basic editing experience enhancement\n\n  To address the shortcomings of AFFiNE pre-Alpha, Alpha features the following optimisations to enhance the basic editing experience for users:\n\n* **Shortcut system**\n  While we had previously provided various shortcut keys, there were issues with styling and even failure of certain operations. Now we ensure that the style is aesthetically pleasing and the shortcuts are smooth to use. Below we'll share with you some of the most popular operations and their keyboard shortcuts:\n\n  \n![On8CtapmM1VTnBvMo94zph1E98LKL4yRYg3SpRHAoI4=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/On8CtapmM1VTnBvMo94zph1E98LKL4yRYg3SpRHAoI4=)\n\n  \n\n* **Select all**\n  We would like to specifically introduce you to the shortcut `Ctrl + A (Win/Linux) / CMD + A (Mac)`. Users have previously commented that when using the Select All function, sometimes a paragraph was selected and sometimes the full text was selected. It was not clear what the intended effect was and how the select all feature should operate. **In this release, the select all feature directly selects the full text**.\n\n### 2.2 AFFiNE Editor for Markdown\n\n  Markdown presents a fast, efficient and standardized way to edit and format text. You can evoke your required text style directly through a specific identifier, without the need to select function keys with the mouse. This way of editing can greatly increase the speed of the user's work and allows them to focus on the content.\n\n  Markdown is actually quite simple to use, and in layman's terms, you can also think of Markdown syntax as a shortcut. The following list shows the Markdown syntax supported by AFFiNE Alpha.\n\n\n![YhVEQoYNMYuBzz4VhUcaBzYwMna0wtzafqQgBlNjraI=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/YhVEQoYNMYuBzz4VhUcaBzYwMna0wtzafqQgBlNjraI=)\n\n**Note: Markdown syntax only supports inline code style in this version, block code style will be available in a future update.**\n\n### 2.3 Dark Mode\n\n  The introduction of a dark mode is another big difference in AFFiNE Alpha. During our communication with users, we found that many of them requested dark mode support. We've implemented this feature for Paper Mode but have **not fully implemented features for Edgeless mode**. This is because there are more details to consider when switching from Page Mode to Edgeless Mode. In order to give users a better experience, we will go live after we have finalised these details.\n\n### 2.4 Export\n\n  In our previous release import/export features were limited to .affine files and in user feedback many users have commented that the import/export features need to be more flexible. As we continue to consider what formats to natively support, the current release boasts **export support for both HTML and Markdown file types in this version**. With greater support coming in future updates.\n\n## Other Things Worth Mentioning\n\n* Added 'Help and Feedback' section in the bottom right corner;\n* AFFiNE logo activates a contact modal which gives links and details to official AFFiNE links and communities.\n* New \"page option\" feature (located in the top right corner) which currently homes the following features:\n  * Conversion between Paper/Edgeless modes;\n  * Export feature.\n* Conversions between Page and Edgeless\n  * Paper Mode to Edgeless Mode - everything in Paper Mode will be mapped to Text in Edgeless;\n  * Edgeless Mode to Paper Mode -  content will be arranged in chronological order of creation and a divider added between Blocks.\n* Single page editing - currently editing multiple docs/pages is not supported.\n## Thanks again to everyone\n\nOnce again, a big thanks to our users and ambassadors. Please do come and join our groups, whether you have feedback, would like to start a discussion, or even just to listen and see what we are doing.\n\n**Please feel free to contact us if you encounter any bugs or have some new feature ideas**. Thank you sincerely for your support!\n\n* Feedback: [https://github.com/toeverything/AFFiNE/issues/new/choose](https://github.com/toeverything/AFFiNE/issues/new/choose)\n* AFFiNE Alpha: [https://pathfinder.affine.pro/](https://pathfinder.affine.pro/)\n",
  "publish": true
}