{
  "author": "Jiachen He, Fangyuan Zheng, Shiwen Shen",
  "authors": [
    "Jiachen He",
    "Fangyuan Zheng",
    "Shiwen Shen"
  ],
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/x_3tfRYpFzZ3ra7-cHyZEAjLBvvuTN8Kk3wCbYHpDNU=",
  "coverAlt": "",
  "createDate": 1680147991871,
  "created": 1660867200000,
  "description": "Since the release of our live demo, we’ve received lots of suggestions and there are lots of ideas of improvements we can make",
  "guid": "2c944409-fbba-4b2b-91b6-01826c3f660b",
  "id": "0de8c90a1b3c4ab19c1b6f7cd12b47e7",
  "layout": "blog",
  "linkedPageIds": [
  ],
  "md": "\n\n\n\n\n\nSince the release of our live demo, we’ve received lots of suggestions and there are lots of ideas of improvements we can make. We are happy today to share with you our development roadmap, which shows the next several months of planned features and releases. Going forward, this roadmap will show what the various components of the project we intend to work on and when that work aims to launch.\n\n\n\n\n\nSomethings to bear in mind is that the roadmap focuses on new features and enhancements in the project, it does not focus on bugs. Also, these dates and milestones reflect our best intentions, sometimes things happen – like bugs – they get in the way of features going live and we need to squish them before a new feature can be released. We will keep you updated with our development and let you know if there are any changes – including earlier or later releases of features.\n\n\n\n\n\nWe are super happy to be sharing this with you and see is as an important step to full transparency and encouraging and growing the community involvement. We look forward to any feedback or further suggestions you may have.\n\n\n\n\n\n\n![x_3tfRYpFzZ3ra7-cHyZEAjLBvvuTN8Kk3wCbYHpDNU=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/x_3tfRYpFzZ3ra7-cHyZEAjLBvvuTN8Kk3wCbYHpDNU=)\n\n\n\n\n\n",
  "publish": true,
  "relatedBlogIds": [
  ],
  "relatedBlogs": [
  ],
  "slug": "affine-feature-roadmap-2022.08-2022.09",
  "tags": [
    "User Guide"
  ],
  "title": "AFFiNE Feature Roadmap 2022.08-2022.09",
  "updated": 1660867200000,
  "valid": true
}