{
  "title": "AFFiNE 0823 V0.0.1-alpha.0.5.0 Release Notes",
  "authors": [
    "Jiachen He",
    "Xinglong Wang",
    "Fangyuan Zheng",
    "Fanjing Zhang"
  ],
  "tags": [
    "Release Note"
  ],
  "description": "Thank you very much for your interest in AFFiNE! Some new and exciting changes are as follows",
  "created": 1661212800000,
  "updated": 1661212800000,
  "layout": "blog",
  "id": "a1b3873d861b4b7aa49178626318341b",
  "slug": "affine-0823-v0.0.1-alpha.0.5.0-release-notes",
  "cover": "https://insider.affine.pro/api/workspaces/H6vffRmJbCfA-r3kq_36_/blobs/JspchPzbMyAw5RLMQCH5uLCCNB4O_zaOzzY6MW2t_ls=.webp",
  "md": "---\n\ntitle: AFFiNE 0823 V0.0.1-alpha.0.5.0 Release Notes\n\nauthor: Jiachen He, Xinglong Wang, Fangyuan Zheng, Fanjing Zhang\n\ntags: Release Note\n\nslug: affine-0823-v0.0.1-alpha.0.5.0-release-notes\n\ndescription: Thank you very much for your interest in AFFiNE! Some new and exciting changes are as follows\n\ncreated: 2022-08-23\n\nupdated: 2022-08-23\n\nlayout: blog\n\npublish: true\n\n---\n\n\n![JspchPzbMyAw5RLMQCH5uLCCNB4O_zaOzzY6MW2t_ls=](https://insider.affine.pro/api/workspaces/H6vffRmJbCfA-r3kq_36_/blobs/JspchPzbMyAw5RLMQCH5uLCCNB4O_zaOzzY6MW2t_ls=)\n\nThank you very much for your interest in AFFiNE! Some new and exciting changes are as follows:\n\n### Features\n\n* Feature: Live demo([https://livedemo.affine.pro/demo](https://livedemo.affine.pro/demo/affineNmS7TJ5dvE4ngEhS)) up and running;\n* Feature: You can now click inside a block to edit directly in Edgeless Mode;\n\n![1I7UaHQRwwzSOpcOldmPDhNONTh-gX71exsTe3y2V6c=](https://insider.affine.pro/api/workspaces/H6vffRmJbCfA-r3kq_36_/blobs/1I7UaHQRwwzSOpcOldmPDhNONTh-gX71exsTe3y2V6c=)\n\n* Feature: Added layout function in Edgeless Mode;\n\n![PPj7skjz-FITYOeAUlVlJ2O2uzK1uNjyOxYVR-abeYs=](https://insider.affine.pro/api/workspaces/H6vffRmJbCfA-r3kq_36_/blobs/PPj7skjz-FITYOeAUlVlJ2O2uzK1uNjyOxYVR-abeYs=)\n\n* Feature: Added a menu option to insert a new block below.\n### **Bug Fixes**\n\nIn AFFiNE team and users continued effort to make AFFiNE the most reliable all-in-one knowledge base, fixing bugs is always our main concern. Here's our work over the last few days:\n\n* Fixed: In Edgeless Mode, selecting multiple blocks for group operation led to the website crashing;\n* Fixed: In Edgeless Mode, zoom scroll jumps too fast from 10%-70%-250%;\n* **Fixed: The mouse now will auto-focus when creating a new text input box in edgeless mode;**\n* Fixed: The lock function didn't work if shapes were in block-groups;\n* Fixed: '/' doesn't work after creating some new groups;\n* Fixed: The command menu positioning that appeared did not meet expectations;\n* Fixed: In Paper Mode, no background color could be added to the text;\n* **Fixed: Pasting a link creates a new line - instead of inserting inline;**\n* Fixed: A dividing line displays when dragging the block with the mouse, but this line remained after the operation is finished in paper mode;\n* Fixed: Added arm64 Support to the Docker Images.\n### Improvement\n\nIn AFFiNE team and users continued effort to make Affine the most reliable all-in-one knowledge base, optimizing user experience is always our main concern. Here's our work in the last few days:\n\n* Improvement: Edgeless Mode toolbar tooltip changes;\n* Improvement: When clicking on a link, it will now open in a new tab;\n* Improvement: Button colors of transform changes;\n* Improvement: Sidebar changes in Paper Mode;\n* Improvement: The icon of the top toolbar is updated in Paper Mode;\n* Improvement: The page tree item will change the background when the mouse enters;\n* Improvement: The space between list items has been decreased;\n* **Improvement: Made it easier to create grids, such as nested grids;**\n* Improvement: List adds a shadow box in the Paper Mode sidebar;\n* Improvement: Use of drag hand style when dragging in Edgeless Mode;\n* Improvement: When selecting multiple blocks with the mouse, we’ve added a style to separate the blocks;\n* Improvement: A prompt is now given when the page link is copied.\nAFFiNE is currently in the early alpha stage with limited access, and public early access will be available in the autumn of 2022.\n\nAFFiNE is an open-source project which can be viewed on Github:[https://github.com/toeverything/AFFiNE#readme](https://github.com/toeverything/AFFiNE#readme)\n\nThe official website for AFFiNE ishttps://affine.pro/\n\nIf you endorse this open source project, please help us by clicking the GitHub star, which is crucial for the future development of AFFiNE.\n\nAFFiNE is very grateful to all open source contributors and will work to build a more positive open source ecosystem.\n\nHope you have a nice time with AFFiNE!\n\n",
  "publish": true
}