{
  "title": "AFFiNE 0.11.0 - Launch week - Day 5/5: From Concept to Click: Onboard AFFiNE the way how we image, design, and eventually build it.",
  "authors": [
    "Yuhang Zhao",
    "Yixuan Guo"
  ],
  "tags": [
    "Release Note"
  ],
  "description": "Explore the intricacies of AFFiNE 0.11.0's onboarding masterpiece on the final day of our launch week. From setting design goals to innovative highlights, delve into the meticulous planning and dedication that shaped our design philosophy. Join us on this visual journey!",
  "created": 1703203200000,
  "updated": 1703203200000,
  "layout": "blog",
  "id": "vNgp7DylSNajeJrnK-MC1",
  "slug": "affine-0.11.0-Launch-Week-Day-5-From-Concept-to-Click-Onboarding-Process",
  "cover": "https://insider.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/uOBlVaobHGKPF6BhLlTyV59HmXNGljzP5N4hik7-1RE=.webp",
  "md": "---\n\ntitle: \"AFFiNE 0.11.0 - Launch week - Day 5/5: From Concept to Click: Onboard AFFiNE the way how we image, design, and eventually build it.\"\n\nauthor: \"Yuhang Zhao, Yixuan Guo\"\n\ntags: Release Note\n\nslug: affine-0.11.0-Launch-Week-Day-5-From-Concept-to-Click-Onboarding-Process\n\ndescription: \"Explore the intricacies of AFFiNE 0.11.0's onboarding masterpiece on the final day of our launch week. From setting design goals to innovative highlights, delve into the meticulous planning and dedication that shaped our design philosophy. Join us on this visual journey!\"\n\ncreated: 2023-12-22\n\nupdated: 2023-12-22\n\nlayout: blog\n\npublish: true\n\n---\n\n\n![uOBlVaobHGKPF6BhLlTyV59HmXNGljzP5N4hik7-1RE=](https://insider.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/uOBlVaobHGKPF6BhLlTyV59HmXNGljzP5N4hik7-1RE=)\n\nWelcome to the Day 5 of AFFiNE 0.11.0 Launch Week! On this final day, we are thrilled to present the meticulously crafted **onboarding design** that embodies our special dedication. From the establishment of **design goals** through the entire process of **planning and finalization**, highlighting **innovative aspects**, and discussing topic choices, to the **ultimate results** in the form of a video – we aim to share with you every facet of our design philosophy!\n\n# Start with Design Philosophy: Unveiling the Essence of Our Approach\n\n## **The Crucial Role of Onboarding in Your Engagement Journey**\n\nIn the dynamic realm you're part of, we understand the paramount importance of a seamless onboarding experience. With the evolution of technology and rising expectations, **initial interactions wield profound influence, shaping perceptions and long-term engagement**. This meticulously crafted onboarding process serves as a gateway, not only **unveiling features** but **laying the foundation for an active and engaging journey**. It doesn't just reveal functionalities; **it ignites a path towards proactive involvement**.\n\n\n![QaKztUFE-5p5AC-8Kr9PyEeupU1eKQEt-CuUVmfwXNk=](https://insider.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/QaKztUFE-5p5AC-8Kr9PyEeupU1eKQEt-CuUVmfwXNk=)\n\n## **Design Objectives**\n\n### \"We become what we behold. We shape our tools and then our tools shape us.\"\n\nWe got so tired of the traditional SaaS who always wanted to extract as much information as they can as if humans could be all easily classified into a few occupations. We want our tool to **be humanized** and we want you to have **a direct feeling about it** when you open it for the first time. So instead of asking you endless questions about who you are, we choose to **give you five articles we love the most from a variety of areas**, hoping to **become closer to you** by letting you choose what knowledge you'd love to start with AFFiNE. Hope you can enjoy them as much as we did.\n\n### Philosophy Reinvented - The Essence of \"Aha Moment\"\n\nIn AFFiNE, we strive to make you experience that **the integration of whiteboard and documents goes beyond a simple overlay of functions.** It signifies the emergence of a **new collaboration and inspiration paradigm**, offering key advantages.\n\nFirstly, seamless integration allows you to **handle documents and whiteboard within a single interface**, enhancing efficiency.\n\nSecondly, the fusion of **a freeform whiteboard with structured documents** sparks **creative thinking**, fostering your creativity.\n\nThirdly, it promotes **enhanced team collaboration through collective editing.**\n\n Lastly, **visualizing complex information on the whiteboard** improves understanding and communication skills.\n\n### Local-First Approach: Transforming Data Processing for Enhanced Security and Efficiency\n\nAFFiNE underscores the value of **a local-first approach**, prioritizing **offline capabilities**, seamless **cross-device experiences**, and **data security, privacy,** and **long-term preservation.** This strategy addresses traditional SaaS challenges, offering **a more secure, private, sustainable, and user-controlled data processing solution.** AFFiNE's product differentiation not only provides a unique market position but also ensures users experience minimal disruptions, fostering increased work efficiency and greater control over their data throughout usage.\n\n### Postponed Questionnaire: We Want to Know More About You\n\nWe value **your thoughts and habits**, so when you start using AFFiNE, this questionnaire will guide you in sharing information about your work habits, technology preferences, and desired features. Designed for simplicity, this survey ensures a quick completion while **gathering valuable insights into your needs**. Your input not only tailors personalized recommendations but also guides AFFiNE in **meeting your expectations with precision in future updates.**\n\n# A Visual Symphony - Crafting an Intuitive Design\n\n## **Navigating the Planning Stage and Draft Showcase**\n\nIn the initial design, your AFFiNE journey unfolds as follows: You start by accessing the startup page and then proceed to explore the introduction to AFFiNE. Following this, you enter the questionnaire section, sharing information about your work habits, technology preferences, and desired features. After completing the questionnaire, you encounter a showcase of AFFiNE's features, including captivating animated presentations. The Bento version page is then presented, offering you additional options. Finally, you enter the app, commencing your AFFiNE experience.\n\n\n![QtCfWljCBMPt8rEQonC0kI2_fH58RKXuXQ-NhyBn02A=](https://insider.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/QtCfWljCBMPt8rEQonC0kI2_fH58RKXuXQ-NhyBn02A=)\n\n#### **The Finalized Process**\n\nAfter discussions and brainstorming sessions with more team members and the Product Owner, we have redefined the onboarding design process:\n\n\n![Nvi71FgYn1USq-8e9UbkJ2G6P5nKKXAsOpBQHJhr2mQ=](https://insider.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/Nvi71FgYn1USq-8e9UbkJ2G6P5nKKXAsOpBQHJhr2mQ=)\n\nThe journey begins with an entrance phase featuring a captivating animation. Next, you can choose articles of interest and proceed to convert them into whiteboard documents. On the confirmation page, you can review and confirm your selections. Finally, you will be invited to enter the app, initiating your AFFiNE experience.\n\n\n![bN5VCUHO55Ndf11DMch_PpknqGQ6ickeTm9MX7DonRI=](https://insider.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/bN5VCUHO55Ndf11DMch_PpknqGQ6ickeTm9MX7DonRI=)\n\n#### **A Visually Stunning Entrance: Innovating Animation and Transitions**\n\n\n<video muted autoplay loop preload=\"auto\" crossorigin=\"anonymous\" playsinline>\n            <source src=\"https://insider.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/TP7y8AopxI4KYItIl1HF2vsVWIe8V5Uim0ckXwFChvw=\" type=\"video/mp4\" />\n          </video>\n\nIn our pursuit of innovation, we aimed to create a full-screen entrance effect, leading us to conduct extensive technical research and even develop a standalone project to fine-tune animation details. This project will be open-sourced in the future.In the design process, difficulties and challenges are inevitable. We overcame many issues:\n\n1. We successfully developed a fully transparent window based on the Electron framework, overcoming complexities in multi-display switches to mimic real windows.\n1. For simulating paper bending, we chose \"pure CSS for 3D transformation\" over WebGL, striking a balance between visual quality and development efficiency.\n1. Our focus on smooth and reversible transitions led us to effectively manage multiple animation stages, from paper flying into transitioning to the startup page.\n1. In transitioning between pages and edgeless mode, we selected a simulated approach over using the actual blocksuite renderer. This involved extra work on canvas scaling and dragging, but resulted in smoother animations.In summary, our commitment to innovation guided us through various challenges, from creating transparent windows to achieving seamless animations, culminating in a distinctive and visually appealing user experience.\n# UIUX Improvement and Creative point\n\nRecognizing scenarios where there might be numerous window elements, we have refined the shadows for a more polished appearance.\n\n",
  "publish": true
}