{
  "title": "AFFiNE 0810 V0.0.1-alpha.0.4.0 Release Notes",
  "authors": [
    "Jiachen He",
    "Christopher Smolak",
    "Xiwen Tu",
    "Fanjing Zhang"
  ],
  "tags": [
    "Release Note"
  ],
  "description": "Thank you very much for your interest in AFFiNE! Some exciting changes are as follows",
  "created": 1660089600000,
  "updated": 1660089600000,
  "layout": "blog",
  "id": "fcd73624e7f74857ad977400161b033d",
  "slug": "affine-0810-v0.0.1-alpha.0.4.0-release-notes",
  "cover": "https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/JspchPzbMyAw5RLMQCH5uLCCNB4O_zaOzzY6MW2t_ls=.webp",
  "md": "---\n\ntitle: AFFiNE 0810 V0.0.1-alpha.0.4.0 Release Notes\n\nauthor: Jiachen He, Christopher Smolak, Xiwen Tu, Fanjing Zhang\n\ntags: Release Note\n\nslug: affine-0810-v0.0.1-alpha.0.4.0-release-notes\n\ndescription: Thank you very much for your interest in AFFiNE! Some exciting changes are as follows\n\ncreated: 2022-08-10\n\nupdated: 2022-08-10\n\nlayout: blog\n\npublish: true\n\n---\n\n\n![JspchPzbMyAw5RLMQCH5uLCCNB4O_zaOzzY6MW2t_ls=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/JspchPzbMyAw5RLMQCH5uLCCNB4O_zaOzzY6MW2t_ls=)\n\n**Thank you very much for your interest in AFFiNE! Some exciting changes are as follows:**\n\n### **New Features**\n\n* Instructions for online use;\n\n![BwKdBDcBzdP42e9CZ8KnwKsuIYoI7IPZw2bjP58WDOw=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/BwKdBDcBzdP42e9CZ8KnwKsuIYoI7IPZw2bjP58WDOw=)\n\n* The kanban view now supports grouping by status.\n### **Bug Fixes**\n\nIn our continued effort to make AFFiNE the most reliable all in one knowledge base, fixing bugs is always our main concern. Here's our work over the last few days:\n\n* Fixed: In doc mode, the text content is obscured by the menu floating box;\n* Fixed: The size of the left menu trigger button is wrong in page mode;\n* Fixed: In doc mode, when clicking the 'add tag' icon after selecting multiple blocks with the mouse, the page will be stuck;\n* Fixed: When opening multiple file menu within sidebar in doc mode, the menu boxes will block each other;\n* Fixed: There is a bug in the rename workspace name function in doc mode;\n* Fixed: When the user presses the shift key to draw consecutive straight lines, the second line's starting point coincides with the first line's ending point;\n* Fixed: The block delete button (located in the left menu) does not work in the grid scene of page mode.\nAFFiNE is currently in the early alpha stage with limited access, and public early access will be available in the autumn of 2022.\n\nAFFiNE is an open-source project which can be viewed on Github: [https://github.com/toeverything/AFFiNE#readme](https://github.com/toeverything/AFFiNE#readme)\n\nIf you endorse this open source project, please help us by clicking the GitHub star, which is crucial for the future development of AFFiNE.\n\nAFFiNE is very grateful to all open source contributors and will work to build a more positive open source ecosystem.\n\nHope you have a nice time with AFFiNE!\n\n",
  "publish": true
}