{
  "author": "Jiachen He, Fangyuan Zheng, Fanjing Zhang",
  "authors": [
    "Jiachen He",
    "Fangyuan Zheng",
    "Fanjing Zhang"
  ],
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/JspchPzbMyAw5RLMQCH5uLCCNB4O_zaOzzY6MW2t_ls=",
  "coverAlt": "",
  "createDate": 1680147991871,
  "created": 1658880000000,
  "description": "Thank you very much for your attention to AFFiNE! Some exciting changes in AFFiNE are as follows",
  "guid": "e569084a-46b8-4b13-b785-ee3e8eb7ef12",
  "id": "96e53e11215d4298ae35e3855f1c7474",
  "layout": "blog",
  "linkedPageIds": [
  ],
  "md": "**Thank you very much for your attention to AFFiNE! Some exciting changes in AFFiNE are as follows:**\n\n\n### **Bug Fixes**\n\n\nIn our continued effort to make AFFiNE the most reliable all in one knowledge base 展开, fixing bugs is always our main concern. Here's our work in the last few days:\n\n\n* Fixed: Doc view and board view toggle button update;\n\n\n* Fixed: Block group's to-do list borders disappear;\n\n\n* Fixed: In Doc view, copy-paste of the block group is invalid;\n\n\n* Fixed: Ordered and unordered icon of inline menu UI errors;\n\n\n* Fixed: Shortcut recall function bar is invalid;\n\n\n* Fixed: The inline menu's hover menu disappears after the click event;\n\n\n* Fixed: Under the board mode, adding a shadow or border to the frame;\n\n\n* Fixed: Card height error when adding multiple Kanban cards to a Kanban view;\n\n\n* Fixed: Selecting a Kanban card in Kanban view and pressing the Enter key sometimes causes it to go out of focus;\n\n\n* Fixed: After pasting content in the editor, the Enter key evokes the incorrect function;\n\n\n* Fixed: When creating a new page, pressing the arrow keys after entering the title will report an error;\n\n\n* Fixed: Blocks can not be selected when the scroll bar appears on the page;\n\n\n* Fixed: After copying the link, opening the link in another browser will report an error;\n\n\n* Fixed: After modifying the content of a Kanban card in the Kanban view, the card will appear to move up and down with the mouse;\n\n\n* Fixed: Copy the full text to a new page, and two edit boxes will appear;\n\n\n* Fixed: Switching pages or clicking on the edit area will report a JS Error;\n\n\n* Fixed: Copy and paste any component while editing will be stuck;\n\n\n* Fixed: The position of tags overflows the card border in Kanban view;\n\n\n* Fixed: Under Kanban view, deleting tags will report an error.\n\n\nAFFiNE is currently in the early alpha stage with limited access, and public early access will be available in the autumn of 2022.\n\n\nAFFiNE is an open-source project which can be viewed on Github: [https://github.com/toeverything/AFFiNE#readme](https://github.com/toeverything/AFFiNE#readme)\n\n\nIf you endorse this open source project, please help us by clicking the GitHub star, which is crucial for the future development of AFFiNE.\n\n\nAFFiNE is very grateful to all open source contributors and will work to build a more positive open source ecosystem.\n\n\nHope you have a nice time with AFFiNE!\n\n\n",
  "publish": true,
  "relatedBlogIds": [
  ],
  "relatedBlogs": [
  ],
  "slug": "affine-0727-v0.0.1-alpha.0.3.1-release-notes",
  "tags": [
    "Release Note"
  ],
  "title": "AFFiNE 0727 V0.0.1-alpha.0.3.1 Release Notes",
  "trash": false,
  "updated": 1658880000000,
  "valid": true
}