{
  "title": "AFFiNE 0729 V0.0.1-alpha.0.3.2 Release Notes",
  "authors": [
    "Jiachen He",
    "Fangyuan Zheng",
    "Fanjing Zhang"
  ],
  "tags": [
    "Release Note"
  ],
  "description": "Thank you very much for your attention to AFFiNE! Some exciting changes in AFFiNE are as follows",
  "created": 1659052800000,
  "updated": 1659052800000,
  "layout": "blog",
  "id": "2cc5b2d5e7db4dcc99526125eeb5d67c",
  "slug": "affine-0729-v0.0.1-alpha.0.3.2-release-notes",
  "cover": "https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/oaG84jFRwPu2fG2dLRqt9D7zOi5o-kZWLBXLA_lZHuI=.webp",
  "md": "---\n\ntitle: AFFiNE 0729 V0.0.1-alpha.0.3.2 Release Notes\n\nauthor: Jiachen He, Fangyuan Zheng, Fanjing Zhang\n\ntags: Release Note\n\nslug: affine-0729-v0.0.1-alpha.0.3.2-release-notes\n\ndescription: Thank you very much for your attention to AFFiNE! Some exciting changes in AFFiNE are as follows\n\ncreated: 2022-07-29\n\nupdated: 2022-07-29\n\nlayout: blog\n\npublish: true\n\n---\n\n\n![oaG84jFRwPu2fG2dLRqt9D7zOi5o-kZWLBXLA_lZHuI=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/oaG84jFRwPu2fG2dLRqt9D7zOi5o-kZWLBXLA_lZHuI=)\n\n**Thank you very much for your attention to AFFiNE! Some exciting changes in AFFiNE are as follows:**\n\n### **Bug Fixes**\n\nIn our continued effort to make AFFiNE the most reliable all in one knowledge base 展开, fixing bugs is always our main concern. Here's our work in the last few days:\n\n* Fixed: The position of the selection created by the left mouse button in page mode is fixed when the page is scrolled;\n* Fixed: The pop-up box of the tag system in kanban view will be obscured by the card;\n* Fixed: The top toolbar right setting center icon shows the wrong style when open;\n* Fixed: When selecting a color from the left toolbar \"pencil\" in board mode, the bubble style is wrong when the mouse hovers;\n* Fixed: When deleting a selected block group, the shapes within the group cannot be deleted;\n* Fixed: Dragging the block left, and right will bring up two delete buttons in board mode;\n* Fixed: The color card of the tag system needs to be aligned with the design;\n* Fixed: The tags that have been added to the article can be modified by popping up an edit box when the mouse is clicked;\n* Fixed: Wrong position of the line under the text when the mouse hovers to wake up the tag system;\n* Fixed: The default value of \"Field Title\" of the tag-added card is set;\n* Fixed: Top toolbar and left function list layout optimization.\nAFFiNE is currently in the early alpha stage with limited access, and public early access will be available in the autumn of 2022.\n\nAFFiNE is an open-source project which can be viewed on Github: [https://github.com/toeverything/AFFiNE#readme](https://github.com/toeverything/AFFiNE#readme)\n\nIf you endorse this open source project, please help us by clicking the GitHub star, which is crucial for the future development of AFFiNE.\n\nAFFiNE is very grateful to all open source contributors and will work to build a more positive open source ecosystem.\n\nHope you have a nice time with AFFiNE!\n\n",
  "publish": true,
  "order": 70
}