{
  "author": "AFFiNE",
  "authors": [
    "AFFiNE"
  ],
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/w7XZA6Ba7oiG37vTfowLwhtiOOUFW1ACKzmE7nrrDFM=",
  "coverAlt": "",
  "createDate": 1703237025433,
  "created": 1703203200000,
  "description": "Explore the intricacies of AFFiNE 0.11.0's onboarding masterpiece on the final day of our launch week. From setting design goals to innovative highlights, delve into the meticulous planning and dedication that shaped our design philosophy. Join us on this visual journey!",
  "guid": "vNgp7DylSNajeJrnK-MC1",
  "id": "vNgp7DylSNajeJrnK-MC1",
  "layout": "blog",
  "linkedPageIds": [
  ],
  "md": "Welcome to the Day 5 of AFFiNE 0.11.0 Launch Week! On this final day, we are thrilled to present the meticulously crafted **onboarding design** that embodies our special dedication. From the establishment of **design goals** through the entire process of **planning and finalization**, highlighting **innovative aspects**, and discussing topic choices, to the **ultimate results** in the form of a video – we aim to share with you every facet of our design philosophy!\n\n\n# **Start with Design Philosophy: Unveiling the Essence of Our Approach**\n\n\n## **The Crucial Role of Onboarding in Your Engagement Journey**\n\n\nIn the dynamic realm you're part of, we understand the paramount importance of a seamless onboarding experience. With the evolution of technology and rising expectations, **initial interactions wield profound influence, shaping perceptions and long-term engagement**. This meticulously crafted onboarding process serves as a gateway, not only **unveiling features** but **laying the foundation for an active and engaging journey**. It doesn't just reveal functionalities; **it ignites a path towards proactive involvement**.\n\n\n\n![QXSiWlkjpt1OvaHlYHDP1b0TQwYTVvrNRv4hK40m5tQ=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/QXSiWlkjpt1OvaHlYHDP1b0TQwYTVvrNRv4hK40m5tQ=)\n\n\n## **Design Objectives**\n\n\n### **\"We become what we behold. We shape our tools and then our tools shape us.\"**\n\n\nWe got so tired of the traditional SaaS who always wanted to extract as much information as they can as if humans could be all easily classified into a few occupations. We want our tool to **be humanized** and we want you to have **a direct feeling about it** when you open it for the first time. So instead of asking you endless questions about who you are, we choose to **give you five articles we love the most from a variety of areas**, hoping to **become closer to you** by letting you choose what knowledge you'd love to start with AFFiNE. Hope you can enjoy them as much as we did.\n\n\n### **Philosophy Reinvented - The Essence of \"Aha Moment\"**\n\n\nIn AFFiNE, we strive to make you experience that **the integration of whiteboard and documents goes beyond a simple overlay of functions.** It signifies the emergence of a **new collaboration and inspiration paradigm**, offering key advantages.\n\n\nFirstly, seamless integration allows you to **handle documents and whiteboard within a single interface**, enhancing efficiency.\n\n\nSecondly, the fusion of **a freeform whiteboard with structured documents** sparks **creative thinking**, fostering your creativity.\n\n\nThirdly, it promotes **enhanced team collaboration through collective editing.**\n\n\n Lastly, **visualizing complex information on the whiteboard** improves understanding and communication skills.\n\n\n### **Local-First Approach: Transforming Data Processing for Enhanced Security and Efficiency**\n\n\nAFFiNE underscores the value of **a local-first approach**, prioritizing **offline capabilities**, seamless **cross-device experiences**, and **data security, privacy,** and **long-term preservation.** This strategy addresses traditional SaaS challenges, offering **a more secure, private, sustainable, and user-controlled data processing solution.** AFFiNE's product differentiation not only provides a unique market position but also ensures users experience minimal disruptions, fostering increased work efficiency and greater control over their data throughout usage.\n\n\n### **Postponed Questionnaire: We Want to Know More About You**\n\n\nWe value **your thoughts and habits**, so when you start using AFFiNE, this questionnaire will guide you in sharing information about your work habits, technology preferences, and desired features. Designed for simplicity, this survey ensures a quick completion while **gathering valuable insights into your needs**. Your input not only tailors personalized recommendations but also guides AFFiNE in **meeting your expectations with precision in future updates.**\n\n\n# **A Visual Symphony - Crafting an Intuitive Design**\n\n\n## **Navigating the Planning Stage and Draft Showcase**\n\n\nIn the initial design, your AFFiNE journey unfolds as follows: You start by accessing the startup page and then proceed to explore the introduction to AFFiNE. Following this, you enter the questionnaire section, sharing information about your work habits, technology preferences, and desired features. After completing the questionnaire, you encounter a showcase of AFFiNE's features, including captivating animated presentations. The Bento version page is then presented, offering you additional options. Finally, you enter the app, commencing your AFFiNE experience.\n\n\n\n![OFKJ7lc0KoSSi9vFzRveZ6AzlOipP-tnTVYyr8Hoi0U=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/OFKJ7lc0KoSSi9vFzRveZ6AzlOipP-tnTVYyr8Hoi0U=)\n\n\n#### **The Finalized Process**\n\n\nAfter discussions and brainstorming sessions with more team members and the Product Owner, we have redefined the onboarding design process:\n\n\n\n![nojiOM3tB2qlBtJuQxyOiH4CBIMeVK7w3BVYlzZoYQQ=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/nojiOM3tB2qlBtJuQxyOiH4CBIMeVK7w3BVYlzZoYQQ=)\n\n\nThe journey begins with an entrance phase featuring a captivating animation. Next, you can choose articles of interest and proceed to convert them into whiteboard documents. On the confirmation page, you can review and confirm your selections. Finally, you will be invited to enter the app, initiating your AFFiNE experience.\n\n\n\n![PbJq-VTPpWhi92LoI_Ir-ppvJybcR9IQfGRT0uUOQbE=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/PbJq-VTPpWhi92LoI_Ir-ppvJybcR9IQfGRT0uUOQbE=)\n\n\n#### **A Visually Stunning Entrance: Innovating Animation and Transitions**\n\n\n<video muted autoplay loop preload=\"auto\" playsinline>\n  <source src=\"https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/jvmaITSRGGXKFeKG6bLPIYZ07_waXB5Zj_m_Bi1ZJSM=\" type=\"video/mp4\" />\n</video>\n\n\nIn our pursuit of innovation, we aimed to create **a full-screen entrance** effect, leading us to conduct extensive technical research and even develop a standalone project to fine-tune animation details. **This project will be open-sourced in the future.**\n\n\nIn the design process, difficulties and challenges are inevitable. We overcame many issues:\n\n\n1. We successfully developed a fully transparent window based on the Electron framework, overcoming complexities in multi-display switches to mimic real windows.\n\n\n1. For simulating paper bending, we chose \"pure CSS for 3D transformation\" over WebGL, striking a balance between visual quality and development efficiency.\n\n\n1. Our focus on smooth and reversible transitions led us to effectively manage multiple animation stages, from paper flying into transitioning to the startup page.\n\n\n1. In transitioning between pages and edgeless mode, we selected a simulated approach over using the actual blocksuite renderer. This involved extra work on canvas scaling and dragging, but resulted in smoother animations.\n\n\nIn summary, our commitment to innovation guided us through various challenges, from creating transparent windows to achieving seamless animations, culminating in a distinctive and visually appealing user experience.\n\n\n# **UIUX Improvement and Creative point**\n\n\nRecognizing scenarios where there might be numerous window elements, we have refined the shadows for a more polished appearance.\n\n\n\n![OZiisKTTDejG7U5Q8jzjUS9hqz-qrW11RQMHRO7x1A0=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/OZiisKTTDejG7U5Q8jzjUS9hqz-qrW11RQMHRO7x1A0=)\n\n\nWe have independently managed the timing of prompt messages to prevent your confusion. Additionally, we prioritize visual aesthetics, making functional buttons and toast messages contextually relevant.\n\n\n\n![Lu0Us5el0M5rYzjZYKo-JwV75o6Inn7G6isU9JmJbps=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/Lu0Us5el0M5rYzjZYKo-JwV75o6Inn7G6isU9JmJbps=)\n\n\n\n![9AfRrW6_r5TWxGRGE9vGkZS07axxsbWdfpcC0tgiHKQ=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/9AfRrW6_r5TWxGRGE9vGkZS07axxsbWdfpcC0tgiHKQ=)\n\n\nUnique styling has been introduced for the web version, ensuring an optimized and distinctive visual experience.\n\n\n\n![f8-746w8qq2TmC2hxW9i24mmVWIjsW_ewMUuOji017E=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/f8-746w8qq2TmC2hxW9i24mmVWIjsW_ewMUuOji017E=)\n\n\n# **Handpicked Insights - Selecting Five Articles**\n\n\nThroughout the AFFiNE onboarding, we've introduced a distinctive feature: during this phase, you'll encounter **five thoughtfully chosen lengthy articles**. In AFFiNE, articles aren't just presented in the traditional text but also **visually on a whiteboard**, employing **graphics and simplified paragraphs**. This inventive approach **accelerates your understanding of article highlights.** The article selection process was a collaborative effort, ensuring a varied and pertinent collection. To sum up, our visual representation method **enhances the intuitive grasp of lengthy articles,** making your onboarding experience more engaging and insightful.\n\n\n## **Breath of the Wild: Redefining Game Design**\n\n\n\n![dGqp21AJTXlMosHpAVl-u2_Dczm-LvTsS8GxFO3l4a4=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/dGqp21AJTXlMosHpAVl-u2_Dczm-LvTsS8GxFO3l4a4=)\n\n\nAFFiNE aims to expand its support for the **gaming and creative industries**, exemplified by the chosen article, \"**Breath of the Wild: Redefining Game Design.**\" The piece explores the innovative game design of \"**The Legend of Zelda: Breath of the Wild**,\" emphasizing its intricate gameplay that fosters diverse player interactions and unexpected outcomes. The analysis delves into enhanced terrain, physics, and action systems, offering players unprecedented freedom. Ultimately, the article highlights the potency of complex gameplay in creating engaging, immersive experiences, fostering player creativity and exploration.\n\n\n## **Local-first Software: You Own Your Data, in Spite of the Cloud**\n\n\n\n![cy6DjwE14QzC1ddpO1eZwyhZQl0NNCqYh2N0xdnU6Tc=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/cy6DjwE14QzC1ddpO1eZwyhZQl0NNCqYh2N0xdnU6Tc=)\n\n\nAFFiNE spotlights a crucial article in the local-first domain titled '**Local-first Software: You Own Your Data, in Spite of the Cloud.'**\n\n\n This piece delves into \"local-first software,\" advocating for **user data ownership and collaboration**. It critiques cloud apps like Google Docs, emphasizing the risks of centralized data. The article explores Conflict-Free Replicated Data Types (CRDTs) and their role in enhancing data security, privacy, and user control. Examining Ink & Switch's prototype development and CRDT challenges, it offers valuable insights for future software design **prioritizing security, privacy, and user agency.**\n\n\n## **How to: Be More Productive**\n\n\n\n![FwmEf6XX7mSvK3wuvaXJvNxLuLXs2C61OU05dbnghuM=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/FwmEf6XX7mSvK3wuvaXJvNxLuLXs2C61OU05dbnghuM=)\n\n\nAFFiNE is a productivity tool, so it visually presents content related to productivity.\n\n\nDelve into the wisdom of **Aaron Swartz**, a visionary who dedicated his life to **making knowledge accessible on the internet. This article, penned by Swartz**, advocates recognizing the temporal nuances of productivity, strategically aligning tasks with varying time qualities, and embracing life priorities. It underscores the significance of maintaining creativity, efficient task organization, and minimizing disruptions to enhance time quality. Swartz's insights extend to overcoming procrastination by breaking down tasks and aligning work with personal interests and mental states. **We hold deep admiration for Swartz and present this article as a tribute to his impactful legacy.**\n\n\n## **Learning with Retrieval Practice**\n\n\n\n![dTqZCoImiVIp7TxDd2uqur0kRr0e8JzqD-XJO_RGzYI=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/dTqZCoImiVIp7TxDd2uqur0kRr0e8JzqD-XJO_RGzYI=)\n\n\nAFFiNE aims to assist you in better learning, organizing, and managing information and knowledge, hence it offers an article related to learning techniques: \"Learning with Retrieval Practice.\"\n\n\nMeet **Barbara Ann Oakley**, an esteemed American engineering professor at Oakland University and McMaster University, renowned for her massively popular online courses on learning. As a distinguished figure **in STEM education and learning practices**, Oakley co-created the world's most popular online course, \"Learning How To Learn.\" Additionally, she authored the standalone book, \"A Mind For Numbers: How to Excel at Math and Science,\" complementing the ideas presented in her influential MOOC. **This article, inspired by Oakley's expertise**, explores effective learning strategies, emphasizing active recall, focused learning, and structured review for optimal information retention and understanding.\n\n\n## More is Different\n\n\nAFFiNE fully recognizes the importance of **scientific research** and **maintains an open attitude towards the development of science**, so it selected a scientific paper published by P.W. Anderson in 1972 titled \"More is Different\"\n\n\nDo numerous cells constitute a human? Do countless atoms aggregate to form physics? Does an intricate interplay of physics and mechanics at the micro-molecular level determine how we function, build, and love? The answer is no. \"More is different\" holds true. From the microscopic realm of quantum mechanics to the complexity of chaos theory-driven systems like companies and societies, variations can magnify, and ultimately, more is indeed different. Careful consideration of desires is paramount, and free will remains significant in navigating these intricacies.\n\n\nThe article discusses the essence and evolution of **science,** introducing a new perspective that the properties of matter vary at different scales. It highlights the significance of scientific research and urges an open attitude towards the development of science. The key points include the nature of science as the exploration and understanding of natural laws, the **diversity** in the behavior of matter at various scales as central to scientific research, and the need for an **open mindset** to continually explore new domains and perspectives in science.\n\n\n\n![vZ1a-lV1wIhVjvxShoLAy6PZW-18XFOs0gMA8EWCz-8=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/vZ1a-lV1wIhVjvxShoLAy6PZW-18XFOs0gMA8EWCz-8=)\n\n\n# Get ready to unlock new levels of productivity\n\n\nAs our AFFiNE 0.11.0 release week comes to an end, we are excited to share the intricacies of **our carefully crafted entry design** on the final day. From setting design goals through the planning and finalizing stages, emphasizing innovative elements, discussing topic selection, and finally providing a comprehensive video presentation, our goal is to **provide you with a comprehensive understanding of our design concepts**.\n\n\n[0.11.0 Stable](https://affine.pro/download) is coming soon, and we look forward to **your continued participation** and hope that our commitment to excellence is reflected in every aspect of your AFFiNE experience. **Thank you for joining us on this exciting journey!**\n\n\nLast but not least, let's take a brief moment to look back at the informative articles we shared throughout this dynamic launch week:\n\n\n**Day 1: [https://affine.pro/blog/affine-0-11-0-launch-day1-elevation-celebration-bug-fixes-ux-delight](https://affine.pro/blog/affine-0-11-0-launch-day1-elevation-celebration-bug-fixes-ux-delight)**\n\n\n**Day 2: [https://affine.pro/blog/docs-edgeless-stylized-embody-your-creativity-better-and-easier](https://affine.pro/blog/docs-edgeless-stylized-embody-your-creativity-better-and-easier)**\n\n\n**Day 3: [https://affine.pro/blog/affine-0-11-0-launch-day-3-beyond-text-color-history-table-of-content-possibilities](https://affine.pro/blog/affine-0-11-0-launch-day-3-beyond-text-color-history-table-of-content-possibilities)**\n\n\n**Day 4:** [https://affine.pro/blog/affine-0-11-0-launch-day-4-navigating-canvas-complexity-templates-clarity-free-online-whiteboard](https://affine.pro/blog/affine-0-11-0-launch-day-4-navigating-canvas-complexity-templates-clarity-free-online-whiteboard)\n\n\n* Official Website: [https://affine.pro/](https://affine.pro/)\n\n\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n\n\n* Twitter: [https://twitter.com/AffineOfficial](https://twitter.com/AffineOfficial)\n\n\n* Community：[https://community.affine.pro/home](https://community.affine.pro/home)\n\n\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n\n\n* Telegram: [https://t.me/affineworkos](https://t.me/affineworkos)\n\n\n",
  "publish": true,
  "relatedBlogIds": [
  ],
  "relatedBlogs": [
  ],
  "slug": "affine-0.11.0-Launch-Week-Day-5-From-Concept-to-Click-Onboarding-Process",
  "tags": [
    "Release Note"
  ],
  "title": "AFFiNE 0.11.0 - Launch week - Day 5/5: From Concept to Click: Onboard AFFiNE the way how we image, design, and eventually build it.",
  "updated": 1703203200000,
  "updatedDate": 1709100080362,
  "valid": true
}