{
  "id": "xd-3HeAaBL",
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/IpVKsP2rGuohHm8zpXP1kSTD23SjOVTvx-Y4btQPbSY=",
  "coverAlt": "",
  "md": "On August 25th, 2023, AFFiNE held a meetup at the NUS campus focusing on collaborative applications. We were joined by students and friends from NTU, NUS, and Notion to delve into the applications of collaborative note-taking in daily life and work.\n\n\nBefore the event kicked off, attendees were greeted with delightful gifts such as fridge magnets, T-shirts, and tote bags. The event was divided into two main segments, discussing how we use note-taking software tools daily and how we could better harness our potential.\n\n\n\n![2R7cdevKXfkRXmyznCkU4Q7wV9k7jIRpjcnP-G59oKM=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/2R7cdevKXfkRXmyznCkU4Q7wV9k7jIRpjcnP-G59oKM=)\n\n\n**Segment 1:** Chris, the community manager from AFFiNE, introduced some of the most popular collaborative office note-taking software in the market. These included AFFiNE, Miro, Notion, and Google Docs. Chris offered insights into each software, elaborating on their use cases, pros, and cons.\n\n\n\n![cuw9JHXVfIqyduqml0uc-4LKS3ve8RgYzoVRVv6BjoU=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/cuw9JHXVfIqyduqml0uc-4LKS3ve8RgYzoVRVv6BjoU=)\n\n\n* Google Docs: One of the earliest players in the online note-taking domain, Google Docs is renowned for its focus on note formatting and supports multiple users collaborating in real-time.\n\n\n* Notion: Currently one of th e fastest-growing note-taking tools on the market. It employs concepts like workspaces, blocks, and double-linking, offering versatility in note-taking and management for both personal and professional life.\n\n\n* Miro: A unique approach to note-taking where users create on an endless canvas. This format offers users a structured yet creative way to ideate and brainstorm without boundaries.\n\n\n* AFFiNE: Among the most innovative and user-friendly note-taking software available today, AFFiNE combines the strengths of the aforementioned tools. It allows for traditional document-style creation and the flexibility to switch to an unrestricted mode for a more imaginative form of note-taking. A defining feature of AFFiNE is its open-source nature, maintained by a passionate community of note-lovers and developers. With AFFiNE, users genuinely own their data and can manage its public visibility and sharing options.\n\n\n**Segment 2:** Jackie, the Operations Director from AFFiNE, walked us through the myriad possibilities of creating on AFFiNE, explaining its versatility and practicality in diverse scenarios:\n\n\n\n![siQGtcqazFeVmw3rRZSv94_Odaw1L2W6BpYbyvzJnGs=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/siQGtcqazFeVmw3rRZSv94_Odaw1L2W6BpYbyvzJnGs=)\n\n\n* Planning Your Travel Itinerary\n\n\n\n![iXo5aNxLU63DaLsTjl5fgcUlYoYroIOnBapP91PDGgc=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/iXo5aNxLU63DaLsTjl5fgcUlYoYroIOnBapP91PDGgc=)\n\n\n* Managing Your Project Progress\n\n\n\n![SaoAnH2bS2P1FhXX1ugo2nW7GUoRdlDfy9Ih1Qutbwg=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/SaoAnH2bS2P1FhXX1ugo2nW7GUoRdlDfy9Ih1Qutbwg=)\n\n\n* Drafting Your OKRs (Objectives and Key Results)\n\n\n\n![B84YGfp-h0mtU3CsjyOK1RRq7waeAzeeYxcIF5-tCLE=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/B84YGfp-h0mtU3CsjyOK1RRq7waeAzeeYxcIF5-tCLE=)\n\n\nThe event's finale involved breaking into smaller groups to discuss challenges faced in personal and professional life and how note-taking software can be used to better manage these challenges. Surrounded in a circle, participants exchanged views, posing intriguing questions and sharing practical tools. This session also provided invaluable user feedback to AFFiNE, aiding in product refinement.\n\n\n\n![4hMhrFAqN_ajhQoUYanuD2ziwrPkxoimYtreC71b6x0=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/4hMhrFAqN_ajhQoUYanuD2ziwrPkxoimYtreC71b6x0=)\n\n\nIn conclusion, AFFiNE is committed to being the best in collaborative tools. We regularly host exciting events and offline meetups, so stay tuned for more. Should you have any queries, don’t hesitate to reach out. Below are our contact details:\n\n\n* Official Website: [https://affine.pro/](https://affine.pro/)\n\n\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n\n\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n\n\n* Twitter: [https://twitter.com/AffineOfficial](https://twitter.com/AffineOfficial)\n\n\n",
  "createDate": 1694508572522,
  "title": "AFFiNE's Collaborative Application Meetup at NUS – A Glimpse into the Future of Note-taking",
  "updatedDate": 1695366593973,
  "favorite": false,
  "guid": "H6vffRmJbCfA-r3kq_36_:space:xd-3HeAaBL",
  "author": "Haoxin Shang",
  "tags": [
    "Content"
  ],
  "slug": "affine-event-nus",
  "description": "Discovery the event AFFiNE team hosts within NUS students",
  "created": 1694476800000,
  "updated": 1694476800000,
  "layout": "blog",
  "publish": true,
  "authors": [
    "Haoxin Shang"
  ],
  "valid": true,
  "relatedBlogIds": [],
  "linkedPageIds": [],
  "relatedBlogs": []
}