{
  "title": "Chatting with you, our community, about AFFiNE Alpha!",
  "authors": [
    "Fangyuan Zheng",
    "Christopher Smolak"
  ],
  "tags": [
    "Feature request"
  ],
  "description": "Chatting with you, our community, about AFFiNE Alpha!",
  "created": 1668124800000,
  "updated": 1668124800000,
  "layout": "blog",
  "id": "09392de44f8647c5ba5a54b01f7014cd",
  "slug": "chatting-wth-you-our-community-about-affine-alpha",
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/J1VtarojWlIXT4_l3uOywXwnwgeM11uPWbcsJN3GQa0=.webp",
  "md": "---\n\ntitle: Chatting with you, our community, about AFFiNE Alpha!\n\nauthor:  Fangyuan Zheng, Christopher Smolak\n\ntags: Feature request\n\nslug: chatting-wth-you-our-community-about-affine-alpha\n\ndescription: Chatting with you, our community, about AFFiNE Alpha!\n\ncreated: 2022-11-11\n\nupdated: 2022-11-11\n\nlayout: blog\n\npublish: true\n\n---\n\n\n![J1VtarojWlIXT4_l3uOywXwnwgeM11uPWbcsJN3GQa0=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/J1VtarojWlIXT4_l3uOywXwnwgeM11uPWbcsJN3GQa0=.webp)\n\n## Introduction\n\nThe Alpha version of AFFiNE has been live for two weeks now over on [https://pathfinder.affine.pro](https://pathfinder.affine.pro). During these two weeks, we have collected user feedback on several important features of the Alpha version, hoping to learn more about what users think and to guide our development of improvements and new features across future updates.\n\nYou may have also previously used, or even still use, the AFFiNE pre-alpha over on [https://livedemo.affine.pro](https://livedemo.affine.pro), we've kept this demo up as it shows some of the progress we made with our old-code base and what features will be coming in future releases. **Our plan now is to integrate all those features from the older demo, and more, into the latest AFFiNE release.** It's worth noting that we do not intend to release any more updates for the older demo, and it is only there for reference and a technology showcase.\n\nOver these last few weeks, many users have also expressed to us their love for this version and their hopes for the future of AFFiNE. We are very happy that people like the Alpha version and take everyone's ideas very seriously. It's an honor for AFFiNE to have such a strong and active community, and for AFFiNE's value to be recognized by everyone.\n\n## Dark Mode\n\nDark Mode is a brand-new feature. During the pre-Alpha stage, many users suggested to us that this feature should go live. So we added this feature to the Alpha version, hoping to give users a better visual experience.\n\n**Ishaanrathod said:**\n\n\n![rxgal8f2DWOOjyjUJKOxxZ9DhwZTHyOeP_jN3oxMi8w=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/rxgal8f2DWOOjyjUJKOxxZ9DhwZTHyOeP_jN3oxMi8w=.webp)\n\n**Hioko said:**\n\n\n![3j3E9KH5r4e8SV3d3-RHaC3RJ2HmAy98ukEUpC0G4KU=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/3j3E9KH5r4e8SV3d3-RHaC3RJ2HmAy98ukEUpC0G4KU=.webp)\n\n**Enamul said:**\n\n\n![DpcAmDQ_xlfkvCMkS09NzqJrSCYo7IjrL9TP2rQhYGU=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/DpcAmDQ_xlfkvCMkS09NzqJrSCYo7IjrL9TP2rQhYGU=.webp)\n\nAfter the Dark mode feature went live, users loved the feature more as well. This makes us very excited, and we made the right decision in choosing to go live with Dark mode in the Alpha release.\n\n**Edenilson LR said:**\n\n\n![caMCT87_hdNK7yFEparwg4m2uxYhcyEjTq_DWUom80c=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/caMCT87_hdNK7yFEparwg4m2uxYhcyEjTq_DWUom80c=.webp)\n\n**Mathematti said:**\n\n\n![COuY9_Nx_8iIvThQTu7d2OGXvL4bfFiXz8nVqeZ4oLY=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/COuY9_Nx_8iIvThQTu7d2OGXvL4bfFiXz8nVqeZ4oLY=.webp)\n\n## Shortcuts\n\nIn August, UlyssesZhan asked us if we could support shortcuts because he wanted to have a quick way to select specific content. We thought this was a basic feature that an editor should have and would enhance the user experience. So in the Alpha release, we have this feature live and expect that it will help users improve their editing efficiency.\n\n**UlyssesZhan said:**\n\n\n![r9qWn63LuwpxiAc1DVdVi8Y6lIwdUQotpAvGrbDBEbY=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/r9qWn63LuwpxiAc1DVdVi8Y6lIwdUQotpAvGrbDBEbY=.webp)\n\nIn mid-October, the Shortcuts feature of Alpha went live. Our Alpha release aims to provide a basic editable product for users, so basically, all shortcuts are for text content. We were also very fortunate to receive encouragement and love from everyone after the product went live, and this is what motivates us to strive for a better version.\n\n**αβiδ said:**\n\n\n![MFt3NTr1O0q8F-cOyqTXQVzmsQ5rLTlzIct53Hx1NZw=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/MFt3NTr1O0q8F-cOyqTXQVzmsQ5rLTlzIct53Hx1NZw=.webp)\n\n## Markdown\n\nActually, the Alpha version is a brand new version for AFFiNE. Although it doesn't have more cool features than the pre-Alpha (live demo) version yet. It provides a greatly improved and stable editing environment for users, allowing for a more structured and cleaner approach to development and the support of more features in the future. It's a great start for both us and our users, and Markdown is the first feature to go live in the new version.\n\nMarkdown is one of the most popular suggestions from our users, 90% of them want to support Markdown in our editor.\n\n**Jimmy W said:**\n\n\n![wuMzRqELhIwhZ-u-g2JRjr2vOYX4Zzde2ftOXs8gRW8=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/wuMzRqELhIwhZ-u-g2JRjr2vOYX4Zzde2ftOXs8gRW8=.webp)\n\nThere is still a strong demand for Markdown from users, as it does provide us with convenience.\n\n**Bryan said:**\n\n\n![YLY6gYq2FXDtsxK__1A02qL9Fv0XllgUy0EvQoD9YSc=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/YLY6gYq2FXDtsxK__1A02qL9Fv0XllgUy0EvQoD9YSc=.webp)\n\n\n![4w1LB5OUjCpwg77o1wDtg62yi4GrAZPjMQyFJtIeK-w=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/4w1LB5OUjCpwg77o1wDtg62yi4GrAZPjMQyFJtIeK-w=.webp)\n\n\n![QP1KcHaI8Q4xXd6lP-iE0FkNX6XbvIAOhgYwnwwl63k=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/QP1KcHaI8Q4xXd6lP-iE0FkNX6XbvIAOhgYwnwwl63k=.webp)\n\nWe also conducted a user poll to find out how familiar users are with Markdown, and will soon publish a Markdown user guide to help you make the most out of the Markdown syntax and use it inside of the latest AFFiNE.\n\nWe really appreciate all of our users' suggestions and support!\n\n**Please feel free to contact us if you encounter any bugs or have some new feature ideas. Thank you sincerely for your support!**\n\n* **Feedback:** [https://github.com/toeverything/AFFiNE/issues/new/choose](https://github.com/toeverything/AFFiNE/issues/new/choose)\n\n* **AFFiNE Alpha:** [https://pathfinder.affine.pro/](https://pathfinder.affine.pro/)\n\n",
  "publish": true
}