{
  "title": "CityJS Singapore 2023 Event Summary",
  "authors": [
    "Yiyang Zhang"
  ],
  "tags": [
    "Content"
  ],
  "description": "CityJS Singapore 2023 event summary with AFFiNE",
  "created": 1692230400000,
  "updated": 1692230400000,
  "layout": "blog",
  "id": "_CY_vtzysH",
  "slug": "cityjs-singapore-2023-event-summary",
  "cover": "https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/To3AP6fqZT_8h5wQ9joVrXEiXkTsLpFuWGonCuwVoVI=.webp",
  "md": "---\n\ntitle: \"CityJS Singapore 2023 Event Summary\"\n\nauthor: Yiyang Zhang\n\ntags: Content\n\nslug: cityjs-singapore-2023-event-summary\n\ndescription: CityJS Singapore 2023 event summary with AFFiNE\n\ncreated: 2023-08-17\n\nupdated: 2023-08-17\n\nlayout: blog\n\npublish: true\n\n---\n\n\n\n\n![To3AP6fqZT_8h5wQ9joVrXEiXkTsLpFuWGonCuwVoVI=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/To3AP6fqZT_8h5wQ9joVrXEiXkTsLpFuWGonCuwVoVI=)\n\n**What is CityJS？**Below is an introduction from the official website:\n\n> **A Community Event organised by the Community, our Javascript Conference evolved from the popularity and success of a monthly meet-up put together by 4 different JavaScript groups in London, including London JS Community, JS Monthly, Halfstack, and Node User Group. The conference is for developers, solution architects, and other tech individuals aiming to stay in touch with the industry. Our aim is for individuals to be updated on innovative changes around the industry and JS as an entity.**\n\nTo learn more about CityJS, you can visit their official website (https://singapore.cityjsconf.org/) or follow their Twitter account (https://twitter.com/cityjsconf).\n\n\n\nThe grand CityJS event in Singapore lasted three days from July 26th to 28th and attracted over 300 participants from all over the world. Among them were the two event organizers, Aris and Iris, three enthusiastic volunteers: Diamond from AFFiNE, Anne and Tan both from Shoppe,  along with 20 guest speakers from around the world and 200 focused audience members. **It was great to get stuck in and help out while representing AFFiNE. And the opportunity to network and chat with other technical influences was invaluable. Now let me take you through and review the whole CityJs Singapore event.**\n\n## Day One (July 26):\n\nThe opening ceremony of the event took place in Singapore's AWS conference room. In the workshop on this day, Roy Derks introduced us to GraphQL the whole day. The atmosphere was warm and active, with everyone eagerly interacting and communicating.** In this session, Roy Derks introduced the practical applications of GraphQL in different scenarios, its pros and cons, and best practices.** For more details, you can follow his Twitter: https://twitter.com/gethackteam and engage in deeper discussions with him.\n\n\n![yeVieJbu4bU3kqWYkwLrBi52Y4CfwdLVXfP-XJebW7Q=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/yeVieJbu4bU3kqWYkwLrBi52Y4CfwdLVXfP-XJebW7Q=)\n\n\n![jyFY-BAhasfkkoqlGvk9IdBzFiEnCHxmIh1c81R2vG8=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/jyFY-BAhasfkkoqlGvk9IdBzFiEnCHxmIh1c81R2vG8=)\n\n\n![mcygNo4DpDzfwRwMyyaxUrd76advTKciE_Jg5ZqIj7I=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/mcygNo4DpDzfwRwMyyaxUrd76advTKciE_Jg5ZqIj7I=)\n\nWhile that was going on, VMWARE OFFICES hosted a free workshop, inviting ten JavaScript engineers from various industries to share their experiences and knowledge. They brought exciting insights from business logic, infrastructure, and AI technology, to security protection:\n\n\n![PxD1SVj5zpo7h6XVr-ZRxzmbXS2r9zQNdnfZLW4b__4=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/PxD1SVj5zpo7h6XVr-ZRxzmbXS2r9zQNdnfZLW4b__4=)\n\n\n![sme1G-nbCWTY_gkOOwlLF2pUryyKsE-GzPdhTVK7U3g=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/sme1G-nbCWTY_gkOOwlLF2pUryyKsE-GzPdhTVK7U3g=)\n\n## Day Two (July 27):\n\nA master-class character, Kyle Simpson, brought us a workshop titled \"THINKING & CODING ALGORITHMS IN JAVASCRIPT\". **Kyle's sharing was full of humour and wisdom, using vivid examples to lead everyone to understand more deeply the application of JavaScript in the field of algorithms**:\n\n\n![D62O_IJL4dAnpjG1-W6ruVHY4D7oRvZrj9zmwDi0bk4=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/D62O_IJL4dAnpjG1-W6ruVHY4D7oRvZrj9zmwDi0bk4=)\n\n\n![z8yqB5rDrv-eU4ndLgQ_sUpJO2WbwYfZQJRoWCeaVuk=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/z8yqB5rDrv-eU4ndLgQ_sUpJO2WbwYfZQJRoWCeaVuk=)\n\nIn the evening, the CityJs organizing team, guest speakers, sponsors, and volunteers held a unique offline cocktail party at Clarke Quay. Here, everyone got to know each other, exchanged contact information, established profound friendships, and set up an international communication and cooperation platform:\n\n\n![970uT_vpKd7oA2CUHbDZC5ly_Kna7nIDr_yy3Tv-GyI=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/970uT_vpKd7oA2CUHbDZC5ly_Kna7nIDr_yy3Tv-GyI=)\n\n\n![wGW6XVG8phOjZatBv4hvmATTwuqnS0oKh-wo_snG25g=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/wGW6XVG8phOjZatBv4hvmATTwuqnS0oKh-wo_snG25g=)\n\n## Day Three (July 28):\n\nThis day was the climax of the CityJs event. The venue was abuzz early in the day. **Participants busily set up the site, introduced their products, and shared their unique insights with others.** Additionally, the organizers prepared a series of exquisite souvenirs, leaving beautiful memories for the participants:\n\n\n![Upqt1LzD3madkpUKwqJc4Is-VXq29448DQG2aAwKovU=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/Upqt1LzD3madkpUKwqJc4Is-VXq29448DQG2aAwKovU=)\n\n\n![JFkoukzojAwS3S2l-6zo6qMLDKDZDatbo2b8QO4Xkao=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/JFkoukzojAwS3S2l-6zo6qMLDKDZDatbo2b8QO4Xkao=)\n\n\n![RkSP5KuewsDft0AkeC6NcjUJzZLdtMOUemlDPJgEqoc=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/RkSP5KuewsDft0AkeC6NcjUJzZLdtMOUemlDPJgEqoc=)\n\nAs the event got underway, we were fortunate to listen to brilliant talks from 14 front-end leaders, including Evan You, the creator of Vue.js, and Kyle Simpson, the author of \"You Don't Know JavaScript\".\n\nImpressively, Evan You, the author of Vue, introduces the journey of Vue, one of the three major front-end frameworks, from 0 to 3.0. Vue started to be released in 2013, to the release of version 1.0 in 2015, and then re-revised to version 2.0 in 2016, until now the stable version of 3.0, has undergone 7 iterations. Among them, Evan You spent four years rewriting vue 2.0 from 2018 to 2022. The reason for the rewrite is that the user base of Vue has become larger and larger during the development of this decade, accumulating a lot of problems and user feedback. **Thus, Evan You dedicated significant time to consider the developer experience, framework performance, stability, and other issues, and has fully incorporated TypeScript support in the new 3.0 version.** For more details, please follow Vue’s GitHub repository:\n\n\n![-NLtIktaNmkabb-wIs4huGqF83KiF_XQHnPlyXTGj9Q=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/-NLtIktaNmkabb-wIs4huGqF83KiF_XQHnPlyXTGj9Q=)\n\n\n![xMaeqwdCGkUq7zHcPiilkiShL72qQe_zMac7j9vLsmk=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/xMaeqwdCGkUq7zHcPiilkiShL72qQe_zMac7j9vLsmk=)\n\nContinuing on, Kyle Simpson's presentation, \"A Tale of Two Webs,\" deeply impressed the audience. **In it, he explained the diverse forms of next-generation JavaScript applications and the best practices for a local-first web in a lucid and approachable manner. At** AFFiNE, as practitioners and pioneers of local-first, we resonated a lot with Kyle Simpson in this speech. AFFiNE hopes that the local-first-web ecosystem will become more and more prosperous in the future, and AFFiNE, as a member of the open-source community, also hopes to contribute more:\n\n\n![lXCPSTvqr9svlmyjhWdYm-2WIwFp8FCuMLf6UHzC8lI=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/lXCPSTvqr9svlmyjhWdYm-2WIwFp8FCuMLf6UHzC8lI=)\n\n\n![PCJ5zGeRlgZFl1M-lySmodHsfyEfra-W9kly_YbJlVU=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/PCJ5zGeRlgZFl1M-lySmodHsfyEfra-W9kly_YbJlVU=)\n\nWith warm applause and reluctant eyes, this three-day grand event came to a successful close. If you would like to learn more about this event, please watch the video below:\n\n[https://www.youtube.com/watch?v=qrM3IDcNnlQ&t=3598s](https://www.youtube.com/watch?v=qrM3IDcNnlQ&t=3598s)\n\n\n![3xX1FqiN3nRmboUNKqbvI11bzZDIu60zhF3KDAUSV2A=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/3xX1FqiN3nRmboUNKqbvI11bzZDIu60zhF3KDAUSV2A=)\n\n\n![ZWB6zDLkQ2iTA_kzY2jLW5cCQlaz2cwkLPQgV91dlFE=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/ZWB6zDLkQ2iTA_kzY2jLW5cCQlaz2cwkLPQgV91dlFE=)\n\nAs volunteers from AFFiNE, we deeply participated in the entire event. During this time, we gained deep insights into many cutting-edge JavaScript technologies and excellent industry practices and met many outstanding JavaScript engineers. As a member of the open-source community, I, on behalf of AFFiNE, will continue to participate in more similar events. We also eagerly hope that more friends can join us to jointly advance this wonderful developer community.\n\n\n\n",
  "publish": true
}