{
  "title": "Copy and Paste with Customized Clipboard",
  "authors": [
    "Xiaodong Zuo",
    "Yifeng Wang",
    "Fanjing Zhang"
  ],
  "tags": [
    "Let’s make XXX"
  ],
  "description": "Copy and Paste are two of the most basic features for a practical editor",
  "created": 1658188800000,
  "updated": 1658188800000,
  "layout": "blog",
  "id": "029a5de8e9fb456fb9178195ba123577",
  "slug": "copy-and-paste-with-customized-clipboard",
  "cover": "https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/8trs9oIeTgdx-AbUSPV6NCg4_tBmqLK1ml30yKZxJgc=.webp",
  "md": "---\n\ntitle: Copy and Paste with Customized Clipboard\n\nauthor: Xiaodong Zuo, Yifeng Wang , Fanjing Zhang\n\ntags: Let’s make XXX\n\nslug: copy-and-paste-with-customized-clipboard\n\ndescription: Copy and Paste are two of the most basic features for a practical editor\n\ncreated: 2022-07-19\n\nupdated: 2022-07-19\n\nlayout: blog\n\npublish: true\n\n---\n\n\n![8trs9oIeTgdx-AbUSPV6NCg4_tBmqLK1ml30yKZxJgc=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/8trs9oIeTgdx-AbUSPV6NCg4_tBmqLK1ml30yKZxJgc=)\n\nCopy and Paste are two of the most basic features for a practical editor. User can copy pieces of data and paste it to any designated place, and that it, simple but useful. However, there is no lack of problems when it comes to implementing them in reality.\n\n## Basics\n\nThe basic logic of implementing clipboard looks as such.\n\n\n![mzvXYgdLRleSwifLyJL43SvO6B7ObAeYab0GgmP4ABY=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/mzvXYgdLRleSwifLyJL43SvO6B7ObAeYab0GgmP4ABY=)\n\n_Copying_ is to cache the relevant data into somewhere with a specific data structure, and _pasting_ is to take the cached data out from the space and add it into the target document.\n\nSo how do we cache data? There are several options.\n\n* By using memory space within the application: This is simple, but such a clipboard will only be valid in that application.\n* By using native clipboard (including the browser clipboard): This makes the clipboard sharable on a single device.\n* By using server cache: This allows the Copy and Paste feature to be used cross-platform.\n## Copy and Paste in AFFINE\n\nSo far, AFFINE runs mainly in the browser and therefore relies heavily on the browser clipboard for copy and paste. In this case, we set up several requirements for our clipboard.\n\n* Write data asynchronously: On one hand, when copying a large amount of content, synchronously writing data causes lag and thus affects user experience; on the other hand, some data that is not loaded in memory still has to be obtained asynchronously.\n* Customize MIME types: Data format varies across products, but MIME types available within clipboards cannot satisfy our needs. Transferring data into the common format however will lead to the loss of original information.\n* Be effectively offline: Our product can be used offline.\n* Be Functional with http and https protocols: We support user self-deployment.\n### Implementation\n\nTo be specific, our current solution is to intercept copy, cut, and paste events, customize data content and write it into the clipboard by document.execCommand('copy').\n\nThis approach has some caveats.\n\n* document.execCommand() is [deprecated](https://developer.mozilla.org/en-US/docs/Web/API/Document/execCommand) and no longer maintained by Web standards;\n* Although most browsers support [execCommand](https://developer.mozilla.org/en-US/docs/Web/API/Document/execCommand), developers still need to consider their compatibility.\n### **Why not clipboard.js?**\n\n[Clipboard.js](https://clipboardjs.com/) is a popular clipboard library which also involves copy, cut, and paste events and execCommand API. However we found it also has some obvious cons:\n\n* No support for customizing MIME types.\n* No support for writing multiple MIME types simultaneously.\n### **Why not Asynchronous Clipboard API**？\n\nAsynchronous [Clipboard API](https://developer.mozilla.org/en-US/docs/Web/API/Clipboard_API) is a newer web standard, but still not perfect:\n\n* It requires user authorization.\n* It’s only available in secure contexts such as localhost and https.\n* Its browser compatibility is relatively low.\nBesides, browsers will also modify clipboard data, this sometimes leads to the loss of certain meta data, e.g. style information.\n\n### Related: Browser plug-in\n\nUsing browser plug-in is also a common approach for implementing customized clipboard. However, it’s generally not a good choice as it requires users to add plug-ins beforehand.\n\n## Conclusion\n\nWe won’t say that we have found the best approach as each approach has its pros and cons. Combining multiple approach is possible, but then we have to consider the problem of data consistency. We still have issues to overcome, so please look forward to our subsequent updates!\n\n",
  "publish": true,
  "order": 62
}