{
  "title": "AFFiNE Downhills Recap - Introduction of AFFiNE - the next-gen knowledge-base",
  "authors": [
    "AFFiNE"
  ],
  "tags": [
    "Release Events"
  ],
  "description": "AFFiNE Downhills launch event recap series. Today we take a look at what Jiachen, the founder and product owner of AFFiNE has to say.",
  "created": 1679443200000,
  "updated": 1679443200000,
  "layout": "blog",
  "id": "KFSD-4fsSI",
  "slug": "downhills-recap-intro-affine-next-gen-knowledgebase",
  "cover": "https://insider.affine.pro/api/workspaces/H6vffRmJbCfA-r3kq_36_/blobs/TVkAjYzsYOCYOZK4BuAqP5L5vQ-fUYm9vkrsWELJKNM=.webp",
  "md": "---\n\ntitle: AFFiNE Downhills Recap - Introduction of AFFiNE - the next-gen knowledge-base\n\nauthor: AFFiNE\n\ntags: Release Events\n\nslug: downhills-recap-intro-affine-next-gen-knowledgebase\n\ndescription: AFFiNE Downhills launch event recap series. Today we take a look at what Jiachen, the founder and product owner of AFFiNE has to say.\n\ncreated: 2023-03-22\n\nupdated: 2023-03-22\n\nlayout: blog\n\npublish: true\n\n---\n\n\n\n\n![TVkAjYzsYOCYOZK4BuAqP5L5vQ-fUYm9vkrsWELJKNM=](https://insider.affine.pro/api/workspaces/H6vffRmJbCfA-r3kq_36_/blobs/TVkAjYzsYOCYOZK4BuAqP5L5vQ-fUYm9vkrsWELJKNM=)\n\n\n\nWelcome, to the AFFiNE Downhills launch event recap series. Today we take a look at what Jiachen, the founder and product owner of AFFiNE has to say.\n\n\n\n<div style=\"text-align:center;\">\n\n<iframe style=\"border-radius: 15px;\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/LFygOiGBJhU\" title=\"Introduction of AFFiNE - the next-gen knowledge-base - Open Source Notion/Miro Alternative\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n\n</div>\n\n\n\n**Product Journey**: As we all know, there are many knowledge management tools available in the market, but shifting between tools can lead to frustration and a waste of time. At AFFiNE, we believe that tools should help in the process of knowledge distillation, not fragment it. That's why we've designed our block editor to allow for different blocks of tools to fit on one page, be it on an infinite canvas, grid or tables.\n\n\n\n**AFFiNE Pre-Alpha:** We launched the AFFiNE Pre-Alpha in August 2022 to showcase our vision of the block editor. The demo was well-received by media outlets like Productivity and trusted by almost a million people from 77 countries around the world. We received a lot of feedback from our community and have spent the last six months working on the new AFFiNE Downhills.\n\n\n\n**AFFiNE Downhills:** AFFiNE Downhills is a complete reinvention of AFFiNE. We've refactored 93% of the code and improved the editor engine and graphic renderer, powered by BlockSuite. It's now 10 times faster than the previous version and one of the fastest editor solutions on the market.\n\n\n\n**Local-First Approach**: At AFFiNE, we believe in a \"local-first\" approach, which is why we're presenting a self-hostable backend and workspace solution that comes within AFFiNE web, AFFiNE client, and AFFiNE cloud. It's powered by OctoBase, our CRDT-based backend solution, which is self-contained, cross-platform friendly, and syncs everything you need with no extra care.\n\n\n\n**Open-Source:** We believe that the ultimate solution for productivity is one that is customisable and open-source. That's why we're open-sourcing our front-end framework BlockSuite and backend database OctoBase. We're now a 100% open-source company, and we will continue to keep it this way.\n\n\n\n**Conclusion:** That's all for my sharing today! AFFiNE is committed to providing a tool that simplifies the process of distilling knowledge from a wide range of information. We look forward to discussing AFFiNE further with our community. Remember, there are no supreme saviors, neither God, nor Caesar, nor tribune. Producers, let us save ourselves.\n\n\n\n",
  "publish": true
}