{
  "title": "AFFiNE Downhills Recap - Product Design Principle of AFFiNE",
  "authors": [
    "AFFiNE"
  ],
  "tags": [
    "Release Events"
  ],
  "description": "Introducing the product design, directions, upcoming version's features",
  "created": 1680048000000,
  "updated": 1680048000000,
  "layout": "blog",
  "id": "amHAR3PObD",
  "slug": "downhills-recap-affine-product-design-principle",
  "cover": "https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/R-UzYA1So29_OoevgoHx5kM-reP-Lz-PIUHHp5G-nv8=.webp",
  "md": "---\n\ntitle: AFFiNE Downhills Recap - Product Design Principle of AFFiNE\n\nauthor: AFFiNE\n\ntags: Release Events\n\nslug: downhills-recap-affine-product-design-principle\n\ndescription: Introducing the product design, directions, upcoming version's features\n\ncreated: 2023-03-29\n\nupdated: 2023-03-29\n\nlayout: blog\n\npublish: true\n\n---\n\n\n![R-UzYA1So29_OoevgoHx5kM-reP-Lz-PIUHHp5G-nv8=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/R-UzYA1So29_OoevgoHx5kM-reP-Lz-PIUHHp5G-nv8=)\n\n## Introduction\n\nIn the world of technology, user experience plays a vital role in the success of any product. At AFFiNE, we believe that aesthetics and design are crucial in delivering functionality and creating an immersive environment for users. We follow the modesty principle of design, which focuses on creating a comfortable medium for users to work on, allowing them to write down anything freely and undisturbed. We strive to bridge the gap between visual design and technical implementation to provide a better user experience.\n\n\n\n<div style=\"text-align:center;\">\n\n<iframe style=\"border-radius: 15px;\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/mkLT0b6xI5c\" title=\"Product Design Principle of AFFiNE\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n\n</div>\n\n## The Modesty Principle of Design\n\nThe Modesty Principle of Design is the cornerstone of our product architecture plan at AFFiNE. We focus on creating a natural environment of creation, where users can work without interruptions. Our design philosophy revolves around creating a comfortable medium for users to work on, which is why we've reduced the usage of modal components such as popovers and light-boxes to the bare minimum. We believe that the design of an application should be simple, modest, and not distracting to the user.\n\n## Block Handle/Drag Handle\n\nThe Block Handle or Drag Handle is an example of how we've implemented the Modesty Principle of Design in our application. It's designed to be a modest element with a simplistic shape that doesn't attract the user's attention while typing. However, the color of the handle changes and becomes more visible as the cursor approaches it, and its shape changes while hovering over it. These changes in UI and interaction are designed to be subtle and not interrupt the user's workflow.\n\n## Conclusion\n\nIn conclusion, at AFFiNE, we believe that the design of an application plays a crucial role in the user experience. Our Modesty Principle of Design focuses on creating a natural environment of creation where users can work without interruptions. We believe that the design of an application should be simple, modest, and not distracting to the user. The Block Handle or Drag Handle is an example of how we've implemented this principle in our application. We will continue to follow our design philosophy of creating an immersive environment for users to work in while maintaining simplicity and modesty.\n\n",
  "publish": true,
  "order": 123
}