{
  "title": "AFFiNE Downhills Recap - Product Architecture of AFFiNE",
  "authors": [
    "AFFiNE"
  ],
  "tags": [
    "Release Events"
  ],
  "description": "Introducing the product design, directions, upcoming version's features",
  "created": 1679875200000,
  "updated": 1679875200000,
  "layout": "blog",
  "id": "u8lRF2UNUb",
  "slug": "downhills-recap-product-architecture-affine-joe",
  "cover": "https://insider.affine.pro/api/workspaces/H6vffRmJbCfA-r3kq_36_/blobs/rAncMUOnCn72Gd7MsfEhs74G_PACA1tXrlP-LTJvjQE=.webp",
  "md": "---\n\ntitle: AFFiNE Downhills Recap - Product Architecture of AFFiNE\n\nauthor: AFFiNE\n\ntags: Release Events\n\nslug: downhills-recap-product-architecture-affine-joe\n\ndescription: Introducing the product design, directions, upcoming version's features\n\ncreated: 2023-03-27\n\nupdated: 2023-03-27\n\nlayout: blog\n\npublish: true\n\n---\n\n\n![rAncMUOnCn72Gd7MsfEhs74G_PACA1tXrlP-LTJvjQE=](https://insider.affine.pro/api/workspaces/H6vffRmJbCfA-r3kq_36_/blobs/rAncMUOnCn72Gd7MsfEhs74G_PACA1tXrlP-LTJvjQE=)\n\n\n**Introduction:**\n\nWelcome Joe, the Product Architect of AFFiNE, to share the company's vision for a knowledge management tool that integrates whiteboard, page, and database and prioritises a local-first approach.\n\n[https://youtu.be/evYaIuidEho](https://youtu.be/evYaIuidEho)\n\n\n---\n\n## **Video structure:**\n\n* **Introduction:** Introduction of Joe, our product manager.\n* **Product Directions:** Discuss AFFiNE's two main product directions: integrating Whiteboard, Page, and Database, and prioritizing a \"Local First\" approach over cloud collaboration.\n* **Benefits of Downhill Version:** Highlight the key benefits of the upcoming Downhill version, including collaboration capabilities, Google account login, and advanced Block Editor features.\n* **Unique Features:** Mention some unique features of AFFiNE, such as the Local First Workspace feature and the Block Editor that can be used with either the mouse or keyboard.\n* **Conclusion:** Summarize the key points of your presentation and encourage further discussion and engagement within the community.\n\n---\n\n## **Full script:**\n\n#### **Introduction:**\n\nHello everyone, I'm Joe, the Product Architect of AFFiNE, and I'd like to share our product direction, and the benefits of the upcoming Downhill version.\n\n#### **Product Directions:**\n\nAt AFFiNE, our product design and technology are constantly being improved to meet the demands of our users. We have two main product directions which we've always stuck to:\n\n1. Integrating Whiteboard, Page, and Database: We call the Whiteboard 'Edgeless', you can easily switch between Page and Edgeless. Text components will be replaced with a comprehensive, integrated Block Editor in Edgeless. Blocks on a page can be quickly converted into Database Blocks with one click, and Database Blocks can be added and edited directly on both the Edgeless and Page.\n1. Local first in spite of Cloud: We embrace the convenience of cloud collaboration, while also preserving the user experience of a local product with our 'Local First' direction. Even if you're offline, you can still use most AFFiNE features and when you're back online, all your changes will sync across devices.\n#### **Benefits of Downhill Version:**\n\nAs for the Downhill version, it brings the power of AFFiNE Cloud with collaborative capabilities. It supports Google account login, allows you to create and share Workspaces with others, supports public sharing, and Block Editor with advanced editing features like Slash Commands, Drag Handles and Code Blocks.\n\n#### **Unique Features:**\n\nOur Block Editor is as easy or as complex as you want it to be. We designed the Block Hub for AFFiNE, so you can drag and drop to insert blocks just like playing with Lego, and then use the mouse to easily adjust the blocks with AFFiNE's Formatting Quick Bar and Drag Handle. Alternatively, you can also do it all with just the keyboard. AFFiNE's Slash Commands can not only insert blocks, but also perform copy, delete, and insert date and time operations.\n\n#### **Conclusion:**\n\nThat's all for my sharing today! AFFiNE is committed to meeting the needs of its users while also providing innovative and unique features. I look forward to discussing AFFiNE further with all of you in our community.\n\n",
  "publish": true
}