{
  "id": "9a618abcb86d434d9fe2cea4700a6c16",
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/UaRctpmhNdm3MrILdJgPqzxgiOAs9FH4y6tsMnYTVJ0=",
  "coverAlt": "",
  "md": "# Faq about Downhills\n\n\n## 1) Login&logout\n\n\n1. There's infinite loading when I get into the app (asked by our user: **Alessio from Discord**)\n\n\n* We believe this bug is fixed in the latest version of Downhills, but if it comes out again, you may:\n\n\n  * Press `Ctrl + Shift + n` in Windows, Linux, or Chrome OS, to **open up the private browsing window and try it again**.\n\n\n  * Press `Fn + F12` in Windows, Linux, or Chrome OS, to open the developer tool. **Find the application and manually clear site data and try it again**.\n\n\n## 2) Workspace\n\n\n1. Why don't we put the language setting in the settings? Instead, we have to click on the demo workspace and change the language there (asked by our user: **[FR] MooN from Discord**)\n\n\n* Well, we also contemplated this may cause some confusion as well, hence the updated version of Downhills has changed the `Settings` to `Workspace Settings` so as to differentiate the meaning of the personal settings and the workspace settings.\n\n\n* Preceding the update of the Downhills:\n\n\n  * In the current version, the `Settings` is the workspace settings. When you create a new workspace and get into it, `settings` merely refers to that any operations you implemented here will only be valid within this specific workspace.\n\n\n  * The language setting is your personal user setting, it's where you set the language, press your avatar - sign in / sign out options etc.\n\n\n## 3)  Collaboration\n\n\n1. When I click on the button to enable AFFiNE cloud, this button has an endless loading animation. How do I solve this problem? (asked by our user: **Alessio from Discord**)\n\n\n* We believe that we have already fixed this issue, but if it pops up again, you can refresh this page to see if it is doing fine. Please feel free to let us know if it remains endless loading.\n\n\n1. Is it possible to have this synced workspace offline?\n\n\n* We hope to deliver this functionality soon that enables you to transfer the sync workspace to the local one. Unfortunately, you can only transmit data within this workspace to a local one through export and import and delete the synced workspace at the same time given that the new function hasn't come. Sorry for any inconvenience caused by this.\n\n\n## 4)  Invitation\n\n\n1. There's no response after I execute the step of \"invite members\"\n\n\n* You may refresh this page to see if this execution is successfully operated or not. Feel free to approach us if it's still getting stuck on inviting members.\n\n\n1. There's no notification telling me what progress has been made after the invitation step is implemented.\n\n\n* Basically, you may enter into settings, and find the field called `Access level` within the collaboration part. There are respectively two statuses to portray the invitation progress made: pending (waiting to be accepted) and member(already accepted).\n\n\n1. Is the invitation able to revoke if I invited the wrong person?\n\n\n* Yes, you may enter into the collaboration part within settings, and click a button to remove the specific user's permission (either pending or member) from this workspace.\n\n\n## 5)  Publish\n\n\n1. What is the difference between inviting people to collaborate and publishing it publicly? (asked by our user: **Edenilson L.R from Discord**)\n\n\n* Invite people through Gmail: people are free to browse and edit the content with members and owner.\n\n\n* Publish to the web: this means anyone with this link is permitted to read but not able to edit.\n\n\n1. Is it possible to have those specific sensitive pages invalid while keeping others remaining the same readable status in published mode?\n\n\n* We've thought about this scenario, and are going through a series of discussions in relation to this issue. However, you may only prevent sensitive content from leaking out by stopping publishing the whole workspace.\n\n\n## 6) Editor\n\n\n1. What does Slash menu's \"now\" refer to in collaboration?\n\n\n* This \"now\" command inserts the local data based on the client's time settings. So if you entered the `/now` command, it would show your local time now, based on your browser settings and locale.\n\n\n* In addition, the \"now\" time can not be automatically updated, it only showcases the time that you triggered it.\n\n\n1. Why does Slash menu say that it offers the image & file upload option, but it is only image-supported as I open it?\n\n\n* Nice question, currently the Downhills only supports image upload, but we'll work hard on this part to bring the file feature to come to you as soon as possible. I assure you it won't be so long! In addition to this, you are always welcome to submit posts through the GitHub channel, or community channel in terms of what type of files should be soon supported to upload.\n\n\n## 7) Where to give feedback, requests, and recommendations\n\n\nYour feedback and ideas are invaluable to us because this content is designed for you. So, let us know which parts you love, which parts you hate and how we can improve your experience. If you have anything to share, don't hesitate to reach out to us across any of our social channels.\n\n\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n\n\n* Telegram: [https://t.me/affineworkos](https://t.me/affineworkos)\n\n\n* Twitter: [https://twitter.com/AffineOfficial](https://twitter.com/AffineOfficial)\n\n\n* Reddit: [https://www.reddit.com/r/Affine](https://www.reddit.com/r/Affine)\n\n\n* Medium: [https://medium.com/@affineworkos](https://medium.com/@affineworkos)\n\n\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n\n\n\n\n\n",
  "title": "FAQ on AFFiNE Downhills",
  "createDate": 1680147991871,
  "guid": "23287675-aaff-4913-953a-9ab02c110c7f",
  "author": "Jackie Peng",
  "tags": [
    "User Guide"
  ],
  "slug": "faq-about-downhills",
  "description": "Here's an article to have the most frequently asked questions adequately answered. And a few of them are being fixed in the coming updated version.",
  "created": 1676851200000,
  "updated": 1677196800000,
  "layout": "blog",
  "publish": true,
  "authors": [
    "Jackie Peng"
  ],
  "valid": true,
  "relatedBlogIds": [],
  "linkedPageIds": [],
  "relatedBlogs": []
}