{
  "title": "FAQ",
  "authors": [
    "AFFiNE"
  ],
  "tags": [
    "FAQ"
  ],
  "description": null,
  "created": 1696896000000,
  "updated": 1696896000000,
  "layout": "blog",
  "id": "4YCElmT-3D",
  "slug": "faq",
  "cover": "https://insider.affine.pro/api/workspaces/H6vffRmJbCfA-r3kq_36_/blobs/Fruf2CZz56kMNngPfJxJcPZh-vcSmYVfpfpgMexx_Ms=.webp",
  "md": "---\n\ntitle: FAQ\n\nauthor: AFFiNE\n\ntags: FAQ\n\nslug: faq\n\ndescription:\n\ncreated: 2023-10-10\n\nupdated: 2023-10-10\n\nlayout: blog\n\npublish: true\n\n---\n\n\n![Fruf2CZz56kMNngPfJxJcPZh-vcSmYVfpfpgMexx_Ms=](https://insider.affine.pro/api/workspaces/H6vffRmJbCfA-r3kq_36_/blobs/Fruf2CZz56kMNngPfJxJcPZh-vcSmYVfpfpgMexx_Ms=)\n\n\n\n### AFFiNE Cloud\n\n###### Q: When can users anticipate the availability of the free version of AFFiNE Cloud?\n\nA: We are pleased to announce that the Professional edition of AFFiNE Cloud Services will be launching in November. Additionally, our free version of cloud services will also be introduced. If you wish to experience AFFiNE Cloud's services in advance, we cordially invite you to participate in our exclusive \"Early Access Believer Program.\" You can find more information here: [https://affine.pro/blog/affine-cloud-early-access](https://affine.pro/blog/affine-cloud-early-access). If you would like to become an Early Access Believer, you can sponsor us through this channel: [https://community.affine.pro/c/insider-general/](https://community.affine.pro/c/insider-general/). If you have already purchased AFFiNE Cloud, please download version 0.9.0 Beta.\n\n\n\n###### Q: How to access AFFiNE cloud?\n\nA:\n\n* **Log in to Your Email**: After becoming a sponsor, you will receive an email from the AFFiNE team confirming that your email address has been added to the whitelist. You can log in to AFFiNE with this email.\n* **Create Your Cloud Workspace**: You can create a workspace and enable it to a Cloud workspace.\n\n![VA1BZmj4j3uVgfM0lQYXoXYJRvYO89bsa01FpwHpgZg=](https://insider.affine.pro/api/workspaces/H6vffRmJbCfA-r3kq_36_/blobs/VA1BZmj4j3uVgfM0lQYXoXYJRvYO89bsa01FpwHpgZg=)\n\n* **Invite your collaborators**: You can add user emails to the workspace and invite collaborators to work together.\n\n![RFCrZzO0MCUusua-HEbCIbizQamQjtJpskDCRsLL8Kw=](https://insider.affine.pro/api/workspaces/H6vffRmJbCfA-r3kq_36_/blobs/RFCrZzO0MCUusua-HEbCIbizQamQjtJpskDCRsLL8Kw=)\n\n**Detailed Guidelines**: For more detailed instructions or information about the new features or changes in the service, you can refer to the provided link: [https://affine.pro/blog/what-is-new-affine-0922](https://affine.pro/blog/what-is-new-affine-0922)\n\n\n\n###### Q: How can I stay informed about updates regarding AFFiNE Cloud?\n\nA: To receive the latest updates about AFFiNE Cloud, we recommend visiting our official social media platforms:\n\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n* Telegram: [https://t.me/affineworkos](https://t.me/affineworkos)\n* Twitter: [https://twitter.com/AffineOfficial](https://twitter.com/AffineOfficial)\n* Community Forum: [https://community.affine.pro/home](https://community.affine.pro/home)\nBy following or joining us on these platforms, you will have direct access to the most recent information and announcements related to AFFiNE Cloud.\n\n\n\n### Versions, Platforms and Devices\n\n###### Q: What are the differences between the versions (Beta, Stable, and Canary)?\n\nA: Beta: Ideal for testing upcoming features and providing feedback. Not suitable for production, as it's lightly tested.Stable: The most reliable, well-tested version for a smooth experience without crashes or glitches. Usually released 1-2 weeks after beta.Canary: Cutting-edge version with the latest features, released as soon as they're built, but untested.\n\n\n\n###### Q: How should I choose which version to use?\n\nA: We recommend that everyone who wants to explore and experience new features download the Canary version. If you want a more stable experience, please switch to the Stable version.\n\n\n\n###### Q: Does AFFiNE offer a mobile app?\n\nA: While we recognize the significance of mobile applications, our current strategic focus primarily centres around desktop development due to limited resources that could be input and a better experience we wanna deliver to users with a robust foundation and a feature-rich desktop. Mobile app development remains an integral part of our long-term plan We are fully aware of the importance of a comprehensive product ecosystem and will address mobile app development at an appropriate time in the future, ensuring that it seamlessly aligns with our overarching goals and standards.\n\n\n\n###### Q: Can I access AFFiNE through a web browser?\n\nA: Yes, you can access our web version at [https://app.affine.pro/](https://app.affine.pro/). However, for an enhanced and more stable user experience, we strongly recommend downloading our PC client. Our PC client offers several advantages, including improved stability, smoother performance, and access to additional features that may not be available on the web version. This ensures that you have the optimal experience when using our platform.\n\n\n\n### Self-hosting\n\n###### Q: Isn't the Docker image meant for self-hosting? Why is that dependent on the cloud?\n\nA: The Docker image is primarily designed for self-hosting, enabling users to run it on their own servers. Nevertheless, it is built to provide flexibility. Users have the option to configure it to integrate with cloud services if they find it necessary, depending on their specific needs. Regardless of whether you choose to utilize cloud services or host locally, deploying the architecture remains an essential step.\n\n\n\n###### Q: Is the underlying collaboration technology shared between self-hosting and cloud-based solutions?\n\nA: Yes, the underlying collaboration technology is shared between self-hosting and cloud-based solutions. This ensures consistency in features and functionality across different deployment options. Please note that while local peer-to-peer (P2P) collaboration features may not have been developed yet, the core collaboration technology remains consistent across all deployment methods. We anticipate these improvements to be rolled out by the end of this year.\n\n\n\n###### Q: Does AFFiNE provide support for end-to-end encryption?\n\nA: Certainly, AFFiNE extends robust support for end-to-end encryption (E2EE). Our platform prioritizes data security while fostering seamless teamwork within local networks. With AFFiNE, you can confidently leverage E2EE alongside local area network (LAN) collaboration. Moreover, our collaboration framework, based on Conflict-free Replicated Data Types (CRDTs), ensures that real-time collaboration remains unhindered by geographical constraints, network speeds, and even offline usage. We anticipate these improvements to be rolled out by the end of this year.\n\n\n\n### Plug-in\n\n###### Q: Is it possible to build 3rd-party plugins now?\n\nA: The plugin system is currently in its early development phase and can only be accessed within the Canary version. We are actively engaged in the process of this feature, and we anticipate that it will be available by the end of the year. We will begin by developing first-party plugins and progressively integrate plugins such as GitHub and Figma, expected to launch in January 2024. Additionally, we plan to introduce a stable API interface next year, facilitating users in the development of third-party plugins.\n\n\n\n### Operational Guidance\n\n###### Q: How to establish a hierarchical note structure?\n\nA: We do not currently have a hierarchical note structure in place. However, we recognize its significance for collaboration. Therefore, our team is actively working on enhancing the integration of documents and whiteboards, both of which are still in the design phase. We anticipate these improvements to be rolled out by the end of this year.\n\n\n\n###### Q: Is there an option for toggle/outline lists?\n\nA: Regrettably, we currently do not have this feature, despite the repeated requests from our user community. We acknowledge its significance and would like to extend our gratitude to one of our users who has actively contributed towards making the toggle list available. As of now, the toggle feature has been implemented in the main text, but it has not yet been rolled out in the stable version. We kindly ask for your patience as we work towards including it in future updates.\n\n\n\nIf the information provided above does not address your question, please feel free to reach out to us on our community forum, Discord, or Telegram. We look forward to receiving more of your feedback.\n\n* Community: [https://community.affine.pro/home](https://community.affine.pro/home)\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n* Twitter: [https://twitter.com/AffineOfficial](https://twitter.com/AffineOfficial)\n\n\n\n\n\n\n",
  "publish": true
}