{
  "title": "FAQ",
  "authors": [
    "AFFiNE"
  ],
  "tags": [
    "FAQ"
  ],
  "description": "Find answers to essential questions about AFFiNE, including installation guides, organizational tips, synchronization and backup protocols, and a glimpse into forthcoming advancements. Get the information you need to make the most of AFFiNE.",
  "created": 1701907200000,
  "updated": 1712102400000,
  "layout": "blog",
  "id": "a5kGKUXwnC",
  "slug": "faq",
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/XmtDgEwo0m5zLNeeOk1hTYdKIhg6SWdRTRHwSp3MDig=.webp",
  "md": "---\n\ntitle: FAQ\n\nauthor: AFFiNE\n\ntags: FAQ\n\nslug: faq\n\ndescription: \"Find answers to essential questions about AFFiNE, including installation guides, organizational tips, synchronization and backup protocols, and a glimpse into forthcoming advancements. Get the information you need to make the most of AFFiNE.\"\n\ncreated: 2023-12-07\n\nupdated: 2024-04-03\n\nlayout: blog\n\npublish: true\n\n---\n\n\n![XmtDgEwo0m5zLNeeOk1hTYdKIhg6SWdRTRHwSp3MDig=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/XmtDgEwo0m5zLNeeOk1hTYdKIhg6SWdRTRHwSp3MDig=.webp)\n\n# **🤝 Welcome to the AFFiNE FAQ!**\n\n\n\n📚 Our aim is to help you navigate the user-friendly pathways and keep you updated.\n\n📞 If you have any questions about using AFFiNE, don't hesitate to get in touch with us.\n\n💡 We're here to assist you!\n\n\n\n📢  By the way, the chance to become an early access user and explore AFFiNE Cloud is drawing to a close. **Secure your spot now by making a payment through this link:** [https://community.affine.pro/c/insider-general/](https://community.affine.pro/c/insider-general/).\n\n\n\n# 1) **Install and Start**\n\n### **Q: How to install the latest AFFiNE client?**\n\nA: Official download link: [https://affine.pro/download](https://affine.pro/download)\n\n\n\n### **Q: What are the differences between the versions (Beta, Stable, and Canary)?**\n\nA:\n\n**Beta:** Ideal for testing upcoming features and providing feedback. Not suitable for production, as it's lightly tested.\n\n**Stable:** The **most reliable, well-tested version** for a smooth experience without crashes or glitches. Usually released 1-2 weeks after beta.\n\nCanary: Cutting-edge version with the latest features, released as soon as they're built, but untested.\n\n\n\n### **Q: How should I choose which version to use?**\n\nA: We recommend that everyone who wants to explore and experience new features download the Canary version. If you want a more stable experience, please switch to the Stable version.\n\n\n\n### **Q: Does AFFiNE offer a mobile app?**\n\nA: While acknowledging the importance of mobile applications, our current strategic emphasis is on desktop development to optimize resource utilization and enhance the user experience. Mobile app development remains a vital component of our long-term strategy, and it will be addressed in alignment with our broader goals and standards at a suitable time in the future.\n\n\n\n### **Q: Can I access AFFiNE through a web browser?**\n\nA: Yes, you can access our web version at [https://app.affine.pro/](https://app.affine.pro/,) , **but for a better experience, download our PC client.** It offers stability, enhanced performance, and exclusive features for the best platform experience.\n\n\n\n# 2) **Create and Edit**\n\n### **Q: How to switch between Page and Edgeless pages?**\n\nA: By clicking the buttons located at the top of the interface, you can seamlessly transition between various features. This allows you to fully experience the robust capabilities encompassing writing, drawing, and panning all in one.\n\n\n![VIC5DZB4PWzxoY6Zsvgpl3CJdiPEbOFC7Hoa2PP9XVg=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/VIC5DZB4PWzxoY6Zsvgpl3CJdiPEbOFC7Hoa2PP9XVg=.webp)\n\n\n\n### **Q: How to establish a hierarchical note structure?**\n\nA: Presently, our system adopts a page/subpage structure, as depicted in the accompanying diagram, to facilitate a more transparent organization of data. Nonetheless, within our product development team, ongoing discussions are underway to explore additional enhancements for refining data structuring. We are planning to introduce incremental updates in the near future to implement these improvements. If you wish to create a subpage structure similar to the one illustrated, it can be achieved through the use of link pages.\n\n\n![XJmrzXxgMttiu9D-iaFtN-laWvaAI556Q8B67BCz04k=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/XJmrzXxgMttiu9D-iaFtN-laWvaAI556Q8B67BCz04k=.webp)\n\n\n\n### **Q: Is there an option for toggle/outline lists?**\n\nA: Unfortunately, the requested feature is not available at present. We appreciate its importance, but it is not yet available in the stable version. We request your patience as we work towards including it in future updates. The upcoming toggle will look like this:\n\n\n![G2dLnklDsKZEh91ReWWsV7X-xi9hwXxPB4VXrshTWTI=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/G2dLnklDsKZEh91ReWWsV7X-xi9hwXxPB4VXrshTWTI=.webp)\n\n### **Q: How can I delete multiple rows in the database?**\n\nA: To delete multiple rows in the database, **drag and drop the rows** you want to remove, then press '**ESC**' followed by '**Backspace**' to complete the deletion process efficiently.\n\n<video muted autoplay loop preload=\"auto\" playsinline>\n  <source src=\"https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/EAgJZmWomW4wSwiTABfDyxli6zld91Mp623L3uWspqk=\" type=\"video/mp4\" />\n</video>\n\n### **Q: Can I input text inside a shape?**\n\nA: Sure! Add a shape on the whiteboard and double-click to input text. While resizing the shape, text won't automatically adjust, but you can manually modify font size and style.\n\n<video muted autoplay loop preload=\"auto\" playsinline>\n  <source src=\"https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/w_L3aW1IMwMOv_N8RveQhHG8vFlMHizXrp1BjG-F1PM=\" type=\"video/mp4\" />\n</video>\n\n# 3) **Organize and Tags**\n\n### **Q: Does AFFiNE support filtering articles by tag?**\n\nA: Yes. You can click \"All pages\" and find the \"filter\" button on the upper left to filter your articles according to tags, collections or other rules.\n\n  \n![_L1_gl5AjhD34g2xC2LlBAsBaDyoAcPOcWjmGvpdpBs=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/_L1_gl5AjhD34g2xC2LlBAsBaDyoAcPOcWjmGvpdpBs=.webp)\n\n### **Q: How to select multiple pages?**\n\nA: Activate the multiple selection feature by clicking the small checkbox adjacent to the title.\n\n\n![PT4rcTm6raJlAIEL-dwy55uGD8maOtT-gu1ur2hoFb0=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/PT4rcTm6raJlAIEL-dwy55uGD8maOtT-gu1ur2hoFb0=.webp)\n\n### **Q: How to change the layout width of page mode?**\n\nTo modify the layout width, you can either press \"Command+K\" or utilize the search bar. Scroll down or type \"layout\" to locate the option, and then toggle to activate or deactivate the full width layout feature.\n\n\n![i8NP7T2T-4uNeA1jx13BMldFvO0mXcKqtZ5e0i_HrL0=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/i8NP7T2T-4uNeA1jx13BMldFvO0mXcKqtZ5e0i_HrL0=.webp)\n\n\n\n# 4) **Share and Collaborate**\n\n### **Q:** How can I share my page? Is it possible to share my page in edgeless mode?\n\nA: Click on the \"share\" button in the top right corner and switch the mode you want to share.\n\n\n![DgvYA_GPqbIkNjRQHP2ZAk1R5G5bZe3Wk4lxXODKvb8=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/DgvYA_GPqbIkNjRQHP2ZAk1R5G5bZe3Wk4lxXODKvb8=.webp)\n\n\n\n# 5) **Sync and Backup**\n\n### **Q: How to access AFFiNE cloud?**\n\nA:\n\n1. **Log in to Your Email**: After becoming a sponsor, you will receive an email from the AFFiNE team confirming that your email address has been added to the whitelist. You can log in to AFFiNE with this email. Additionally, you have the option to sign in using your Google account.\n\n1. **Create Your Cloud Workspace**: You can create a local workspace and then enable it to a cloud workspace.\n\n  \n![VA1BZmj4j3uVgfM0lQYXoXYJRvYO89bsa01FpwHpgZg=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/VA1BZmj4j3uVgfM0lQYXoXYJRvYO89bsa01FpwHpgZg=.webp)\n\n1. **Invite your collaborators**: You can add user emails to the workspace and invite collaborators to work together.\n\n  \n![RFCrZzO0MCUusua-HEbCIbizQamQjtJpskDCRsLL8Kw=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/RFCrZzO0MCUusua-HEbCIbizQamQjtJpskDCRsLL8Kw=.webp)\n\n**Detailed Guidelines**: For more detailed instructions or information about the new features or changes in the service, you can refer to the provided link: [https://affine.pro/blog/what-is-new-affine-0922](https://affine.pro/blog/what-is-new-affine-0922)\n\n\n\n### **Q: I have invited my collaborator, but why can't users join my cloud workspace?**\n\nA: Currently, Cloud has opened up free access to all users, allowing **Free** users of cloud workspace to have up to **3 collaborators**. **Pro users**, on the other hand, will see an increase in the number of **collaborators to 10 seats**. If you encounter any issues while inviting collaborators, please reach out to us at [https://community.affine.pro/home](https://community.affine.pro/home).\n\n\n\n### **Q: Isn't the Docker image meant for self-hosting?**\n\nA: The Docker image is primarily designed for self-hosting, enabling users to run it on their own servers. Nevertheless, it is built to provide flexibility. Users have the option to configure it to integrate with cloud services if they find it necessary, depending on their specific needs.\n\nOur server image aims at high scalability. It can be started in stand-alone mode without relying on any cloud service, or as a node in a cluster service. Therefore, the server contains the necessary cloud service components. Please refer to our self-hosting guide configures related components: [Self-host AFFiNE](https://docs.affine.pro/docs/self-host-affine).\n\n\n\n### **Q: Is the underlying collaboration technology shared between self-hosting and cloud-based solutions?**\n\nA: Yes, the underlying collaboration technology is shared between self-hosting and cloud-based solutions. This ensures consistency in features and functionality across different deployment options. Please note that while local peer-to-peer (P2P) collaboration features may not have been developed yet, the core collaboration technology remains consistent across all deployment methods. We anticipate these improvements to be rolled out by the end of this year. We expect to support E2EE locally this year. Stay tuned for updates.\n\n\n\n### **Q: Does AFFiNE provide support for end-to-end encryption?**\n\nA: AFFiNE's data synchronization is based on conflict-free replication data type (CRDT) technology, which is naturally compatible with end-to-end encryption (E2EE). CRDT also ensures that real-time collaboration is not hindered by geographical restrictions, network speed, and even offline use. AFFiNE gives priority to data security and hopes to promote seamless teamwork within the local network. We expect support for E2EE to be launched in the near future. Stay tuned for updates.\n\n\n\n### **Q: Where is my page stored?**\n\nA:\n\n### **`app.getPath(name)`**\n\n* `name` string - You can request the following paths by the name:\n\n  * `home` User's home directory.\n\n  * `appData` Per-user application data directory, which by default points to:\n\n    * `%APPDATA%` on Windows\n\n    * `$XDG_CONFIG_HOME` or `~/.config` on Linux\n\n    * `~/Library/Application Support` on macOS\n\n  * `userData` The directory for storing your app's configuration files, whichby default is the `appData` directory appended with your app's name. Byconvention files storing user data should be written to this directory, andit is not recommended to write large files here because some environmentsmay backup this directory to cloud storage.\n\n  * `sessionData` The directory for storing data generated by `Session`, suchas localStorage, cookies, disk cache, downloaded dictionaries, networkstate, devtools files. By default this points to `userData`. Chromium maywrite very large disk cache here, so if your app does not rely on browserstorage like localStorage or cookies to save user data, it is recommendedto set this directory to other locations to avoid polluting the `userData`directory.\n\nYou might want to backup the whole `userData` folder. But still it does not ensure the backup will work in the future version. It is recommended to install the same version when you backup, upgrade to the latest version, and backup again.\n\n\n\n# 6) **Others**\n\n### **Q: Is it possible to build 3rd-party plugins now?**\n\nA: The plugin system is in early development, accessible exclusively within the Canary version. We are actively progressing with this feature and anticipate its availability by year-end. First-party plugins will be developed initially, followed by integration of GitHub and Figma plugins, scheduled for launch in January 2024. We also plan to introduce a stable API interface in the coming year, enabling users to create third-party plugins.\n\n\n\n### **Q: What should I do if I want to delete my account and clear the account information?**\n\nA: Please send「delete account」requirement to privacy-request@toeverything.info (need to include: confirmation of account information to be deleted/permission to delete account information, etc.).\n\n### **Q: How to cancel the subscription?**\n\n1. Open the AFFiNE app\n\n1. Click your name\n\n1. Click Account Settings\n\n1. Scroll to Subscriptions, then click Downgrade\n\n1. Find the Subscription that you want to cancel, then click Downgrade. If there is no downgrade button, the subscription has already been canceled\n\n\n![jCA8SDWJ55W7d2gZZbmM4pQ0LCY9psFeYEy8vObLc8I=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/jCA8SDWJ55W7d2gZZbmM4pQ0LCY9psFeYEy8vObLc8I=.webp)\n\n\n\nIf the information provided above does not address your question, **please feel free to reach out to us on our community forum, Discord, or Telegram**. We look forward to receiving more of your feedback.\n\n* Community: [https://community.affine.pro/home](https://community.affine.pro/home)\n\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n\n* Twitter: [https://twitter.com/AffineOfficial](https://twitter.com/AffineOfficial)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n  \n\n  \n\n  \n\n\n\n\n\n\n\n",
  "publish": true
}