{
  "author": "AFFiNE",
  "authors": [
    "AFFiNE"
  ],
  "createDate": 1723456561417,
  "created": 1723161600000,
  "description": "Study smarter with the Cornell Notes Template, your new best friend in academic success. Suitable for students of all ages and subjects, this template takes the famous Cornell Note-Taking System and makes it simple and easy to use, whether you prefer Google Docs, Word or a PDF.\n\n\nWalk into your next class or meeting with a tool that organizes your thoughts and helps you understand and retain information. The Cornell Notes Template is just that - a structured and efficient way of note taking thathas helped thousands of students and professionals.",
  "guid": "sCGzzgL7ehx7YswYLAozx",
  "id": "sCGzzgL7ehx7YswYLAozx",
  "linkedPageIds": [
    "7z0FJHF_v1VXqrIDg-73Y",
    "mhXkUvwacMxFPXrxlUQEF",
    "_Bpe5IadJPG_MiS7tEJyb",
    "6gOLcAJKsJ",
    "UKFrN2wPYEAlaP_b4_r8m",
    "siVFmLrvI-bKkBlpcemaF"
  ],
  "md": "It was no secret that making a family tree is fun, whether you're a student working on a school project or preparing for a family reunion. Our family tree template has all the features to make this process easy and enjoyable.\n\n\n## How to Make a Family Tree?\n\n\nFirst you need to gather information. Start by documenting yourself and then interview family members to get names, dates and family stories. Collect vital records like birth and death certificates, marriage licenses and family bibles. Organize your findings by grouping people by generations starting with the oldest known ancestors.\n\n\nNext, choose a format for your family tree. You can start with a hand drawn chart for simplicity or use genealogy software like Family Tree Maker or online platforms for a more polished look. Start building the tree by placing the oldest known ancestor at the top or center and branch out to include their descendants. Add names, birth and death dates and marriage details and use lines to connect parents to children and spouses to each other. Verify the information by cross checking records from multiple sources to make sure it's accurate.\n\n\n## What is a Family Tree?\n\n\nA family tree is a diagram that shows the relationships between family members across generations. It starts with a common ancestor and branches out to show their descendants, children, grandchildren etc. Family trees can include names, birth and death dates, marriages and other events. They are used to trace lineage, understand family history and explore genealogy.\n\n\n## Blank Family Tree Templates\n\n\nWe have a range of blank family tree templates for you to customise and build your tree from scratch. Whether you like a simple or more detailed design we have templates to suit. And they're all editable so you can add, remove or modify as you need.\n\n\nWhy You Need Affine's Family Tree Templates\n\n\n### Free and Accessible\n\n\nOne of the best things about our family tree templates is that they're free to download. Available in PDF, Word and Excel formats you can choose the file type that suits you best. So you can access your family tree on any device, anytime.\n\n\nIn addition to digital formats our family tree templates are also printable. So you can create a physical keepsake to share with family members at reunions or display in your home. Printing your family tree allows you to bring your family's history to life in a way that digital files can't.\n\n\n### Editable to Suit You\n\n\nCustomisation is key when creating a family tree. Our templates are fully editable so you have the freedom to change everything to your liking. Change colours, fonts and layouts to match your style or add in specific details that are unique to your family.\n\n\n### Easy to Use\n\n\nWe know how important user friendly is so our family tree template software is designed to be simple and easy to use. Whether you're tech savvy or not you'll find creating a family tree to be a breeze with our easy to follow design and guidance.\n\n\nOur templates are for everyone. Students can use them as an educational tool to learn about genealogy, families can use them to document and celebrate their heritage at reunions. They're a bridge between generations to connect with your roots.\n\n\n|Title|\n|---|\n|[](LinkedPage:mhXkUvwacMxFPXrxlUQEF)<br /><br /><br />|\n|[](LinkedPage:_Bpe5IadJPG_MiS7tEJyb)<br /><br /><br />|\n\n\n",
  "publish": true,
  "relatedBlogIds": [
    "6gOLcAJKsJ",
    "UKFrN2wPYEAlaP_b4_r8m",
    "siVFmLrvI-bKkBlpcemaF"
  ],
  "relatedBlogs": [
    "five-best-open-source-miro-alternatives-2023",
    "top-10-best-free-digital-planner-apps-2023",
    "8-free-printable-vision-board-templates-examples-2023"
  ],
  "slug": "free-and-printable-family-tree-templates",
  "tags": [
    "Family Tree Templates"
  ],
  "template": "LinkedPage:7z0FJHF_v1VXqrIDg-73Y",
  "title": "Free and Printable Family Tree Templates",
  "updated": 1723161600000,
  "updatedDate": 1724912235656,
  "valid": false
}