{
  "title": "New Year Gift - Alpha \"Abbey Wood\"!",
  "authors": [
    "Fangyuan Zheng"
  ],
  "tags": [
    "User Guide"
  ],
  "description": "New features online!",
  "created": 1672358400000,
  "updated": 1672358400000,
  "layout": "blog",
  "id": "c40a1232f69141988a014464478a3443",
  "slug": "happy-new-year-23-affine-alpha-abbey-wood",
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/ML5fJBYNLG3k14cdVkTXrNu-vzCSX9ex1pQiorDlIYw=.webp",
  "md": "---\n\n\ntitle: New Year Gift - Alpha \"Abbey Wood\"!\n\n\nauthor: Fangyuan Zheng\n\n\ntags: User Guide\n\n\nslug: happy-new-year-23-affine-alpha-abbey-wood\n\n\ndescription: New features online!\n\n\ncreated: 2022-12-30\n\n\nupdated: 2022-12-30\n\n\nlayout: blog\n\n\npublish: true\n\n\n---\n\n\n\n![ML5fJBYNLG3k14cdVkTXrNu-vzCSX9ex1pQiorDlIYw=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/ML5fJBYNLG3k14cdVkTXrNu-vzCSX9ex1pQiorDlIYw=.webp)\n\n\n2023 is coming soon! Good luck, good health, good cheer. AFFiNE wishes you a Happy New Year！\n\n\nTime passes so quickly! In 2022, AFFiNE is also growing fast and building strength to move forward. We are also continuously optimizing our products and hope to provide better products and services. Today, in this festive moment, AFFiNE brings you a little gift for the New Year. So please keep an eye out for it!\n\n\nYou've likely already used the newer [AFFiNE Alpha](https://pathfinder.affine.pro/)! And now we've **added even more rich features to help you create and manage your documents**! The first thing we can't wait to share with you is support for editing multiple files. You can now manage your personal file space on your current device from the browser! Then we've also got support for **formatting quick bars, quick search, images, dividers and code blocks to make your editing experience easier and more beautiful.**\n\n\n## Multi-Document Management\n\n\n### Create & Favourite it\n\n\nThis is a fantastic feature compared to the previous version! **All Pages lists all the documents you have created**, and you can manage them here. Before you **manage these documents**, I will show you how to create a page. **In the bottom left-hand corner of the page, you will find the New Page button; click on it to jump to a blank page, then begin editing your new document enter the name of your document to create it.**\n\n\n**Note: The data in your document management space is currently stored in your browser. We will provide an account system to ensure the security of your data in the next version. To prevent the loss of your files, you should export your data regularly and please be aware of where your files are stored when you use them! (Only the current device and browser are currently supported!)**\n\n\n\n![Jl7HVpEHHcIWFbOUc_8mL1utXAKFPsCf2oGrhnG48d8=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/Jl7HVpEHHcIWFbOUc_8mL1utXAKFPsCf2oGrhnG48d8=.webp)\n\n\nAFFiNE also provides a **Favorites list to put your important or frequently used files**. Of course, it is up to you to decide which files you want to move into this space. It is also straightforward to use. You **hover the file** you want to move into the Favorites space, and then an icon will appear after the title. **Click on the icon to see the file moved into the Favorites space.**\n\n\n\n\n\n\n![rmYGvH2cWner6D44m89Kxm4xzt_8sEnnBXRwL9hstMA=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/rmYGvH2cWner6D44m89Kxm4xzt_8sEnnBXRwL9hstMA=.webp)\n\n\n### Delete & restore it\n\n\nIf you want to **delete a document, open the `⋮` shortcut menu** in the document list, and **you can move the paper to the trash by clicking the 'Delete' button**. If you delete a file by mistake, don't worry. The files you delete are first sent to the trash. **You can go to the trash and find the document you have deleted by mistake and restore it!**\n\n\n\n![D-GhRhmtvUeqd9eGotvIIApSmmID5rMCLwuT1dAYYkI=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/D-GhRhmtvUeqd9eGotvIIApSmmID5rMCLwuT1dAYYkI=.webp)\n\n\n## Formatting Quickbar online! Content becomes artistic\n\n\nThe formatting Quickbar allows you to **create richer formatting more conveniently**. When formatting text, **the cursor will select the content to be formatted, and a function bar will appear above the paragraph**, allowing you to choose the function to suit your needs.\n\n\n\n![8EbR6TpTEazm6WSFydTTiQHyawpgkCpCHBRxhZaesUo=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/8EbR6TpTEazm6WSFydTTiQHyawpgkCpCHBRxhZaesUo=.webp)\n\n\n## More features to help with creativity\n\n\n### Quick Search\n\n\nIn this version, we offer you a quick search function. You can see **the 'Quick Search' button in the function list on the left**. When you use this function, **you enter a keyword in the search field, and AFFiNE will automatically search for the presence of that keyword in your article. The search results are then displayed in the list below.**\n\n\n\n![m7XTZjIJhnpnDZ8E5YsG4FFzoo_0M-ydlG8PgWT9t48=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/m7XTZjIJhnpnDZ8E5YsG4FFzoo_0M-ydlG8PgWT9t48=.webp)\n\n\n### Image\n\n\n**You should note that AFFiNE currently only supports the use of copy & paste to insert images into documents. More convenient ways to add images will be refined in a later version.**\n\n\n As shown in the image, when you need to add an image to your article, just **copy the material you have prepared, and you're done**! Some images don't seem to be the right size when you paste them in. At this point, you **click on the image, and then an outer border will appear, drag and drop the frame with your mouse to resize the image at will. And when you hover over the image with your mouse, we provide you with several function buttons for adding captions, copying, downloading, and deleting**, which can also be convenient!\n\n\n\n![f8jdmVCQAtyPbmT0ZvaG3anfOzT0lC-98V1Q6BuEGTg=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/f8jdmVCQAtyPbmT0ZvaG3anfOzT0lC-98V1Q6BuEGTg=.webp)\n\n\n### Divider\n\n\nThe divider is a new feature that helps you format your documents to look more explicit and organized. **You can insert a divider directly using Markdown syntax; a space will call up the divider when you type `***` or `---`. And the divider format will be selected when you move the cursor using the keyboard up, down, left, and right keys after inserting the divider.**\n\n\n**Note: The only way to insert a divider that is currently supported by AFFiNE is via Markdown syntax. The divider use button will be available in the next release.**\n\n\n\n![ywGH40lHiGMgbY1mUE7AUTryJMwfr8098JYx9PFLXfw=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/ywGH40lHiGMgbY1mUE7AUTryJMwfr8098JYx9PFLXfw=.webp)\n\n\n### Code block\n\n\nIn the previous version, AFFiNE only offered you the inline block. We have added the code block in this version, which allows you to present your code blocks in a more independent form in the text, as this display will **distinguish the different function statements with a highlighting style**! We offer you **three insertion methods: Markdown, Shortcut and function buttons**. Whichever insertion method you choose, you have more freedom of choice.\n\n\nThe Markdown syntax for inserting a code block is '``` + Space' and as you can see in the image, the block is successfully inserted! You are free to choose the language of your code, the mouse hover block will appear with the corresponding options. If I were inserting in JavaScript I would choose the 'JavaScript' option.\n\n\n\n![eaZxhgJURVCBfq4UGhksHErdiCuJLwuFitcJ3b7BRIY=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/eaZxhgJURVCBfq4UGhksHErdiCuJLwuFitcJ3b7BRIY=.webp)\n\n\nThere are two other types of insertion that need to be introduced to you. **One is the function button insertion, which is applied by selecting 'Code Block' in the Formatting Quickbar. The other is via the Shortcut, which can be used by 'CMD + Option + C' for Mac users and 'Ctrl + Alt + C' for Windows users to activate the code block style.**\n\n\n\n![VALKmGHe0Gfvj-i6jdNfVHHM0X8jdGOa61526EQfBGs=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/VALKmGHe0Gfvj-i6jdNfVHHM0X8jdGOa61526EQfBGs=.webp)\n\n\nWhen you edit your code in a code block, you may be confused. How can I jump out of the code block style? Don't worry! We've set up a convenient way for you to switch! **All you need to do is enter your mouse twice, and the cursor will jump out of the code block.**\n\n\n\n![cD54ST_5itKqo1uw_OpVwwoNZbganGJk5ZlENN5vhb4=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/cD54ST_5itKqo1uw_OpVwwoNZbganGJk5ZlENN5vhb4=.webp)\n\n\n### Import Markdown\n\n\nSupport for importing Markdown is also now live. As you can see in the picture below, you can **find the 'Import' button. Then click it, and a pop-up box will appear on your screen. Upload the markdown file you need to import.**\n\n\n\n![hdbCwfg3dVwrG7MFuPyZCQTuiXOqqgZ0dOB9eJdgjBA=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/hdbCwfg3dVwrG7MFuPyZCQTuiXOqqgZ0dOB9eJdgjBA=.webp)\n\n\n**Notes:** We have added **image and code block import support** in this version. When importing images through Markdown, bear in mind that the Markdown import currently **only supports a reference to an image - so if you have any issues, you may try manually copying any images into your document**. Please feel free to contact us if you are still not sure about this part.\n\n\nFor the **import of HTML**, which many of you are interested in, **we have put this project on our task list.** This feature will be published in the near future. Welcome to contact us in our community to discuss this part if you would like to talk to us more about importing HTML.\n\n\n\n![G4j6t9XH7z4cESZ2ixlSs7xXMdaQyIs15NHGgfVkuEs=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/G4j6t9XH7z4cESZ2ixlSs7xXMdaQyIs15NHGgfVkuEs=.webp)\n\n\n### Export Markdown & HTML\n\n\nWe have also provided an export portal for you to export Markdown and HTML files. The entry point for **this function can be found in the 'setting' menu in the top right corner. **\n\n\n**Notes: We're not supporting export of images now. For this question, we'll take into account the task list when we publish the personal space, and we will use TextBundle to package your files for easier management of your data.**\n\n\n\n![TCHD3iTO2qaBhMDKIVXISEY3WkCNG4S0cqFrM_2fgJs=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/TCHD3iTO2qaBhMDKIVXISEY3WkCNG4S0cqFrM_2fgJs=.webp)\n\n\n### Conclusion\n\n\nThat's all the new features we've added in this released version! Thank you for your patience, and we invite you to head over to the AFFiNE Alpha and try them out for yourself! 😃\n\n\nWe have some more good news to share with you today 👏! **Our next release (AFFiNE Cloud) will be available to you soon**, and you'll be wondering what we'll be bringing online in the next release! **Sharing/collaboration/workspace management has been the focus of AFFiNE's recent developments**, so we hope to bring back the following features in the next version.\n\n\n* Permission and collaboration\n\n\n* Multi-terminal synchronization\n\n\n* Personal and public workspace\n\n\n* More ways to share pages\n\n\nIf you would like to participate in the beta test or share your ideas about the AFFiNE cloud with us, head over to **[our community](https://community.affine.pro/c/build-in-public/) to discuss** the features of our new release. We have a dedicated 'Build in Public' channel to make our development progress available to the public! **Check out the [Ambassador General](https://community.affine.pro/c/ambassador-general/) channel for more information on how to get involved with Affine cloud!**\n\n\n\n![dIwBGFajL1pWWfEAbYunJS2S-ZqBPVSFMZLMwxLQZBQ=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/dIwBGFajL1pWWfEAbYunJS2S-ZqBPVSFMZLMwxLQZBQ=.webp)\n\n\nFinally, **next week we will release the current version of the Docker image to help you better localize your deployment and run AFFiNE**. Any questions, please feel free to contact us!\n\n\nAFFiNE is always committed to helping and creating a thriving open-source ecosystem, and we welcome your continued suggestions and feedback.\n\n\nSo, may **AFFiNE** continue to be with you in 2023 as well.\n\n\n**HAPPY NEW YEAR, 2023！**\n\n\nHere are the official media accounts operated by AFFiNE, thank you for your interest.\n\n\nPlease feel free to contact us if you have any questions. It'll be our honor.\n\n\nHope you have a nice day!\n\n\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n\n\n* Telegram: [https://t.me/affineworkos](https://t.me/affineworkos)\n\n\n* Twitter: [https://twitter.com/AffineOfficial](https://twitter.com/AffineOfficial)\n\n\n* Reddit: [https://www.reddit.com/r/Affine](https://www.reddit.com/r/Affine)\n\n\n* Medium: [https://medium.com/@affineworkos](https://medium.com/@affineworkos)\n\n\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n\n\n* AFFiNE Community: [https://community.affine.pro/home](https://community.affine.pro/home)\n\n\n",
  "publish": true
}