{
  "title": "Unleash Your Creativity: Join Our Exciting Edgeless(Whiteboard) Design Contest",
  "authors": [
    "Jackie Peng"
  ],
  "tags": [
    "Webinars"
  ],
  "description": "AFFiNE is the alternative of Notion, Miro, and Monday, this article introduces what’s new, and what updates, Improvements, and bug fixes have been released in the Stable version.",
  "created": 1685577600000,
  "updated": 1685664000000,
  "layout": "blog",
  "id": "H7M-OqQnHY",
  "slug": "join-edgeless-design-contest",
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/fjGLDAaaMUhLAlWKBOXKaBeSOHHoU4T83wzs-EdelLo=",
  "md": "---\n\n\ntitle: \"Unleash Your Creativity: Join Our Exciting Edgeless(Whiteboard) Design Contest\"\n\n\nauthor: Jackie Peng\n\n\ntags: Webinars\n\n\nslug: join-edgeless-design-contest\n\n\ndescription: AFFiNE is the alternative of Notion, Miro, and Monday, this article introduces what’s new, and what updates, Improvements, and bug fixes have been released in the Stable version.\n\n\ncreated: 2023-06-01\n\n\nupdated: 2023-06-02\n\n\nlayout: blog\n\n\npublish: true\n\n\n---\n\n\n\n![fjGLDAaaMUhLAlWKBOXKaBeSOHHoU4T83wzs-EdelLo=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/fjGLDAaaMUhLAlWKBOXKaBeSOHHoU4T83wzs-EdelLo=)\n\n\n## Introduction:\n\n\nAre you passionate about drawing and looking for an opportunity to showcase your artistic talent? Look no further! We are thrilled to announce our edgeless(whiteboard) drawing competition is here, where participants can let their creativity flow and compete for fantastic prizes. In this article, we will provide you with all the essential details, participation criteria, and a clear structure of the competition.\n\n\n## Competition Timeline:\n\n\nGet ready for an exhilarating journey through our edgeless(whiteboard) drawing competition:\n\n\n* Competition Start: June 5th, 2023\n\n\n* Submissions Deadline: June 16th, 2023\n\n\n* Voting Period: June 19th - June 25th, 2023\n\n\n* Winners Announcement: June 27th, 2023\n\n\n## Prize you may wanna know\n\n\nNow, let's talk about the cherry on top: the cash prizes! We want to make this contest worthwhile for our talented participants. Here's what you can win as our logo superheroes:\n\n\n* First Place: 100$USD\n\n\n* Second place - 2 places: 50$USD\n\n\n* Remaining four finalists: 25$USD each\n\n\nTo ensure fairness, our incredible team members participating in the contest for fun won't be eligible for any prizes. We believe in creating a level playing field for everyone!\n\n\n## **Participation Criteria:**\n\n\nTo ensure fair participation in the AFFiNE whiteboard drawing contest and prevent cheating, we have established the following criteria:\n\n\n1. Real-Time Participation: Participants are required to create their drawings directly on the AFFiNE whiteboard during the contest period. This ensures that all submissions are original and created specifically for the competition.\n\n\n1. Prohibit External Whiteboards: It is strictly prohibited for participants to use or reference any other whiteboard software or tools during the contest. This ensures a level playing field and encourages participants to fully utilize the features and capabilities of the AFFiNE whiteboard.\n\n\n1. Disable Copy and Paste: To maintain the integrity of the competition, we have modified the AFFiNE whiteboard to disable the copy and paste feature. This prevents participants from copying existing artwork or elements into their submissions.\n\n\n1. Watermark Requirement: In order to identify original submissions, participants are asked to include a visible watermark in their drawings. This helps maintain authenticity and prevents the unauthorized use of artwork.\n\n\n1. Parental Permission for Participants under 16: Participants who are under the age of 16 will need to obtain basic permission from their parents or guardians to participate in the contest. We value the safety and well-being of all participants and want to ensure appropriate consent is obtained for underage participants.\n\n\n## Where to apply it?\n\n\nThe application process requires not only your basic information but also a rigorous adherence to the criteria, including the mandatory upload of your artwork through the provided Typeform.\n\n\n**Here's the link you can apply for once you finished your work:** [Click here to apply](https://6dxre9ihosp.typeform.com/to/h1MC1hJG)\n\n\n## **Following our Channels👇**\n\n\n* Official Website: [https://affine.pro/](https://affine.pro/)\n\n\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n\n\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n\n\n* Telegram: [https://t.me/affineworkos](https://t.me/affineworkos)\n\n\n",
  "publish": true
}