{
  "title": "Let’s celebrate 10,000+ stars on GitHub together!",
  "authors": [
    "Fangyuan Zheng",
    "Christopher Smolak"
  ],
  "tags": [
    "The Open Source Engineering"
  ],
  "description": "Together we celebrate the milestone of reaching 10,000 stars over on the AFFiNE GitHub.",
  "created": 1664236800000,
  "updated": 1664236800000,
  "layout": "blog",
  "id": "6ec6d382e6f344bfb347329806b003ab",
  "slug": "let-celebrate-10000-stars-on-github-together",
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/_3Ch_AnCnlQkxHXqi_cp-yYHgARivQo6hBILma3rkNg=.webp",
  "md": "---\n\ntitle: Let’s celebrate 10,000+ stars on GitHub together!\n\nauthor: Fangyuan Zheng, Christopher Smolak\n\ntags: The Open Source Engineering\n\nslug: let-celebrate-10000-stars-on-github-together\n\ndescription: Together we celebrate the milestone of reaching 10,000 stars over on the AFFiNE GitHub.\n\ncreated: 2022-09-27\n\nupdated: 2022-09-27\n\nlayout: blog\n\npublish: true\n\n---\n\n\n![_3Ch_AnCnlQkxHXqi_cp-yYHgARivQo6hBILma3rkNg=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/_3Ch_AnCnlQkxHXqi_cp-yYHgARivQo6hBILma3rkNg=.webp)\n\n# Together we celebrate the milestone of reaching 10,000 stars over on the AFFiNE GitHub.\n\nThis is an achievement reached thanks to the whole of our community. Each new issue, discussion, feature request, article... Our community has shown us great love and its thanks to each one of you that we have managed to achieve this, together. We are so lucky to build this open-source project with such a **great and engaged community** supporting us.\n\n\n![_3Ch_AnCnlQkxHXqi_cp-yYHgARivQo6hBILma3rkNg=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/_3Ch_AnCnlQkxHXqi_cp-yYHgARivQo6hBILma3rkNg=.webp)\n\n## What’s next?\n\n### Community\n\nWell, we hope that 10,000 stars is just the beginning. We remain committed to supporting AFFiNE as an open-source product and continue to engage with and grow our community to help strengthen the project. As AFFiNE grows, it becomes increasingly more important that we ensure we remain committed and in contact with our community. That’s why we plan to continue to grow and expand our AFFiNE Ambassador program.\n\n### Ambassadors\n\nThe ambassador program is for developers, translators, KOLs and more - for people who are passionate about AFFiNE and want to contribute further. From meetings with AFFiNE, to early access to features, releases and much more!\n\nEveryone is welcome to learn more and apply for the [ambassador program](https://docs.affine.pro/affine/affine-ambassadors/welcome). And learn more about and apply to help with [internationalization program](https://docs.affine.pro/affine/internationalization/welcome).\n\nWe are now particularly looking for community members to become leaders. Maybe you’d like to lead a continent team, a language team, a documentation group. There are lots of ways for you to get involved and learn together with our team and other passionate members of the community.\n\n## AFFiNE\n\nFrom the early releases of AFFiNE the project has changed significantly, and there are some major improvements coming up. We’ve listened to lots of ideas and feedback, and we continue to try our best to ensure we release a project that everyone can use and benefit from. And if you’ve tried our live demo you’ll have noticed there are quite a lot of features and functions available.\n\nHowever, we are not happy, with the code at least... That’s why we are performing a major refactor of the code, essentially a complete re-write from the bottom up. But why? And what does this mean for you?\n\nFor the users of AFFiNE, we can summarize this in two words - **new and improved**. We have completely rewrote the editor engines. The new AFFiNE will be run on **Virgo2 and Phasor** - which will deliver a universal user experience throughout edgeless, paper and other coming editing modes with production-ready stability. The initial releases will be more barebones and more limited in functionality but with significant improvements in stability and performance. This also gives us a chance to re-consider the current implementation of AFFiNE and how we can provide a better all-round user experience, from the tools we support to the UI design.\n\nIn the first release we anticipate offering a newly developed editor with full markdown support. Our **backend collaborative database JWST** has also gone through a major refactor to bring local-first editing and native support for collaboration, not only on the application level but also on the components level. We will release more demos and introductions on that part later.\n\nThis also means that **the current live demo development will be slower as we prioritize the new re-developed version.** We do, however still strongly value your input and continue to welcome your feedback over on our feedback platform. Whether you have a feature request or a bug report, do let us know. It’s because of these suggestions and discussions that we are able to continually improve and build AFFiNE.\n\n## Thanks again to everyone\n\nAnd once again a big thank you to our community. Please do come and join us, whether you have questions, feedback, would like to start a discussion, or even just to listen and see what we are doing. You are very much invited to come and join us.\n\n",
  "publish": true
}