{
  "title": "Achieving a Local-First, Privacy-Centric User Experience with AFFiNE's Offline Capabilities",
  "authors": [
    "Joe Hou"
  ],
  "tags": [
    "The Open Source Engineering"
  ],
  "description": "How we aim to achieve a local-first, privacy-focussed experience with AFFiNE.",
  "created": 1679011200000,
  "updated": 1679011200000,
  "layout": "blog",
  "id": "OVREW0v7E-",
  "slug": "local-first-privacy-focussed-affine-offline",
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/yMruwKIzMGZ8EJtZjT4FqO-JqfEdUMyP50AZmgG7hgg=",
  "md": "---\n\n\ntitle: Achieving a Local-First, Privacy-Centric User Experience with AFFiNE's Offline Capabilities\n\n\nauthor: Joe Hou\n\n\ntags: The Open Source Engineering\n\n\nslug: local-first-privacy-focussed-affine-offline\n\n\ndescription: How we aim to achieve a local-first, privacy-focussed experience with AFFiNE.\n\n\ncreated: 2023-03-17\n\n\nupdated: 2023-03-17\n\n\nlayout: blog\n\n\npublish: true\n\n\n---\n\n\n\n![yMruwKIzMGZ8EJtZjT4FqO-JqfEdUMyP50AZmgG7hgg=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/yMruwKIzMGZ8EJtZjT4FqO-JqfEdUMyP50AZmgG7hgg=)\n\n\nAt AFFiNE, we embrace the **local-first philosophy** and strive to provide a seamless user experience that combines the benefits of cloud collaboration while still staying true to our privacy-focussed roots and our commitment to offline support. Our aim is to achieve a truly local-first experience, which will be achievd through several stages. At each step we retain a strong focus on privacy and user control. By prioritising \"privacy\", \"local-first\", and \"offline\", we hope to offer users a better choice to keep control of their data in a secure way,\n\n\n## Stages Towards Comprehensive Offline Support\n\n\nWe've devised a three-stage plan to attain our goal of a fully offline-capable user experience:\n\n\n\n\n\n**First stage**: Facilitating local use of AFFiNE. The choice to enable AFFiNE Cloud and the powerful benefits that come with it.\n\n\n  * Keep your data on your local device, ensuring complete privacy and offline access\n\n\n  * Choose whether to sync your data with the AFFiNE Cloud, based on your preferences and needs\n\n\n  * Experience an optimised user experience, whether or not you enable AFFiNE Cloud\n\n\n  \n\n\n**Second stage**: Enable real-time cross-device data synchronisation within a local network. Removing the dependency of the AFFiNE Cloud service.\n\n\n  * Increased privacy, as data remains within your local network, eliminating the need to share data with external cloud services\n\n\n  * Enhanced control over data sharing and access, restricting data synchronisation to  devices within your network\n\n\n  * Seamless collaboration and data access across devices, while keeping your data local and secure\n\n\n  \n\n\n**Third stage**: Provide cross-account collaboration within a local network, incorporating server-side support and an optional cloud provider.\n\n\n  * Greater flexibility, allowing you to choose between hosting your own data or using a cloud provider based on your requirements and preferences\n\n\n  * Enhanced security and privacy, thanks to server-side support\n\n\n  * Smooth collaboration between different accounts, all while keeping data securely within the local network or a chosen cloud provider.\n\n\n## File-Level Data Control for Enhanced Flexibility\n\n\nTo empower you with flexibility and control over your data, AFFiNE allows you to choose where to store your workspace as a single file. The workspace file serves as a backup and can be directly accessed on any AFFiNE client, enabling you to effortlessly switch between devices.\n\n\nWe know that users have varying preferences for content management formats, so we plan to support multiple import and export formats. This includes exporting entire workspaces and page content, ensuring seamless data transfer to and from other applications or services, regardless of the format.\n\n\n## Prioritising Privacy with Additional Security Measures\n\n\nPrivacy is paramount at AFFiNE. We provide you with the option to enable or disable AFFiNE Cloud when creating a new workspace, respecting your decision to keep your data strictly offline if desired.\n\n\nWe remain committed to offering continuous support and enhancements for self-hosting AFFiNE, ensuring users who prefer to host their own data have the necessary resources at their disposal.\n\n\nMoreover, in the longer term, we also plan to implement encryption to bolster privacy further. This guarantees that you can trust in the safety and security of your data when using AFFiNE.\n\n\nIn summary, AFFiNE prioritises protecting your privacy by granting you control over your data while simultaneously delivering a seamless, local-first experience. With our commitment to offline support and privacy, you can trust AFFiNE to meet your unique needs and preferences.\n\n\n",
  "publish": true
}