{
  "author": "Christopher Smolak",
  "authors": [
    "Christopher Smolak"
  ],
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/nqMOMe5twXJ0m6E8Jwcm1f2Kjl--XzITMHbw42TW56M=",
  "coverAlt": "",
  "createDate": 1680147991871,
  "created": 1676851200000,
  "description": "A big step forward for AFFiNE",
  "guid": "45990dff-707a-40ae-8344-364d57bf7623",
  "id": "67aa3711d2654fd78d9cb5751bf718dd",
  "layout": "blog",
  "linkedPageIds": [
  ],
  "md": "As you may have noticed our latest release, AFFiNE Downhills, introduces a new address - [app.affine.pro](https://app.affine.pro). We've done this for several reasons, and will explore them in this article. Also, with this change we will begin retiring old addresses - so it's vital you transfer/backup your content to avoid any data loss if you have previously relied on the [pathfinder.affine.pro](https://pathfinder.affine.pro) demo.\n\n\n## Why we made the move\n\n\nWe are constantly improving AFFiNE to provide the best possible experience for our users. So now, with the latest release of Downhills we believe that our product has evolved to what we feel is a truly usable state. Hence, we have made the decision to setup and use the address: [app.affine.pro](https://app.affine.pro). This is the new home of the latest AFFiNE demo and we will begin to retire the old demos. It is a big step forward for us and our product, as well as our community.\n\n\nMoving to this new address also also us to better configure and support the upcoming mobile and desktop clients we are developing. We can ensure that our product remain up-to-date for all of our users and provide the best experience across all devices and platforms with the latest features.\n\n\nWe were also concernde about the new workspace collaboration and multiplayer experience for our users. If you are sharing and publishing your workspaces, we don't want those links to break. So with this update we do not anticipate breaking changes to URLs and links so you will be able to continue to use the product without worry.\n\n\nIt shows how far AFFiNE has come from technical previews and live demos to a product that we have begin to use internally thorughout our workflows. It will be exciting to see how others begin to use and integrate AFFiNE too.\n\n\n## What about my data?\n\n\nIn the latest [AFFiNE App (https://app.affine.pro)](https://app.affine.pro) you have more choices for your data. If you use a local workspace you should regularly export and/or save your data. Local workspaces rely on storage from your browser - so if you wipe your browser data you may lose all your workspaces and content. But that's where AFFiNE Cloud comes in.\n\n\nWith AFFiNE Cloud functionality enabled your workspaces can be synced to the cloud and so even if you change your device. or clear your browser data, you can just sign in to your account and sync the data onto your device.\n\n\nPlease do remember we are in active development, and still in Alpha. We do not anticipate any breaking changes that would cause data loss but it's good practice to have a backup strategy for your important data, such as the 3-2-1-1 rule:\n\n\n* Keep at least **three (3)** copies of your data.\n\n\n* Store **two (2)** backup copies on different storage media.\n\n\n* Store **one (1)** copy offsite.\n\n\n* Create **one (1)** immutable or air-gapped backup copy.\n\n\n### Pathfinder\n\n\nAn important announcement is the [pathfinder.affine.pro](https://pathfinder.affine.pro) address is being retired on 28th February. The new app address replaces this one, and builds upon the previous release. So after this date you will no longer be able to access this old version of AFFiNE. We have kept this version up to give you time to transfer your data, as any browser-stored data would be lost in the transfer to the latest app address. Simply use the export function to export your content as HTML or Markdown and save these to your local device. You could also copy and paste your data as required, to your new workspace over on [app.affine.pro](https://app.affine.pro).\n\n\n\n![xMybG0-f3IcmSIr72rEkPVu9nf1zCYBEm_QRitdNs3I=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/xMybG0-f3IcmSIr72rEkPVu9nf1zCYBEm_QRitdNs3I=)\n\n\n## Conclusion\n\n\nMoving to the new [app.affine.pro](https://app.affine.pro) address is a big step forward for AFFiNE and its development. We are excited about the future of our product and the community. If there are any changes you are unsure of, other other questions you have do not hesitate to reach out to us. We look forward to continuing to serve our community and prove the best possible experience to all of our users.\n\n\n* AFFiNE Community: [https://community.affine.pro/home](https://community.affine.pro/home)\n\n\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n\n\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n\n\n* Telegram: [https://t.me/affineworkos](https://t.me/affineworkos)\n\n\n* Twitter: [https://twitter.com/AffineOfficial](https://twitter.com/AffineOfficial)\n\n\n* Reddit: [https://www.reddit.com/r/Affine](https://www.reddit.com/r/Affine)\n\n\n* Medium: [https://medium.com/@affineworkos](https://medium.com/@affineworkos)\n\n\n",
  "publish": true,
  "relatedBlogIds": [
  ],
  "relatedBlogs": [
  ],
  "slug": "moving-to-app-affine-pro",
  "tags": [
    "User Guide"
  ],
  "title": "Moving to app.affine.pro",
  "updated": 1676851200000,
  "valid": true
}