{
  "title": "Goodbye to Docker, Hello to the New Offline Client",
  "authors": [
    "AFFiNE"
  ],
  "tags": [
    "Release Events"
  ],
  "description": "AFFINE Downhills Introduces New Design System for Improved Visual Experience",
  "created": 1680480000000,
  "updated": 1680480000000,
  "layout": "blog",
  "id": "fRLv0qec1w",
  "slug": "new-offline-client",
  "cover": null,
  "md": "---\n\ntitle: Goodbye to Docker, Hello to the New Offline Client\n\nauthor: AFFiNE\n\ntags: Release Events\n\nslug: new-offline-client\n\ndescription: AFFINE Downhills Introduces New Design System for Improved Visual Experience\n\ncreated: 2023-04-03\n\nupdated: 2023-04-03\n\nlayout: blog\n\npublish: false\n\n---\n\n\n\n## Say Goodbye to Docker, Hello to the New Offline Client\n\nIn today's fast-paced digital world, the ability to create and edit content offline is more important than ever. Whether you're traveling, experiencing internet connectivity issues, or simply prefer working without distractions, an offline client is a must-have tool for content creators and editors.\n\nNow we are working hard on providing a new offline client that will replace the previous Docker and provide users with a more reliable and efficient way to work offline. The new client boasts an intuitive and user-friendly interface, seamless offline functionality, and the ability to easily sync data across multiple platforms when connected to AFFiNE Cloud.\n\nSo, say goodbye to Docker and hello to the new offline client – let's get started!\n\n\n---\n\n## The Limitations of Docker\n\nWhile Docker served as a self-host solution for many of our users, it came with its own set of limitations. Whether that has been the need for an internet connection to install and run Docker or the This requirement often proved to be a challenge for users who needed to work in areas with limited or no internet connectivity.\n\nMoreover, Docker had potential security concerns, which was a cause for worry for many users. Some users were hesitant to install and use Docker due to concerns over data privacy and security. This concern was not entirely unfounded, as Docker has had security vulnerabilities in the past.\n\nLastly, Docker could sometimes have compatibility issues with certain operating systems or hardware configurations. This made it challenging for some users to install and use Docker, resulting in a less than optimal experience for them.\n\nGiven these limitations, [Company Name] decided to invest in developing a new offline client that would address these issues and provide users with a more reliable and efficient offline solution.\n\n\n---\n\n## The New Offline Client: A Better Solution\n\n[Company Name] has been working on developing an offline client that will address the limitations of Docker and provide users with a better offline solution. This new client will be available as an app and will offer several advantages over Docker.\n\nFirstly, the new offline client will work seamlessly without an internet connection. Users can create, edit, and manage their data without worrying about internet connectivity. This feature is particularly useful for users who work in areas with limited or no internet connectivity.\n\nMoreover, the new offline client will be more secure than Docker. It will feature enhanced security measures that will protect user data from potential threats. The new client will ensure that user data is kept safe and secure, even when working offline.\n\nFinally, the new offline client will be more compatible with various operating systems and hardware configurations. This will ensure that users can easily install and use the app without any issues.\n\nIn summary, the new offline client will offer a more reliable, secure, and efficient solution for [Company Name] users who require an offline mode. With this new client, users can work without internet connectivity, keep their data secure, and enjoy a hassle-free experience, all while creating and managing their data in the familiar [Company Name] environment.\n\n\n---\n\n## Conclusion\n\nIn conclusion, the new offline client is an exciting development for AFFiNE users who were previously reliant on Docker for offline use. With the new client, users can now create and edit their data without an internet connection and sync their work across multiple platforms with AFFiNE Cloud.\n\nWe encourage all users to try out the new offline client and provide feedback to help us improve the product. Thank you for your support and for being part of our journey to create a better collaborative knowledge base solution.\n\n\n\n\n\n",
  "publish": false,
  "order": 44
}