{
  "author": "Allen",
  "authors": [
    "Allen"
  ],
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/ERHE2cF81ygiybjTJAmc0Si72GoBVPmkjmVO_uUecRo=",
  "coverAlt": "Notion vs Wolai",
  "createDate": 1728386395824,
  "created": 1728259200000,
  "description": "In today's fast-paced digital world, productivity tools have become essential for individuals and businesses alike. These all-in-one workspace solutions promise to streamline workflows, enhance collaboration, and boost efficiency. Among the myriad options available, Notion and Wolai have emerged as popular choices, each offering a unique blend of features to cater to diverse productivity needs.",
  "guid": "XwS6pPLzreqg9WsJqHhmH",
  "id": "XwS6pPLzreqg9WsJqHhmH",
  "layout": "blog",
  "linkedPageIds": [
    "RYQGPFyCRaTw0Ue_RnTVi",
    "DNedfjBsMABQC1zMZlHsC",
    "dH_dq8pJiQ"
  ],
  "md": "In today's fast-paced digital world, productivity tools have become essential for individuals and businesses alike. These all-in-one workspace solutions promise to streamline workflows, enhance collaboration, and boost efficiency. Among the myriad options available, Notion and Wolai have emerged as popular choices, each offering a unique blend of features to cater to diverse productivity needs.\n\n\nNotion, launched in 2016, quickly gained traction as a versatile workspace that combines note-taking, project management, and collaboration tools. Its flexibility and customization options have made it a favorite among startups, creatives, and knowledge workers. On the other hand, Wolai, often dubbed the \"Chinese Notion,\" has been making waves since its debut in 2020. It offers similar functionality to Notion but with some distinct features tailored for the Asian market and beyond.\n\n\nWhile both Notion and Wolai have their strengths, the productivity tool landscape is ever-evolving. Enter AFFiNE, a promising alternative that aims to address some of the limitations of existing solutions. AFFiNE offers a fresh approach to workspace management, combining the best aspects of its predecessors with innovative features designed for the modern user. As we delve into the comparison between Notion and Wolai, we'll also explore how AFFiNE stands out in this competitive field, potentially offering a more tailored solution for your productivity needs.\n\n\n## Overview of Notion\n\n\n<img\n  src=\"https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/jlpyunCK1jiZDPSvaW_1NjF3dTcqSgFLd3Hm09OZf8I=\"\n  alt=\"Notion\"\n  width=\"auto\"\n  height=\"auto\"\n/>\nNotion has firmly positioned itself as a versatile, all-in-one workspace solution, seamlessly integrating note-taking,task management,database organization, and collaboration toolsinto a unified platform. Its flexible, modular design allows users to create personalized workflows, whether for individual productivity, team collaboration, or project management.\n\n\nNotion appeals to a broad audience, from students and freelancers to startups and large organizations, thanks to its highly adaptable structure that suits various needs. Its pricing model is equally flexible, offering a free tier with ample functionality for individual users, alongside premium options for teams and businesses that require advanced features such as unlimited storage, custom roles, and enhanced support. This blend of flexibility, accessibility, and customizability makes Notion a popular choice for a wide spectrum of users looking for a comprehensive productivity solution.\n\n\n### Key Features\n\n\n* **Flexible Workspaces**: Notion allows users to create customizable pages that can function as documents, wikis, databases, or kanban boards.\n\n\n* **Database Functionality**: Users can create relational databases with various views, including tables, lists, galleries, and calendars.\n\n\n* **Collaborative Tools**: Real-time collaboration features enable team members to work together seamlessly.\n\n\n* **Templates**: A wide array of pre-built templates for various use cases, from project management to personal goal tracking.\n\n\n* **API and Integrations**: Notion offers an API for developers and integrates with numerous third-party tools.\n\n\n### Target Audience\n\n\nNotion caters to a diverse user base, including:\n\n\n* Startups and Small Businesses: For team collaboration and project management.\n\n\n* Freelancers and Creatives: For organizing ideas, projects, and client work.\n\n\n* Students: For note-taking, assignment tracking, and research organization.\n\n\n* Personal Users: For life management, goal setting, and personal knowledge bases.\n\n\n* Product Teams:For product roadmaps, feature planning, and user feedback tracking.\n\n\n### Pricing Model\n\n\nNotion offers a tiered pricing structure:\n\n\n1. Personal: Free for individual use with some limitations.\n\n\n1. Personal Pro: $4/month for unlimited file uploads and version history.\n\n\n1. Team: $8/user/month for collaborative features and advanced permissions.\n\n\n1. Enterprise: Custom pricing for large organizations with advanced security needs.\n\n\nEach tier builds upon the previous one, offering more features and capabilities as the price increases. Notion also offers educational discounts for students and educators.\n\n\n## Overview of Wolai\n\n\n\n\n\nWolai, often referred to as the “Chinese Notion,” has rapidly gained popularity as a comprehensive all-in-one workspace solution, particularly within the Asian market. Its intuitive design combines note-taking, database management, and collaboration tools, making it a powerful alternative to more established platforms like Notion. What sets Wolai apart is itslocalized focus, offering features tailored to the specific needs and preferences of users in the Asian market, such as seamless integration with Chinese apps, localized language support, andreal-time collaborationtools. This has made it especially appealing to businesses and teams in the region seeking a flexible, efficient platform for managing workflows and communication.\n\n\nWolai’s target audience ranges from individuals, such as freelancers and students, to teamsand large enterprises looking for a collaborative space that aligns with regional tech ecosystems. In terms of pricing, Wolai offers a free plan with essential features suitable for personal use, along with premium tiers designed for professionals and organizations that require more advanced capabilities, including enhanced storage, additional team collaboration tools, andpriority support. With its growing popularity and focus on delivering localized, user-centric solutions, Wolai is becoming an increasingly strong competitor in the global productivity tool landscape.\n\n\n### Key Features\n\n\n* Multi-dimensional Tables: Similar to Notion's databases, but with enhanced functionality for complex data management.\n\n\n* AI-powered Writing Assistant: Offers intelligent writing suggestions and auto-completion.\n\n\n* Advanced Formula System: Provides a robust set of formulas for data manipulation and analysis.\n\n\n* Bi-directional Links: Allows for creating connections between different pages and concepts.\n\n\n* Customizable Interfaces: Users can create tailored workspaces with various layouts and themes.\n\n\n* Real-time Collaboration: Supports simultaneous editing and commenting for team projects.\n\n\n### Target Audience\n\n\nWolai targets a range of users, including:\n\n\n* Chinese Enterprises: Tailored features for the Chinese business environment.\n\n\n* International Teams: With multi-language support and localization options.\n\n\n* Knowledge Workers: For personal and professional knowledge management.\n\n\n* Project Managers: Offering tools for task tracking and team coordination.\n\n\n* Educators and Students: For course management and collaborative learning.\n\n\n* Researchers: Providing features for organizing complex information and ideas.\n\n\n### Pricing Model\n\n\nWolai offers a tiered pricing structure:\n\n\n1. Free: Basic features for individual users with limited storage.\n\n\n1. Pro: Approximately $5/month (when billed annually) for advanced features and increased storage.\n\n\n1. Team: Around $8/user/month (when billed annually) for collaborative features and team management tools.\n\n\n1. Enterprise: Custom pricing for large organizations with specific security and integration needs.\n\n\nWolai also offers educational discounts and special packages for non-profit organizations. The pricing is competitive, especially considering the feature set tailored for the Asian market.\n\n\n## Comparison of Notion and Wolai\n\n\n### User Interface and Experience\n\n\n* **Notion**:\n\n\n  * Clean, minimalist design with a focus on simplicity\n\n\n  * Block-based editor for flexible content creation\n\n\n  * Steeper learning curve due to its extensive customization options\n\n\n* **Wolai**:\n\n\n  * Similar block-based structure, but with a slightly more colorful interface\n\n\n  * Designed with Asian users in mind, offering better support for languages like Chinese\n\n\n  * Generally considered more intuitive for new users\n\n\n### Functionality and Features\n\n\n* **Notion**:\n\n\n  * Robust database capabilities with multiple view options\n\n\n  * Strong emphasis on linking and relation between pages and databases\n\n\n  * Extensive template gallery for quick setup\n\n\n* **Wolai**:\n\n\n  * Enhanced formula system for complex calculations\n\n\n  * AI-powered writing assistant for content creation\n\n\n  * Built-in mind mapping tools\n\n\n### Collaboration Capabilities\n\n\n* **Notion**:\n\n\n  * Real-time collaboration with comments and mentions\n\n\n  * Granular permission settings for shared workspaces\n\n\n  * Version history for tracking changes\n\n\n* **Wolai**:\n\n\n  * Similar real-time collaboration features\n\n\n  * Enhanced team-based workspace management\n\n\n  * Built-in task assignment and tracking tools\n\n\n### Integration with Other Tools\n\n\n* **Notion**:\n\n\n  * Wide range of native integrations with popular tools\n\n\n  * API access for custom integrations\n\n\n  * Embed feature for incorporating external content\n\n\n* **Wolai**:\n\n\n  * Fewer native integrations compared to Notion\n\n\n  * API available for developers\n\n\n  * Strong focus on local Chinese app integrations\n\n\n### Customization Options\n\n\n* **Notion**:\n\n\n  * Highly flexible page and database structures\n\n\n  * Custom templates and database views\n\n\n  * Limited design customization (e.g., colors, icons)\n\n\n* **Wolai**:\n\n\n  * Similar flexibility in page and database structures\n\n\n  * More options for visual customization, including themes and layouts\n\n\n  * Custom widgets for enhanced functionality\n\n\n### Mobile App Experience\n\n\n* **Notion**:\n\n\n  * Available on iOS and Android\n\n\n  * Fairly robust, but can be slow with large databases\n\n\n  * Offline access for previously loaded content\n\n\n* **Wolai**:\n\n\n  * Also available on iOS and Android\n\n\n  * Generally faster performance on mobile devices\n\n\n  * Better optimization for Asian language input on mobile\n\n\n### Pricing and Value for Money\n\n\n* **Notion**:\n\n\n  * Competitive pricing with a generous free tier\n\n\n  * Team plan at $8/user/month offers good value for small to medium teams\n\n\n  * Enterprise plan for larger organizations with custom pricing\n\n\n* **Wolai**:\n\n\n  * Similar pricing structure to Notion\n\n\n  * Slightly lower price point for comparable features\n\n\n  * Often considered better value for users in Asian markets due to localization and specific features\n\n\nBoth tools offer strong features and capabilities, with Notion having a more established presence globally, while Wolai provides enhanced functionality for Asian markets and potentially better performance in some areas.\n\n\n## Strengths and Weaknesses\n\n\n### Notion's Pros and Cons\n\n\n#### Pros:\n\n\n1. Versatility: Notion excels in its ability to adapt to various use cases, from personal task management to complex project workflows.\n\n\n1. Robust Database System: The relational database feature is powerful and flexible, allowing for complex data organization.\n\n\n1. Wide Integration Ecosystem: Notion offers a broad range of integrations with popular tools and services.\n\n\n1. Strong Community: A large user base contributes to an extensive library of templates and resources.\n\n\n1. Regular Updates: Notion consistently rolls out new features and improvements based on user feedback.\n\n\n#### Cons:\n\n\n1. Learning Curve: The sheer number of features and customization options can be overwhelming for new users.\n\n\n1. Performance Issues: Large databases or complex pages can sometimes lead to slow loading times.\n\n\n1. Limited Offline Functionality: Notion's offline capabilities are somewhat restricted compared to some competitors.\n\n\n1. Basic Text Editing: The text editor lacks some advanced formatting options found in dedicated word processors.\n\n\n1. Privacy Concerns: Some users have expressed concerns about data privacy and the inability to self-host.\n\n\n### Wolai's Pros and Cons\n\n\n#### Pros:\n\n\n1. Enhanced Formula System: Wolai's formula capabilities are more advanced, allowing for complex calculations and data manipulation.\n\n\n1. AI Writing Assistant: The built-in AI tool can help with content creation and editing.\n\n\n1. Asian Market Focus: Better support for Asian languages and localized features for the Chinese market.\n\n\n1. Performance: Generally faster performance, especially on mobile devices and with large datasets.\n\n\n1. Visual Customization: More options for customizing the look and feel of workspaces.\n\n\n#### Cons:\n\n\n1. Limited Global Presence: Less widely known outside of Asia, which may result in a smaller global community and fewer resources.\n\n\n1. Fewer Integrations: While improving, Wolai still lags behind Notion in terms of third-party integrations.\n\n\n1. Learning Resources: Fewer English-language tutorials and guides available compared to Notion.\n\n\n1. Template Variety: While growing, the template library is not as extensive as Notion's.\n\n\n1. Feature Parity: Some specific features present in Notion may be missing or implemented differently in Wolai.\n\n\nBoth tools have their strengths and weaknesses, with Notion offering a more established ecosystem and global presence, while Wolai provides enhanced performance and features tailored for Asian markets. The choice between them often depends on specific user needs, geographical location, and personal preferences.\n\n\n## AFFiNE A Compelling Alternative\n\n\n**AFFiNE** is quickly emerging as a strong contender in the world of productivity tools, offering a seamless, flexible platform for note-taking, project management, and collaboration. With an intuitive interface and a range of features designed to boost productivity, AFFiNE sets itself apart from popular tools like Notion and Wolai by addressing key limitations and providing an optimized user experience.\n\n\n## Introduction to AFFiNE\n\n\n<img\n  src=\"https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/BytVdSmNv03ECbDFQCBEIj1S2IORcZwYnlGl_usoowE=\"\n  alt=\"AFFiNE\"\n  width=\"auto\"\n  height=\"auto\"\n/>\nAFFiNE is an all-in-one tool that combines **not**e-taking,task management, and collaboration features into a unified platform. It caters to individuals, teams, and organizations looking for an efficient way to manage workflows, store information, and collaborate in real time. Whether you’re a student tracking assignments or a business managing multiple projects, AFFiNE is built to adapt to your needs. Its modular design and easy-to-use interface allow for a more personalized experience, making it an ideal alternative to traditional productivity platforms.\n\n\n### Key Differentiating Features of AFFiNE\n\n\nAFFiNE offers a number of standout features that set it apart from other productivity tools:\n\n\n### Real-Time Collaboration\n\n\nWith AFFiNE, teams can work together on the same documents and projects inreal-time. Its synchronized editing feature ensures that everyone is on the same page, making it perfect for remote teamsand cross-functional collaboration. Unlike some platforms where updates can lag, AFFiNE ensures fast, reliable collaboration without interruptions.\n\n\n### Flexible and Modular Interface\n\n\nAFFiNE’s modular design offers more flexibility in how users structure their workflows. You can arrange notes,tasks, and projects however you like, giving you control over your workspace. The platform’s drag-and-drop functionality makes organizing projects intuitive and highly customizable, something that both Notion and Wolai often lack in terms of seamless rearrangement.\n\n\n### Offline Mode and Synchronization\n\n\nA major limitation of many cloud-based tools is their dependency on constant internet access. AFFiNE solves this by offering a robust offline mode, allowing you to continue working on projects without worrying about connectivity issues. Once you regain internet access, all changes are automatically synchronized, providing peace of mind for users who frequently work in different environments.\n\n\n### Privacy and Security\n\n\nAFFiNE emphasizes user privacy, offering **end-to-end encryption** and **data control** that surpasses many other tools in this space. Your data is securely stored, ensuring that sensitive information remains confidential. This is particularly appealing for users concerned about data privacy, a common issue with larger platforms like Notion.\n\n\n## How AFFiNE Addresses Limitations of Both Notion and Wolai\n\n\nWhile **Notion** and **Wolai** have gained popularity for their versatility, they are not without their shortcomings. AFFiNE addresses many of these limitations:\n\n\n### Enhanced Speed and Performance\n\n\nOne common complaint with Notion is that its interface can become sluggish as databases grow. AFFiNE tackles this issue with optimized **backend performance**, ensuring that even large projects and documents load quickly and run smoothly. This is particularly beneficial for teams managing heavy workflows or large repositories of information.\n\n\n### Improved Customization Options\n\n\nWhile Notion offers templates, it can sometimes feel rigid in terms of customization. Wolai, though flexible, lacks intuitive control over layout and modules. AFFiNE excels in this area by offering a more intuitive customization experience with its modular blocks, giving users more freedom to create unique workflows and page layouts to suit their personal or team’s needs.\nStronger Integration Capabilities\n\n\nNotion and Wolai both offer integrations with other tools, but their compatibility can be limited. AFFiNE provides a wider range of integrations, making it easier to connect with your existing tools and systems. Whether you need to integrate with calendar apps, task management tools, or file storage platforms, AFFiNE’s integration capabilities are more seamless, reducing friction in your productivity stack.\n\n\n### Price Efficiency\n\n\nAFFiNE provides a cost-effective solution compared to Notion and Wolai. With a free-tier offering robust features, many users find that they can access everything they need without upgrading to a premium plan, making AFFiNE a more affordable choice for freelancers, small teams, and startups.\n\n\nAFFiNE presents itself as a versatile, feature-rich alternative to Notion and Wolai, addressing many of the shortcomings of both platforms while enhancing performance, privacy, and customization. Whether you’re managing personal projects or leading a team, AFFiNE provides the tools and flexibility to elevate your productivity.\n\n\nAs productivity tools continue to evolve, both Notion and Wolai are focused on introducing new features and improvements to enhance user experience. However, AFFiNE has laid out a visionary roadmap that seeks to push the boundaries of productivity, making it a compelling alternative with future-ready features. Here’s a look at what’s coming for each of these platforms.\n\n\n## Upcoming Features or Improvements for Notion and Wolai\n\n\nBoth Notion and Wolai have exciting upcoming features that aim to enhance their already robust platforms. Notion is focusing heavily on integrating AI-powered tools that will streamline content creation and task automation, making it easier for users to generate drafts, summarize information, and receive intelligent suggestions. Additionally, Notion is planning improvements to its database functionality, allowing for more advanced filtering, sorting, and customization to cater to complex project management needs. One of the most anticipated updates is a more reliable offline mode, giving users the ability to work seamlessly without an internet connection. These enhancements, combined with more refined team collaboration tools such as detailed permission controls, will position Notion as an even more powerful tool for personal productivity and enterprise-level project management.\n\n\nSimilarly, Wolai is advancing its platform with a focus on greater customization options, enabling users to further personalize their workspace layouts through improved drag-and-drop features and modular tools. Wolai is also integrating AI features that will automate routine tasks and improve task prioritization, similar to Notion’s AI expansion. On the mobile front, Wolai is optimizing its app for better performance and enhancing its offline capabilities to ensure users can work without interruption. With plans to expand its third-party integrations—offering better connectivity with apps like Google Workspace and Slack—Wolai is gearing up to provide a more comprehensive and flexible workspace for users across a wide range of industries.\n\n\n### Notion’s Planned Enhancements\n\n\n### AI-Powered Features:\n\n\n<iframe\n  type=\"text/html\"\n  width=\"100%\"\n  height=\"410px\"\n  src=\"https://www.youtube.com/embed/l0N-6vTf9nY\"\n  frameborder=\"0\"\n  allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"\n  allowfullscreen\n  credentialless>\n</iframe>\n\n\nNotion is expanding its AI capabilities, integrating advanced automation tools to help users generate content faster, streamline workflows, and receive intelligent recommendations based on their activity. This move toward AI will help users draft notes, automate repetitive tasks, and even summarize large blocks of text with ease.\n\n\n#### Enhanced Team Collaboration:\n\n\nNotion is improving its team collaboration features with better permission controls, more robust user roles, and increased security for enterprise customers. These updates will make the platform more suitable for larger teams with complex structures.\n\n\n#### Improved Database Functionality:\n\n\nNotion has acknowledged the need for more dynamic and easier-to-use databases. Upcoming updates will likely focus on enhancing filters, sorting options, and the ability to customize views further, making Notion’s databases even more powerful for task management and data organization.\n\n\n#### Offline Functionality:\n\n\nA highly requested feature, Notion plans to introduce a more reliable **offline mode** to allow users to work without an internet connection. The company has stated it’s working on a smoother transition between offline and online modes, addressing a key limitation in its current offering.\n\n\n#### Wolai’s Upcoming Features\nExpanded Customization:\n\n\nWolai is focusing on improving customization options, allowing users more flexibility in designing and managing their pages. This includes improved block management and the ability to modify page layouts with drag-and-drop features.\n\n\n#### Enhanced AI Integration:\n\n\nSimilar to Notion, Wolai is also investing in AI features, particularly around automating workflows, enhancing task management, and simplifying content creation. AI tools in Wolai will provide smarter task suggestions, note generation, and even insights based on user behavior.\n\n\n#### Mobile and Offline Improvements:\n\n\nWolai users can expect major enhancements to its mobile app and offline functionality. These improvements will make it easier for users to work on the go and transition between devices without losing their progress.\n\n\n#### Better Third-Party Integrations\n\n\nWolai is enhancing its range of third-party integrations to allow smoother connections with popular apps like Google Workspace, Slack, and Trello. This move is aimed at improving interoperability, making Wolai a better tool for businesses relying on multiple software solutions.\n\n\n## AFFiNE’s Roadmap and Vision\n\n\nAFFiNE’s roadmap is ambitious, aiming to position itself as a true all-in-one solution that overcomes the limitations of existing tools. Here’s a glimpse into what AFFiNE has planned for the future:\n\n\n### Modular Workspace Expansion\n\n\nAFFiNE plans to expand its modular workspace features, allowing even more customization for users. The goal is to make every aspect of the workspace fully adaptable, including the ability to create custom modules that cater to specific user needs. This will allow businesses to tailor AFFiNE’s interface to their industry-specific requirements, going beyond standard templates.\n\n\n### AI-Driven Productivity Tools\n\n\nAFFiNE’s future will see the introduction of AI-powered task management and note-taking features. These tools will help users prioritize tasks more effectively, offer suggestions for organizing projects, and even generate content based on simple inputs. Unlike other platforms, AFFiNE’s AI will focus on seamless integration into workflows without overwhelming users.\n\n\n### Deeper Integration Ecosystem\n\n\nA key part of AFFiNE’s roadmap is expanding its integration ecosystem. Plans include direct integration with popular platforms like Jira, GitHub, Slack, but also more niche tools used by specific industries. The goal is to make AFFiNE the central hub for all your productivity needs, connecting effortlessly with other tools to reduce switching between platforms.\n\n\n### Community-Driven Development\n\n\nAFFiNE aims to foster a strong user community by implementing community-driven features. Users will be able to suggest new features, vote on improvements, and participate in beta testing, ensuring that the platform evolves based on real-world needs. This development approach will enable AFFiNE to stay responsive and closely aligned with the desires of its user base.\n\n\n### Offline-First Philosophy\n\n\nOne of AFFiNE’s key differentiators is its commitment to being an offline-first platform. While many tools are cloud-dependent, AFFiNE is working towards offering full offline functionality where users can work without internet access and experience no interruptions. This feature is aimed at professionals who need to stay productive regardless of their location.\n\n\n### Global Collaboration\n\n\nAFFiNE’s future includes a focus on global collaboration, allowing teams from around the world to work together without language barriers. The platform plans to implement multi-language support and real-time translation features, making it easier for international teams to collaborate effectively.\n\n\n### Privacy-Centric Approach\n\n\nIn the age of data breaches, AFFiNE’s vision includes strengthening its focus on user privacy and security. The platform will offer end-to-end encryption and enhanced data privacy settings, ensuring users have full control over their information, making it ideal for businesses handling sensitive data.\n\n\n### AFFiNE: Looking Ahead\n\n\nAFFiNE’s roadmap is aligned with the future of productivity tools, focusing on modularity,AI-enhanced features, and privacy. As it continues to develop, AFFiNE is poised to address the evolving needs of users in ways that both Notion and Wolai may not. With its forward-thinking approach and commitment to user experience, AFFiNE is quickly becoming a compelling alternative for individuals and teams looking to maximize their productivity.\n\n\n",
  "publish": true,
  "relatedBlogIds": [
    "RYQGPFyCRaTw0Ue_RnTVi",
    "DNedfjBsMABQC1zMZlHsC",
    "dH_dq8pJiQ"
  ],
  "relatedBlogs": [
    "top-8-ai-note-taking-tools-2024-best-reviews",
    "mymind-vs-notion",
    "best-evernote-alternatives-and-competitors-for-note-taking"
  ],
  "slug": "notion-vs-wolai",
  "tags": [
    "Content"
  ],
  "title": "Notion vs Wolai: A Comprehensive Comparison of Modern roductivity Tools.",
  "updated": 1728345600000,
  "updatedDate": 1728554769898,
  "valid": true
}