{
  "id": "MC4mp8tY_YWQyelW5nQRI",
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/-IcMJlZThdZcsCSynjSLYk-5o2FRsYH5m1RZ_BR_adw=",
  "coverAlt": "",
  "md": "We are currently in the process of migrating and upgrading our data systems. Acknowledging that upgrades can occasionally present challenges and result in various issues, such as data upgrade errors, we have prepared this article to assist you should you encounter the situation described below while using AFFiNE. This document addresses some of the concerns raised by our esteemed users during the recent AFFiNE upgrade. Please note that this is just a low-probability event. Our primary objective is to ensure a smooth transition for you and safeguard your valuable data.\n\n\n# STEP 1: Recover data through some basic and straightforward methods\n\n\n### 1. Refresh through Command+R\n\n\nIf you encounter issues with pages or workspace not opening, try refreshing and patiently wait for the page to recover. This process may take some time, approximately 5 to 10 minutes. Kindly wait with patience.\n\n\n### 2. Enable Cloud Workspace\n\n\nUpgrade your local data to a cloud workspace to ensure automatic upgrades and synchronization between different versions.\n\n\n\n![VA1BZmj4j3uVgfM0lQYXoXYJRvYO89bsa01FpwHpgZg=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/VA1BZmj4j3uVgfM0lQYXoXYJRvYO89bsa01FpwHpgZg=)\n\n\n# STEP 2: Migrate the data from the latest version to the old version\n\n\nThe two basic methods may sometimes recover your data, but success is not guaranteed every time. If these two approaches do not resolve your issue, you can try the following steps:\n\n\n### 1. Export data from the last AFFiNE client\n\n\nFirst, you need to Export Workspace in the upgraded version. Navigate to \"Workspace,\" select \"Settings,\" scroll down, and click \"Export.\" The exported workspace will be stored in the \".affine\" format.\n\n\n<video muted autoplay loop preload=\"auto\" playsinline>\n  <source src=\"https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/EBCYjmjlNM7ecVaurtCsa5x7kobCl9bq39lHWAoijKM=\" type=\"video/mp4\" />\n</video>\n\n\n### 2. Download the old version of the client\n\n\nDue to compatibility issues with the new version, we recommend downloading the previous version and re-importing your data. The recommended previous versions of AFFiNE can be downloaded from the following links:\n\n\nv0.10.3: [https://github.com/toeverything/AFFiNE/releases/tag/v0.10.3](https://github.com/toeverything/AFFiNE/releases/tag/v0.10.3)\n\n\nv0.10.2: [https://github.com/toeverything/AFFiNE/releases/tag/v0.10.2](https://github.com/toeverything/AFFiNE/releases/tag/v0.10.2)\n\n\n### 3. Import previously exported data to the old version\n\n\nAfter downloading and installing the preferred old version, you can re-import the data from the downloaded workspace. Select \"Import\" on the workspace list and choose the appropriate format for your data. Please note that the import format is \".affine\".\n\n\n<video muted autoplay loop preload=\"auto\" playsinline>\n  <source src=\"https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/Z1Ce1mZhqzZ2GYfktaRcaLr-RIC79bJFEg_yrYZoX2s=\" type=\"video/mp4\" />\n</video>\n\n\n### 4. Migrate the data to the latest version\n\n\nHowever, if you wish to experience the latest version, we still recommend manually migrating your content to the web-based Cloud Workspace. You have the option to manually replicate the article content by copying and pasting it into [https://app.affine.pro](https://app.affine.pro). Additionally, we highly recommend enabling the workspace to the cloud to ensure the preservation of data integrity and prevent any potential loss.\n\n\n# We're Here to Help\n\n\nIf the previously mentioned solutions do not address your concern, kindly reach out to us via email at [support@toeverything.info](mailto:support@toeverything.info) or engage with our community at [https://community.affine.pro/home](https://community.affine.pro/home) to share your feedback.\n\n\n**If you would like to send your damaged workspace directly to the email address above, our developers will help you restore it manually and hopefully provide you with faster assistance.** We value your cooperation and anticipate swiftly resolving your concerns.\n\n\nOur sincerest apologies for any inconvenience caused by the recent update. We are dedicated to providing you with the best experience and are here to assist you every step of the way. If you have further questions or need personalized assistance, please do not hesitate to contact us through our community forum, Discord, or Telegram. Your feedback is invaluable to us, and we're always looking to improve.\n\n\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n\n\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n\n\n* Telegram: [https://t.me/affineworkos](https://t.me/affineworkos)\n\n\n* Previous FAQ: [https://affine.pro/blog/faq](https://affine.pro/blog/faq)\n\n\n",
  "createDate": 1702536512606,
  "title": "Troubleshooting Guide for AFFiNE Data Upgrade",
  "updatedDate": 1705894817482,
  "guid": "MC4mp8tY_YWQyelW5nQRI",
  "author": "AFFiNE",
  "tags": [
    "User Guide"
  ],
  "slug": "troubleshooting-guide-affine-data-upgrade",
  "description": "Explore our comprehensive Troubleshooting Guide for AFFiNE Data Upgrade, providing step-by-step solutions and insights to ensure a smooth and successful upgrade process for your data. Resolve issues efficiently and enhance the performance of your AFFiNE system.",
  "created": 1702512000000,
  "updated": 1702512000000,
  "layout": "blog",
  "publish": true,
  "authors": [
    "AFFiNE"
  ],
  "valid": true,
  "relatedBlogIds": [],
  "linkedPageIds": [],
  "relatedBlogs": []
}