{
  "title": "Trust open source over others.",
  "authors": [
    "Enther He"
  ],
  "tags": [
    "Content"
  ],
  "description": "“As many of you know, the internet has been grappling with a crisis of trust since its inception. I’ve witnessed countless “digital refugees” lose their cherished data and memories due to political reasons, and it deeply saddens me.”",
  "created": 1724976000000,
  "updated": 1724976000000,
  "layout": "blog",
  "id": "3FCx1dqlEZMmKXeRP_kvO",
  "slug": "trust-open-source-over-others",
  "cover": null,
  "md": "---\n\ntitle: Trust open source over others.\n\nauthor: Enther He\n\ntags: Content\n\nslug: trust-open-source-over-others\n\ndescription: “As many of you know, the internet has been grappling with a crisis of trust since its inception. I’ve witnessed countless “digital refugees” lose their cherished data and memories due to political reasons, and it deeply saddens me.”\n\ncreated: 2024-08-30\n\nupdated: 2024-08-30\n\nlayout: blog\n\npublish: true\n\n---\n\n<img\n  src=\"https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/mWJv3hVerEInvo97iQYVzyPscjzruSdYjL6vkMlnilo=.webp\"\n  alt=\"Trust Open source over others.\"\n  width=\"auto\"\n  height=\"auto\"\n/>Hello, I’m Enther, the founder and CEO of AFFiNE. As many of you know, the internet has been grappling with a crisis of trust since its inception. I’ve witnessed countless “digital refugees” lose their cherished data and memories due to political reasons, and it deeply saddens me.\n\n\nOn the very first day of founding AFFiNE, my team and I embraced a set of core values. Our dedication to open source extends beyond its no-cost advantage. It should be open, where you can shape your own tool. It should be local first, where you can find your file and data locally without losing the option of an real-time syncing cloud. We believe it represents the transmission of human knowledge and technology from one generation to the next.\n\n\nDriven by our passion for open source, we created AFFiNE as an alternative to established tools like [Notion](https://affine.pro/blog/best-open-source-notion-alternatives), [Miro](https://affine.pro/blog/five-best-open-source-miro-alternatives-2023), and Airtable. At AFFiNE, we are committed to the principle that “you should act in such a way that you treat humanity, whether in your own person or in the person of another, always as an end and never merely as a means.” We hold that open source knowledge should remain unaffected by ideological conflicts or political disagreements.\n\n\nThus, we pledge to remain **100% open source** from our inception until the end of our journey.\n\n\nIf you or anyone you know has been affected by recent sanctions, please share this information. AFFiNE, as a leading open source [alternative to Notion](https://affine.pro/blog/best-open-source-notion-alternatives), [Miro](https://affine.pro/blog/five-best-open-source-miro-alternatives-2023), and Airtable, offers a seamless way to migrate your data from these platforms. Rest assured, you will retain full control over your data at AFFiNE under all circumstances.\n\n## One more thing,\n\nFor enterprise users affected by these sanctions, we are pleased to offer up to 6 months of free trial to assist with your migration to our cloud service. To receive the discount code, follow our YouTube channel and email the word “PROMETHEUS” along with a screenshot of your subscription to “contact@toeverything.io”\n\n## Trust open source over others!\n\nOur Latest beta has better support of importing data from Notion to AFFiNE. You can access our beta version [here](https://affine.pro/download/beta-canary).\n\n\n\n",
  "publish": true
}