{
  "title": "What’s new - AFFiNE - 20230620",
  "authors": [
    "Xuan Pang"
  ],
  "tags": [
    "Release Note"
  ],
  "description": "AFFiNE is the alternative of Notion, Miro, and Monday, this article introduces what’s new, and what updates, Improvements, and bug fixes have been released in the Stable version.",
  "created": 1687132800000,
  "updated": 1687219200000,
  "layout": "blog",
  "id": "vVlOT6cpKt",
  "slug": "what-is-new-affine-0620",
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/nT4rTgs820eO-mwmJP3UgZyizJlN483OWhlzp5gnO-A=.webp",
  "md": "---\n\ntitle: \"What’s new - AFFiNE - 20230620\"\n\nauthor: Xuan Pang\n\ntags: Release Note\n\nslug: what-is-new-affine-0620\n\ndescription: AFFiNE is the alternative of Notion, Miro, and Monday, this article introduces what’s new, and what updates, Improvements, and bug fixes have been released in the Stable version.\n\ncreated: 2023-06-19\n\nupdated: 2023-06-20\n\nlayout: blog\n\npublish: true\n\n---\n\n\n![nT4rTgs820eO-mwmJP3UgZyizJlN483OWhlzp5gnO-A=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/nT4rTgs820eO-mwmJP3UgZyizJlN483OWhlzp5gnO-A=)\n\n**The stable version is the most reliable and well-tested version**, perfect for users who want a smooth and consistent experience without worrying about crashes or glitches.\n\n## 1.What’s new\n\nHello to all AFFiNE users, whether you use it individually, with friends and family, or as part of a team.We are thrilled to announce the introduction of the AFFiNE stable version, incorporating a range of significant changes that we have been diligently working on behind the scenes for the past few weeks.\n\n### 1) **New features**\n\nExciting updates in AFFiNE: **PDF export**, **improved image preview**, and more stable **Notion import support**. Enhance your workflow with seamless sharing, enhanced visuals, and easy migration from Notion. Experience the power of AFFiNE today!\n\n### 2) **Improvements**\n\nOur latest improvement to AFFiNE brings **a series of iterations and optimizations** in terms of the **date picker and some tiny UI stuff**.\n\n### 3) Bug fixed\n\nA series of bugs have been fixed, which allow more slick and intuitive use of AFFiNE for our users.\n\n## 2.To get started, download the latest beta version\n\n\n![P65NinZ_oeKGuw9QtD_bSs5SADctRYN18LMUnxA_6po=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/P65NinZ_oeKGuw9QtD_bSs5SADctRYN18LMUnxA_6po=)\n\n* We invite you to download the stable version first to embark on an exciting journey with our latest enhancements. This will allow you to be among the first to experience the positive benefits we have in store for our valued users.\n* Want to learn how to get even more out of AFFiNE? Join the conversation in our growing AFFiNE community and get inspired by others, give feedback, or ask any questions you may have.\n## 3.Detailed iteration\n\n### 1) New Features\n\n* **Notion/html/markdown/.db import-supported**\n  * Effortlessly **import Notion**, HTML, or Markdown content into AFFiNE with just a few simple clicks, preserving formatting, and structure, and saving time, enhancing user experience. Say goodbye to the complicated process of manually converting and adjusting content.\n  * Link: https://github.com/toeverything/AFFiNE/pull/2533\n  * **Note that importing from notion is experimental (particularly the database import is invalid), and now only supports page-by-page import, which may cause some inconvenience. We welcome any feedback from our users.**\n\n![MO01mtAJREMMi_m1T4ZYdnWg16vA-3_z2zG4hFcRet0=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/MO01mtAJREMMi_m1T4ZYdnWg16vA-3_z2zG4hFcRet0=)\n\n* **PDF, HTML and Markdown export-supported**\n  * In addition to the existing HTML and markdown export capabilities, we're excited to introduce the new PDF form export feature, With the PDF form export, you can now easily convert your AFFiNE documents into professional-looking PDF files.\n  * Link: [https://github.com/toeverything/AFFiNE/pull/2604](https://github.com/toeverything/AFFiNE/pull/2604)\n  \n![MO01mtAJREMMi_m1T4ZYdnWg16vA-3_z2zG4hFcRet0=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/MO01mtAJREMMi_m1T4ZYdnWg16vA-3_z2zG4hFcRet0=)\n\n### 2) Improvements\n\n* Featuring an all-page UI update with filter options\n  * Users can now effortlessly access the all-page, which enables them to conveniently sort previous articles in ascending or descending order, or favourites with the filter function. Enjoy efficient organization, quick access to desired content, and a seamless browsing experience.\n  * Link: [https://github.com/toeverything/AFFiNE/pull/2510](https://github.com/toeverything/AFFiNE/pull/2510) ; [https://github.com/toeverything/AFFiNE/pull/2644](https://github.com/toeverything/AFFiNE/pull/2644)\n\n![1g2H5Hhy5gspGUGP2LnD5e2O2dyKzVpE-6rvabbR5oA=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/1g2H5Hhy5gspGUGP2LnD5e2O2dyKzVpE-6rvabbR5oA=)\n\n* **New preloading content within the edgeless mode to showcase the possibility of using AFFiNE**\n  * The new preloading content within edgeless mode has been uploaded. It embodies the potential and possibilities our users can unleash with the use of AFFiNE. Here, everything you see is achievable.\n  * Link: [https://github.com/toeverything/blocksuite/pull/2575](https://github.com/toeverything/blocksuite/pull/2575)\n  * Please note that you are encouraged to create a new workspace to trigger this new content in edgeless mode considering there may exist issues that cause the disappearance of it in the original one.\n\n![6ANoWk9Wn5mf2IsgS-yy-MRN-cf1iRf4VZfF9ihUAgs=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/6ANoWk9Wn5mf2IsgS-yy-MRN-cf1iRf4VZfF9ihUAgs=)\n\n### 3) Bug fixed\n\n* Fixed: Adding database by slash menu in quote or list block inserts at incorrect position\n  * Details: Resolved the problem where adding a database using the slash menu in quote or list blocks resulted in incorrect positioning. The fix ensures that databases are now inserted correctly within the desired location, enhancing the overall editing experience.\n  * Link: [https://github.com/toeverything/blocksuite/issues/3089](https://github.com/toeverything/blocksuite/issues/3089)\n* Fixed: Bugs about the database and bookmark blocks inserted from Block Hub in Edgeless mode\n  * Details: Resolved bugs related to dragging and functionality of database and bookmark blocks from Block Hub in Edgeless mode. Users can now seamlessly drag and utilize these blocks on the whiteboard as intended.\n  * Link: [https://github.com/toeverything/blocksuite/issues/3091](https://github.com/toeverything/blocksuite/issues/3091)\n* Fixed: can not drop bookmark with new frame in edgeless mode from block-hub\n  * Details: Previously, users were unable to drop bookmarks with new frames from Block Hub onto the whiteboard in Edgeless mode. This problem has been resolved, allowing users to easily drop and utilize bookmarks with new frames from Block Hub in Edgeless mode without any obstacles.\n  * Link: [https://github.com/toeverything/blocksuite/pull/3145](https://github.com/toeverything/blocksuite/pull/3145)\n* Fixed: can not save the last title being edited in table view\n  * Details: Previously, there was a bug that prevented the last edited title in table view from being saved. This issue has been resolved, ensuring that the changes made to the last title are successfully saved when editing in table view. Users can now update and save titles without any data loss or inconsistencies.\n  * Link: [https://github.com/toeverything/blocksuite/pull/3101](https://github.com/toeverything/blocksuite/pull/3101)\nWe highly value your feedback and ideas, as you are of utmost importance to us. We would be absolutely thrilled to hear what aspects of our work you find most useful and which areas you feel require improvement. Please do not hesitate to get in touch with us through any of our social media channels to share your valuable insights. We are eagerly looking forward to hearing from you!!\n\n* Official Website: [https://affine.pro/](https://affine.pro/)\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n* Telegram: [https://t.me/affineworkos](https://t.me/affineworkos)\n",
  "publish": true
}