{
  "title": "What’s new - AFFiNE - 20230717",
  "authors": [
    "Jackie Peng",
    "Yanxi Liu"
  ],
  "tags": [
    "Release Note"
  ],
  "description": "AFFiNE is the alternative of Notion, Miro, and Monday, this article introduces what’s new, and what updates, Improvements, and bug fixes have been released in the Stable version.",
  "created": 1689465600000,
  "updated": 1689552000000,
  "layout": "blog",
  "id": "YTQlqWfdJ_",
  "slug": "what-is-new-affine-0717",
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/NRJN4tK8s0Pj3-Rl2aBS8ftB9gMFKTgrlLJilQJ4Z5E=.webp",
  "md": "---\n\ntitle: \"What’s new - AFFiNE - 20230717\"\n\nauthor: Jackie Peng, Yanxi Liu\n\ntags: Release Note\n\nslug: what-is-new-affine-0717\n\ndescription:  AFFiNE is the alternative of Notion, Miro, and Monday, this article introduces what’s new, and what updates, Improvements, and bug fixes have been released in the Stable version.\n\ncreated: 2023-07-16\n\nupdated: 2023-07-17\n\nlayout: blog\n\npublish: true\n\n---\n\n\n![NRJN4tK8s0Pj3-Rl2aBS8ftB9gMFKTgrlLJilQJ4Z5E=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/NRJN4tK8s0Pj3-Rl2aBS8ftB9gMFKTgrlLJilQJ4Z5E=.webp)\n\nThe best app for testing upcoming features and providing us with feedback. This build has been lightly tested, but is not suitable for production.\n\nNoted that the** bookmark, import/export** are not quite stable, be careful to use these features. Implementing db is also not supported this version, we feel sorry to any inconviniences caused by this.\n\n## 1.What’s new\n\nHello to all AFFiNE users, We are delighted to announce the release of the beta version, which incorporates a range of new features and improvements that we have been diligently working on behind the scenes for the past few weeks.\n\n### 1) **New features**\n\nExciting updates within AFFiNE: this time we bring so many exciting new features like the **Doc filter**, **Collections**, **Page tag**, **backlinks supported**, **Blockspicer** **and** **a** **completely** **new** **and** **powerful** **database**, kick off your journey to explore the fancy stuff!\n\n### 2) **Improvements**\n\nOur latest improvement to AFFiNE brings a series of iterations and optimizations regarding the **New** **Settings** **Page**, **PDF** **&** **PNG** **Export,** **and** **Enhanced** **UI/UX** **Experience,** which will bring your user experience to the next level.\n\n### 3) Bug fixed\n\nA series of bugs have been fixed, which allow more slick and intuitive use of AFFiNE for our users.\n\n## 2.To get started, download the latest beta version\n\n* We invite you to download the beta version first to embark on an exciting journey with our latest enhancements. This will allow you to be among the first to experience the positive benefits we have in store for our valued users.\n* Want to learn how to get even more out of AFFiNE? Join the conversation in our growing AFFiNE community and get inspired by others, give feedback, or ask any questions you may have.3.Detailed iteration\n## 3.Detailed iteration\n\n### 1) New Features\n\n* Doc filter & Collections\n  * Doc filter: The new doc filter can quickly help users to navigate the docs by creating dates, favorites, and tags.\n\n![KSzOi0HHfUE3MHiWFE1sb7xKV4LOGrVFoQVixdqZQpI=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/KSzOi0HHfUE3MHiWFE1sb7xKV4LOGrVFoQVixdqZQpI=.webp)\n\n* Collections: A few steps to set criteria, collect filtered pages, and effortlessly curate frequently used content, ensuring efficient organization and easy retrieval and comprehensive management.\n\n![lWmboopIBpGPXguszJKPus_9hg3AgCrQUUmJARNPtJQ=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/lWmboopIBpGPXguszJKPus_9hg3AgCrQUUmJARNPtJQ=.webp)\n\n* Page tag\n  * Too many pages? Now you can tag your content with descriptive labels, making it easier to find and access  whenever you need it.\n\n![CgxJfxH0NgPs6vyUnGLDNyJXoZf9DNl8NYJwo5TZ25I=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/CgxJfxH0NgPs6vyUnGLDNyJXoZf9DNl8NYJwo5TZ25I=.webp)\n\n* Backlinks support\n  * Effortlessly transform any link into a bookmark with better clarity of information previews and rapid access to your saved web pages.\n\n![0ZvMGNB3m1GojJ4VU21vNjIAwc9PAg-TsXR1dTJQDcg=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/0ZvMGNB3m1GojJ4VU21vNjIAwc9PAg-TsXR1dTJQDcg=.webp)\n\n* Powerful database\n  * With just one click, you are able to transform your text into structured tables, organizing information for visual appeal. Say goodbye to the hassle of manually inputting your text, cell by cell, into the database\n  \n![wzNppJMgVjC8ThVR9TlhVkPu5OXTEsEsqnuv-Xmrr0g=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/wzNppJMgVjC8ThVR9TlhVkPu5OXTEsEsqnuv-Xmrr0g=.webp)\n\n  * Tired of tedious manual adjustments? Now you can rearrange your table columns simply by dragging them to your desired positions.\n  \n![RJeOwsZFMQE8zW7muemAnAEX1UELMFRD2Y66caKzYpo=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/RJeOwsZFMQE8zW7muemAnAEX1UELMFRD2Y66caKzYpo=.webp)\n\n  * Quick Access to External Resources with hyperlinks\n  \n![G6CMsggjutVcZaot4zLiuj_PQugl_SxseczPL-fMygo=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/G6CMsggjutVcZaot4zLiuj_PQugl_SxseczPL-fMygo=.webp)\n\n  * Blockspicer\n    * To provide you with enhanced customization options, we are introducing a pair of scissors tool that allows you to divide your creations into as many pieces as you desire, opening up more possibilities for the layout of edgeless mode.\n\n![3TFGwfygZi1ykMGTGdJOvICIyYvtWg3FW-z7bKEVDhM=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/3TFGwfygZi1ykMGTGdJOvICIyYvtWg3FW-z7bKEVDhM=.webp)\n\n### 2) Improvements\n\n* New Settings Page\n  * Personalize your note-taking environment with our new pop-up settings page. Better dark-mode settings and a translucent sidebar are available now.\n\n![Wo5IpH2IIpnrEw30VfdmZgjL4w4bCaUp90yGRv5_nIo=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/Wo5IpH2IIpnrEw30VfdmZgjL4w4bCaUp90yGRv5_nIo=.webp)\n\n* PDF & PNG Export\n  * Both PDF & PNG are now export-supported, feel completely free to share documents in an easy way.\n\n![7aaWXOkOPNEHl2gVWp0LcY9jUYoKF1PsqejKfO1X1fQ=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/7aaWXOkOPNEHl2gVWp0LcY9jUYoKF1PsqejKfO1X1fQ=.webp)\n\n* Enhanced UI/UX Experience\n  * New Edgeless Toolbar: In edgeless mode, we redesigned the toolbar to enhance its visual appeal and interactivity. With intuitive symbols, you will experience a more engaging interface.\n  \n![9vpoW3K_qpmoYB3r4uWR8fzJbEWqrDjn5gFQ3IeHoxE=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/9vpoW3K_qpmoYB3r4uWR8fzJbEWqrDjn5gFQ3IeHoxE=.webp)\n\n  * New Titlebar: In order to make our Titlebar harmoniously blend with the page, we design a particular visual experience for Windows users.\n  \n![orMPWEgelZYCBw4dU_HXVQp-jhr9icO9dIyTLc7sCro=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/orMPWEgelZYCBw4dU_HXVQp-jhr9icO9dIyTLc7sCro=.webp)\n\n  * Full-width mode supported: It will provide you with a better experience of viewing the page\n  \n![Q85_3R3Lo9tSqSHv_REmdZNohewjY7iIC49lxb73IKM=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/Q85_3R3Lo9tSqSHv_REmdZNohewjY7iIC49lxb73IKM=.webp)\n\n### 3) Bug fixed\n\n* Fixed: Edgeless fatal crash when editing on first load\n  * Details: we know this bug causes quite negative implications and experiences, so we took days on fixing it, and now there's no fatal crash within edgeless anymore\n  * Link: [https://github.com/toeverything/AFFiNE/issues/3141](https://github.com/toeverything/AFFiNE/issues/3141)\n* Fixed: When using the database, you cannot change the title name if you add a new column.\n  * Details: This bug has been noticed and solved properly, now no constraints that will cause any impediments to you anymore.\n  * Link: [https://github.com/toeverything/blocksuite/issues/3069](https://github.com/toeverything/blocksuite/issues/3069)\n* Fixed: Can the Delete key be used as the same function as the backspace\n  * Details: With the efforts made, now the issue no longer exists, you can use the backspace just like the delete to erase the content you just created. No more impediments that contradict with your implementation habit or behaviour.\n  * Link: [https://github.com/toeverything/blocksuite/issues/2550](https://github.com/toeverything/blocksuite/issues/2550)\n* Fixed: the image was lost after exporting\n  * Details: This bug has already been fixed thanks to the developer's efforts, now, you will get full experience of exporting your file without any concern to your photos.\n  * Link: [https://github.com/toeverything/AFFiNE/pull/3150](https://github.com/toeverything/AFFiNE/pull/3150)\nWe highly value your feedback and ideas, as you are of utmost importance to us. We would be absolutely thrilled to hear what aspects of our work you find most useful and which areas you feel require improvement. Please do not hesitate to get in touch with us through any of our social media channels to share your valuable insights. We are eagerly looking forward to hearing from you!!\n\n* Official Website: [https://affine.pro/](https://affine.pro/)\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n* Telegram: [https://t.me/affineworkos](https://t.me/affineworkos)\n",
  "publish": true
}