{
  "author": "Xuan Pang, Jackie Peng",
  "authors": [
    "Xuan Pang",
    "Jackie Peng"
  ],
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/w2dfvakuWky1C3vWVZM7V4Ry4gJ-n3B4dKaNDa25iho=",
  "coverAlt": "",
  "createDate": 1688097148238,
  "created": 1687996800000,
  "description": "AFFiNE is the alternative of Notion, Miro, and Monday, this article introduces what’s new, and what updates, Improvements, and bug fixes have been released in the Stable version.",
  "favorite": false,
  "guid": "1c22135c-fda0-445c-a6d7-e570c3f340f1",
  "id": "nfpyo8m6ow",
  "layout": "blog",
  "linkedPageIds": [
  ],
  "md": "**The beta version is the right version if you are looking to test and provide feedback on some of our upcoming features and help us check for bugs. It incorporates improvements from the Canary Version.**\n\n\n**Note that due to some migration reasons we've made, the current beta version will temporarily move the export function, db files' import and move folders. If you deem those functionalities as the most ones, be careful to use this version.**\n\n\n## 1.What’s new\n\n\nHello to all AFFiNE users, We are delighted to announce the release of the beta version, which incorporates a range of new features and improvements that we have been diligently working on behind the scenes for the past two weeks.\n\n\n### 1) **New features**\n\n\nExciting updates in AFFiNE: **eraser to facilitate your creation** within the edgeless mode, **scrollbar** in page mode**,** and **on-page functionality** allows you to decide whether the content from the edgeless mode, such as text or images, can be displayed or hidden when switching to page mode.\n\n\n### 2) **Improvements**\n\n\nOur latest improvement to AFFiNE brings **a series of iterations and optimizations** regarding supporting selected forward and backward image previews, block alignment, Note creation sort numbers, bookmark reload and so forth.\n\n\n### 3) Bug fixed\n\n\nA series of bugs have been fixed, which allow more slick and intuitive use of AFFiNE for our users.\n\n\n## 2.To get started, download the latest beta version\n\n\n\n![P65NinZ_oeKGuw9QtD_bSs5SADctRYN18LMUnxA_6po=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/P65NinZ_oeKGuw9QtD_bSs5SADctRYN18LMUnxA_6po=)\n\n\n* We invite you to download the **[beta version](https://affine.pro/download)** first to embark on an exciting journey with our latest enhancements. This will allow you to be among the first to experience the positive benefits we have in store for our valued users.\n\n\n* Want to learn how to get even more out of [AFFiNE](https://affine.pro/)? Join the conversation in our [growing AFFiNE community](https://community.affine.pro/home) and get inspired by others, give feedback, or [ask any questions](https://community.affine.pro/c/questions-answers/) you may have.\n\n\n## 3.Detailed iteration\n\n\n### 1) New Features\n\n\n* Eraser support\n\n\n  * The edgeless mode in AFFiNE introduces an eraser feature. Users can now effortlessly remove unwanted markings, sketches, or text from the edgeless mode, providing a seamless and convenient experience. This eraser functionality enhances precision and ease of use, making digital collaboration more intuitive.\n\n\n  * Link: [https://github.com/toeverything/blocksuite/pull/3230](https://github.com/toeverything/blocksuite/pull/3230)\n\n\n\n![10t06ey4ZMrC1uBY7WCFgWkRM77lIG7UwG20b8fCc7I=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/10t06ey4ZMrC1uBY7WCFgWkRM77lIG7UwG20b8fCc7I=)\n\n\n* **On-page functionality-supported**\n\n\n  * Users can decide whether they want the content from the edgeless mode, such as text or images, to be displayed or hidden when switching to page mode. This feature offers flexibility and customization, allowing users to tailor their viewing experience based on their specific needs and preferences.\n\n\n  * Link:[https://github.com/toeverything/blocksuite/pull/3177](https://github.com/toeverything/blocksuite/pull/3177)\n\n\n\n![oqPbPBuK5__7MP0jm2hCJqY06pCGBK1SE-dR7J_tYq4=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/oqPbPBuK5__7MP0jm2hCJqY06pCGBK1SE-dR7J_tYq4=)\n\n\n* **Scrollbar-supported in page mode**\n\n\n  * Users can now scroll vertically within the page mode via scrollbar functionality, allowing for easier navigation and access to content that extends beyond the visible area.\n\n\n  * Link:[https://github.com/toeverything/AFFiNE/pull/2826](https://github.com/toeverything/AFFiNE/pull/2826)\n\n\n\n![qNzW68YTXSNZ0GtGB7t5kuBB2XFEJJ0ba6M3gjlCrhA=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/qNzW68YTXSNZ0GtGB7t5kuBB2XFEJJ0ba6M3gjlCrhA=)\n\n\n### 2) Improvements\n\n\n* Supporting selected forward and backward image previews\n\n\n  * Users can now conveniently navigate through a series of images by previewing them in both forward and backward directions. This feature allows for easier browsing and selection of desired images, enhancing the overall user experience and facilitating efficient image management.\n\n\n  * Link: [https://github.com/toeverything/AFFiNE/pull/2720](https://github.com/toeverything/AFFiNE/pull/2720)\n\n\n\n\n\n\n![mpObKu3Vyj-x1vEX2EGMEOf7JvtNvNyAdams1nRTeno=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/mpObKu3Vyj-x1vEX2EGMEOf7JvtNvNyAdams1nRTeno=)\n\n\n* **Block alignment supported in edgeless mode**\n\n\n  * Users can align blocks of content, such as text, markings or images, within the edgeless mode. This feature ensures precise and consistent positioning of elements, resulting in a cleaner and more organized layout.\n\n\n  * Link: [https://github.com/toeverything/blocksuite/pull/2967](https://github.com/toeverything/blocksuite/pull/2967)\n\n\n\n![XKSCPAqvOMYo-749Vs1pmQ6Taaj6szuvxPutGSKAtA8=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/XKSCPAqvOMYo-749Vs1pmQ6Taaj6szuvxPutGSKAtA8=)\n\n\n\n\n\n* **The shape has been hollowed out and supports multiple selections**\n\n\n  * We heard loads of complaints regarding the shape hollowed-related issues that probably cause some unexpected inconveniences in terms of picking up, and editing operations. Now we have made some improvements to it, the centre area of shape has been hollowed, and the multiple selections of disparate blocks are now supported. Users can create more intricate shapes or adjust specific components with ease and flexibility.\n\n\n  * Link: [https://github.com/toeverything/blocksuite/pull/3212](https://github.com/toeverything/blocksuite/pull/3212)\n\n\n\n![v613HLT0lRJgI8OUhpIROkrBCbrT7Og6KQxBghdXVBo=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/v613HLT0lRJgI8OUhpIROkrBCbrT7Og6KQxBghdXVBo=)\n\n\n\n\n\n* **Bookmark reload-supported**\n\n\n  * Users can now reload their bookmarked pages with ease, ensuring access to the most up-to-date content. This feature streamlines the browsing experience, allowing users to quickly refresh their saved bookmarks without manually navigating to each page.\n\n\n  * Link: [https://github.com/toeverything/blocksuite/issues/2574](https://github.com/toeverything/blocksuite/issues/2574)\n\n\n\n![xZ2SYVm0WWYo45Osir0MjjKazzRmm9LRQP_SsbAFawY=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/xZ2SYVm0WWYo45Osir0MjjKazzRmm9LRQP_SsbAFawY=)\n\n\n### 3) Bug fixed\n\n\n* Fixed: When using the database, you cannot change the title name if you add a new column.\n\n\n  * Details: This bug has been noticed and solved properly, now no constraints that will cause any impediments to you anymore.\n\n\n  * Link: [https://github.com/toeverything/blocksuite/issues/3069](https://github.com/toeverything/blocksuite/issues/3069)\n\n\n* Fixed: Can the Delete key be used as the same function as the backspace\n\n\n  * Details: With the efforts made, now the issue no longer exists, you can use the backspace just like the delete to erase the content you just created. No more impediments that contradict with your implementation habit or behaviour.\n\n\n  * Link: [https://github.com/toeverything/blocksuite/issues/2550](https://github.com/toeverything/blocksuite/issues/2550)\n\n\n* Fixed: Drag the bookmark block from the toolbar within edgeless mode, it'll disappear once you click it.\n\n\n  * Details: Drag the bookmark block within the edgeless from the toolbar now perform perfectly well, and will not disappear again.\n\n\n  * Link: [https://github.com/toeverything/blocksuite/issues/3171](https://github.com/toeverything/blocksuite/issues/3171)\n\n\n* Fixed: In dark mode, the option button of the tag within the database cannot even be seen.\n\n\n  * Details: We know this bug is quite small and maybe only a very rare of our users have come across it. Whereas we weigh our users' experiences most, so we solved them and guarantee that any small issues with the minimum possibility to interfere with our users will be fixed once we are aware of them.\n\n\n  * Link: [https://github.com/toeverything/blocksuite/issues/3090](https://github.com/toeverything/blocksuite/issues/3090)\n\n\n\n\n\nWe highly value your feedback and ideas, as you are of utmost importance to us. We would be absolutely thrilled to hear what aspects of our work you find most useful and which areas you feel require improvement. Please do not hesitate to get in touch with us through any of our social media channels to share your valuable insights. We are eagerly looking forward to hearing from you!!\n\n\n* Official Website: [https://affine.pro/](https://affine.pro/)\n\n\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n\n\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n\n\n* Telegram: [https://t.me/affineworkos](https://t.me/affineworkos)\n\n\n",
  "publish": false,
  "relatedBlogIds": [
  ],
  "relatedBlogs": [
  ],
  "slug": "whats-new-affine-0630",
  "tags": [
    "Release Note"
  ],
  "title": "What’s new - AFFiNE - 20230630",
  "updated": 1688083200000,
  "valid": true
}