{
  "title": "What is AFFiNE — An Interview with AFFiNE’s CEO Jiachen (1/2)",
  "authors": [
    "Jackie Peng"
  ],
  "tags": [
    "Content"
  ],
  "description": "In this interview with AFFiNE CEO Jiachen, learn about what is AFFiNE, the basic introduction of AFFiNE, and its mission to create an integrated KnowledgeOS that prioritizes data sovereignty and open-source values. Discover how AFFiNE differentiates itself from established players like Notion and Miro, and most importantly.",
  "created": 1680134400000,
  "updated": 1680134400000,
  "layout": "blog",
  "id": "5GhRWX83tE",
  "slug": "what-is-affine-interview-with-affine-ceo-1",
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/Dpp6nElNabbfAhCpc6MqdBC548DOLENOY7LLqr53o10=.webp",
  "md": "---\n\n\ntitle: What is AFFiNE — An Interview with AFFiNE’s CEO Jiachen (1/2)\n\n\nauthor: Jackie Peng\n\n\ntags: Content\n\n\nslug: what-is-affine-interview-with-affine-ceo-1\n\n\ndescription: In this interview with AFFiNE CEO Jiachen, learn about what is AFFiNE, the basic introduction of AFFiNE, and its mission to create an integrated KnowledgeOS that prioritizes data sovereignty and open-source values. Discover how AFFiNE differentiates itself from established players like Notion and Miro, and most importantly.\n\n\ncreated: 2023-03-30\n\n\nupdated: 2023-03-30\n\n\nlayout: blog\n\n\npublish: true\n\n\n---\n\n\n\n![Dpp6nElNabbfAhCpc6MqdBC548DOLENOY7LLqr53o10=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/Dpp6nElNabbfAhCpc6MqdBC548DOLENOY7LLqr53o10=.webp)\n\n\nDescription: In this interview with AFFiNE CEO Jiachen, learn about what is AFFiNE, the basic introduction of AFFiNE, and its mission to create an integrated KnowledgeOS that prioritizes data sovereignty and open-source values. Discover how AFFiNE differentiates itself from established players like Notion and Miro, and most importantly.\n\n\n\n---\n\n\n**AFFiNE founder: Open Source, Data Sovereignty, Creating an Integrated KnowledgeOS**\n\n\nWhat do excellent companies look like, and what traits do successful talents possess? On their journey, what are the pitfalls to be aware of, and what are the most significant changes?\n\n\nChuang·Wen poses questions to outstanding entrepreneurs, investors, and industry experts, hoping to share their ideas with you.\n\n\n**This issue features He Jiachen, founder and CEO of AFFiNE.**\n\n\nStemming from a school innovation competition experience, Jiachen dropped out of the Max Planck Institute to start his entrepreneurial journey. AFFiNE is positioned as an integrated KnowledgeOS, front end including outstanding open-source project authors in graphics, rich text, front-end frameworks, TC39 (the JavaScript standardization committee) members, official Node.js members, and collaborative editing developers from companies such as Lark, Web Infra, Kuaishou Qingque, Microsoft, Baidu, and JD.com.\n\n\nData shows that in 2022, the global market size for office collaboration tools was approximately $46 billion, one of the largest general software markets. Among them, the growth rate of collaboration tools was 17%, making it one of the fastest-growing software tracks in the post-pandemic era. In recent years, several multi-billion-dollar companies have emerged in this field, with new technologies and product forms continuously appearing. **Among them, leading players Miro (a visualization collaboration platform) and Notion (a note-taking tool) have gained numerous fans for their smooth experience and powerful features but have not been open-source. Is there a more private, transparent, customizable, and cross-platform (Windows/OS/Linux) next-generation knowledge base?**\n\n\nAFFiNE began its attempt. **AFFiNE supports using kanban boards, tables, and rich-text paragraphs as building blocks to form pages or whiteboards, allowing users to perform comprehensive tasks such as document editing, data processing, and brainstorming on a single whiteboard.**He Jiachen, the post-95 founder, and his team aim to create a platform where “people can organize the knowledge they want, rather than text in notes and graphics on whiteboards. We believe the content carrier should be arbitrary, allowing people to freely organize the required model. Team collaboration and personal note-taking are essentially processes of knowledge accumulation and exchange with others. We want to create an operating system, the Knowledge OS.”\n\n\nFrom Day One, open-source has been a universally recognized value for AFFiNE. **It not only means open-source code but also “everything building in public.”** When asked about the differences between AFFiNE and Miro or Notion, the answer is simple: people should own their data. “Today, building an application with JavaScript does not have a dedicated framework or the best solution. AFFiNE wants to solve this problem with BlockSuite on the front-end, allowing people to build cross-platform collaborative applications without worry. From an engineering experience perspective, there is no difference between building client, web, local, or cloud-native applications. There is no benchmark application on the market today that can iterate out such infra, so we have to do it ourselves. Using AFFiNE’s infrastructure to create a SaaS product is the most elegant and efficient way, and that is our strategy,” He Jiachen says.\n\n\nQ=China Growth Capital\n\n\nA=AFFiNE Founder He Jiachen\n\n\n**He Jiachen, founder and CEO of AFFiNE, graduated from the University of Glasgow and Hong Kong University of Science and Technology, and has worked as a researcher in the Nobel Prize team IGR and LIGO, and participated in the development of academic collaboration platforms in one of the top astrophysics research institutes.**\n\n\n\n---\n\n\n**Q1：AFFiNE defines itself as an “integrated KnowledgeOS”. How can we understand this concept?**\n\n\n**Jiachen: What is the difference between Knowledge and Information? Distilled information that you repeatedly read and use may have the chance to become sources or works, and this type of information is knowledge.**\n\n\nKnowledge comes in many forms, such as speech, text, structured text, and various rich text. The best way is the Block Editor, which can put various carriers needed together. People can organize their desired knowledge, rather than having text in notes and graphics on whiteboards. We believe that the carrier of content should be arbitrary so that people can freely organize the models they need. Team collaboration and personal notebooks are essentially the process of knowledge constantly being precipitated and exchanged with others. We want to create an operating system, that is, Knowledge OS.\n\n\n**Q2: How does AFFiNE realize Knowledge OS?**\n\n\n**Jiachen:**AFFiNE’s philosophy is a bit like Apple. Before making the iPhone, they made the iPod. Before selling software in the App Store, they first made users accustomed to paying $1 for a song in the iPod. We first make applications and iterate a good infrastructure in an open-source way, so that others can have better infrastructure to use.\n\n\nWe want to make our SaaS, driven by the backend database Octobase and the frontend BlockSuite. Essentially, we solve the problem of JAMstack. In the past, people used platform-specific language environments for development on different platforms, such as using .NET for Windows and Swift for macOS, and then connected to the server. What is the server? It is Java running on Linux, and those who prioritize performance will use C++. The web end connects through JavaScript. Performance depends on underlying facilities. For example, anyone can write in Python, but it has performance bottlenecks, and calling modules in Python may require the use of C++.\n\n\nAs the most widely used language in the world, JavaScript still has two major problems to solve. First, JavaScript can only run in browsers and is a script specific to browsers. If we package client applications or make an application in a browser today, these are not JavaScript’s best practices. So, these frameworks are now in an awkward position. Python unifies scientific computing, and JavaScript unifies web development, but GUI development has not been unified. Today, there is no dedicated framework or best solution for building a collaborative application using JavaScript. AFFiNE’s idea is to solve this problem in the frontend BlockSuite, allowing people to build cross-platform collaborative applications without worrying about it. From an engineer’s perspective, building client, web, local, or cloud-native applications makes no difference.\n\n\nThe most ideal state is that in 5–10 years, the future of cloud-native is distributed and server-client homomorphic. A simple assumption is that if a SaaS product can extract and cluster all the CPU, hard drives, and memory of all users’ laptops, this cluster will be much more powerful than Alibaba Cloud and AWS. So, what is our ultimate goal? With homomorphic clients and servers, we can do the server-side rendering from the server’s perspective, and all distributed computing for applications can have local states from the client’s perspective. Computers can simultaneously become a node in a cluster, which will make the future network more direct, faster, and make developing local and cloud-native applications the same. This is the future that everyone can see. But there is no benchmark application in the market today that can iterate such infrastructure, so we have to do it ourselves.\n\n\n**Q3: You studied astrophysics in university, why did you choose to venture into the collaboration field? What were the opportunities and motivations that led you to this decision?**\n\n\n**Jiachen:** To be honest, there are not many groundbreaking opportunities in the field of physics anymore. Predecessors like Einstein, Feynman, Glashow, and Weinberg were all too brilliant, and they have completed the work that needs to be done today. Studying physics leaves you with no other option but to either become a research professor or a high school teacher. But I always wanted to do something more interesting.\n\n\nThe opportunity to start a business actually came from a very “mundane” source. The school had a national innovation competition, and I thought it would be better to write a business plan than submit a resume. That’s how I began my journey into entrepreneurship. But what should I do as an entrepreneur? At that time, I was thinking very simplistically and was completely path-dependent. I knew how to write code and had used various tools, so I thought about whether there were any tools that were better than Jupyter, VS Code, and Mathematica with stronger features. That’s how we came up with the idea of creating the best academic editor or code editor. My first venture aimed to serve one hundred million knowledge workers by providing an IDE + GitHub-style platform for editing and sharing open-source knowledge. However, it “failed” because later on, Jupyter created the first well-known block editor, and Mathematica created the first symbolic structural editor that could parse Lisp-style code freely. To solve their unsolved problems would require revolutionizing the world’s editors. Our target users at the time were algorithm engineers and researchers who had the greatest demand for such tools. However, doing SaaS in China is already difficult, as decision-makers and users are not the same group of people, and bargaining power is not high enough. The company would quickly become sales-driven. We had even reached out to some excellent ministries and 985 universities, but we found it challenging to make any breakthroughs.\n\n\nEntrepreneurship is an unteachable thing that requires learning many things and finding many insights along the way. It is like studying physics; no one understood physics before studying it. If you start with a clear idea, it might not be a particularly significant or interesting thing. So, for my first venture, I used my familiarity with the field as a starting point, but later found that it was not that interesting, and so I debugged my own knowledge.\n\n\nAfter the first venture was terminated, we officially began working on AFFiNE at the end of December 2021. On Day One, our team consisted of three people (laughs): me, our current COO Wei Yipei, and an intern. At that time, we started to seriously plan and figure out how to do this, what kind of people and technology we needed, and who our target customer base was.\n\n\nYipei and I were undergraduate classmates who met at the previously mentioned entrepreneurship competition. Yipei was the organizer of the competition, and I persuaded her to start a business with me.\n\n\n**Q4**: **How does AFFiNE differentiate itself from mature top-tier companies like Notion and Miro?**\n\n\n**Jiachen:** The differentiation between AFFiNE and Notion and Miro is straightforward; people should own their own data. Jobs said, “The people who are most serious about software will make their hardware.” I think he said this before “Software Is Eating The World.” Today, “Software Has Eaten The World.” Therefore, we evolve this into “the people who care most about Infra will create their own SaaS.”\n\n\nJobs saw that the gateway for people to access the internet should be consistent and with as little differentiation as possible. We believe that the ultimate goal of the software is that people can own their own data and control it freely. Today, if you talk about software A, but it’s invisible in software B, there is a problem with the conflict between cloud and local software.On the application side, AFFiNE will not have a particularly large differentiation from Notion and Miro, just like making phone calls with an iPhone is not particularly different from making phone calls with a Nokia. The original words of Jobs were “An iPod, a phone, and an internet communicator.” This magic moment is that people should use tools not only for taking notes with Notion, drawing with Miro, but also for meeting and recording data with Airtable and Zoom. (Editor’s note: On January 9, 2007, Steve Jobs stood on the stage of Macworld and repeated “an iPod, a phone, and an internet communicator” twice. At that time, many people did not realize that these were not three toolchain-independent devices. With laughter and sporadic applause from the audience, a new device called iPhone appeared. At that moment, Apple once again changed the world and ushered in a new era of smartphones.)Our philosophy is also the same. Using AFFiNE’s infrastructure to create a SaaS product in the future should be the most elegant and effortless way, and this is our strategy. So, on the application side, we will not differentiate ourselves from Notion and Miro, but our differentiation will become greater and greater in the future because we are ultimately a platform that does infrastructure.\n\n\n**Q5:** **How do you view other collaboration software, such as Feishu and QingQue?**\n\n\n**Jiachen:**General collaboration tools and ordinary SaaS tools are very different. Ordinary SaaS is often driven by know-how and solidifies best practices from various industries, such as various SOPs, into a tool to improve efficiency, bring more sales leads, or save costs. With AI, many SaaS tools may only have one input box in the future. However, collaboration tools are technology-driven and infrastructure-driven. The difference between the two often lies not in who can do marketing, but in what technology can meet user needs. For example, Microsoft first had .Net, then TypeScript, and then Visual Studio Code. .Net and TypeScript are the foundation of Microsoft’s collaboration tools, which determine what Microsoft’s development ecosystem can achieve.Feishu is the representative of China’s All-in-One and is currently the only product in China with independently controllable technology in rich text, whiteboard, multi-dimensional table, local database, and cloud. These capabilities are based on its technology foundation. Feishu has spent enough money, time, bought enough plans, and done enough self-research. But Microsoft and Google have gone one step further, from language, development tools, and runtime to the ecosystem, all done by themselves. In the entire global scope, the best application development ecosystem and the best toolchain are solidified, and those who really make impressive All-in-One SaaS have their own infrastructure. Ordinary SaaS tools on the market often do very specific and small points and can not iterate the next infrastructure.As an early-stage startup, if we pursue management efficiency, pursue doing 10 things well at the same time, and pursue everyone working 996 to achieve maximum output, we will definitely not be able to compete with large companies. What we can compete with big companies is that our innovation is greater and we see further than them. So we need to be more focused, do subtraction, and only do one thing and do it better. When they do All-in-One SaaS and general application solutions, we only do the best platform for developing collaboration applications. This is the only way to survive.\n\n\nWe kindly inform our readers that due to the extensive nature of this interview, we have decided to divide it into two parts for ease of reading. We would like to express our gratitude for your patience and understanding as we strive to deliver comprehensive and insightful content. To stay updated on the release of the upcoming part, we encourage you to follow our official platform. Thank you for your continued support.\n\n\n\n---\n\n\n**Wanna know more about AFFiNE:**\n\n\n* Wanna know more about AFFiNE with article, can click: [AFFiNE: The Next-Gen Knowledge Base to Notion and Miro | by AFFiNE | Medium](https://medium.com/@affineworkos/affine-the-next-gen-knowledge-base-to-notion-and-miro-403f0afd9fba)\n\n\n* Wanna know more about AFFiNE with video, can click: [https://affine.pro/blog/affine-youtube-release](https://affine.pro/blog/affine-youtube-release)\n\n\n* Wanna experience AFFiNE product, can click: [AFFiNE](https://app.affine.pro/)\n\n\nAFFiNE is still in alpha, but we are continuing to build to a more feature-rich and stable build. Come and join us on our journey over on our media platforms.\n\n\n* Reddit: [https://www.reddit.com/r/Affine/](https://www.reddit.com/r/Affine/)\n\n\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n\n\n* Telegram: [https://t.me/affineworkos](https://t.me/affineworkos)\n\n\n* Twitter: [https://twitter.com/AffineOfficial](https://twitter.com/AffineOfficial)\n\n\n* Medium: [https://medium.com/@affineworkos](https://medium.com/@affineworkos)\n\n\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n\n\n* Official Website: [https://affine.pro/](https://affine.pro/)\n\n\n* Feedback: [https://feedback.affine.pro/boards/feature-requests](https://feedback.affine.pro/boards/feature-requests)\n\n\n",
  "publish": true
}