{
  "title": "What’s new - AFFiNE - 20230922",
  "authors": [
    "Yuhang zhao",
    "Yanxin Lu",
    "Jackie Peng"
  ],
  "tags": [
    "Release Note"
  ],
  "description": "AFFiNE is the alternative of Notion, Miro, and Monday, this article introduces what’s new, and what updates, Improvements, and bug fixes have been released in the Beta version.",
  "created": 1695340800000,
  "updated": 1695340800000,
  "layout": "blog",
  "id": "mlUliKJ1p0",
  "slug": "what-is-new-affine-0922",
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/UVQZ8jvW1PaUnWtWUdwZ_Z7fhwtztzwx6d8hXQciTK8=.webp",
  "md": "---\n\ntitle: \"What’s new - AFFiNE - 20230922\"\n\nauthor: Yuhang zhao, Yanxin Lu, Jackie Peng\n\ntags: Release Note\n\nslug: what-is-new-affine-0922\n\ndescription: \"AFFiNE is the alternative of Notion, Miro, and Monday, this article introduces what’s new, and what updates, Improvements, and bug fixes have been released in the Beta version.\"\n\ncreated: 2023-09-22\n\nupdated: 2023-09-22\n\nlayout: blog\n\npublish: true\n\n---\n\n\n![UVQZ8jvW1PaUnWtWUdwZ_Z7fhwtztzwx6d8hXQciTK8=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/UVQZ8jvW1PaUnWtWUdwZ_Z7fhwtztzwx6d8hXQciTK8=)\n\n\n\n\n\n**The beta is the** **best app for testing upcoming features and providing feedback. This build with cloud has been lightly tested, but is not suitable for production.**\n\n### 1) Cloud Use Guidance:\n\n**① Seamless Login for Instant Connection**\n\nStart your collaborative journey with ease, thanks to our user-friendly login system that eliminates the hassle of complex authentication procedures. Our streamlined process guarantees effortless access to your projects, and we're continuously working to introduce support for multiple email addresses, self-hosting capabilities, and one-click login for your convenience.\n\n\n![lfD81y8p2IRCwMqeXIkpvxzlqFkQ4JJ8E2SOf3Su64E=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/lfD81y8p2IRCwMqeXIkpvxzlqFkQ4JJ8E2SOf3Su64E=)\n\n**② Unlock the Potential of Cloud Workspaces**\n\nExperience the future of collaborative workspaces. Our platform offers secure and flexible cloud workspaces, enabling your team to effortlessly store, access, and collaborate on projects from anywhere. Whether it's documents, presentations, or complex projects, our cloud workspace solution keeps your team connected and productive.\n\n\n\n**③ Enhanced Control with Permission-Based Empowerment**\n\nCollaboration thrives in an environment of trust and control. At AFFiNE Cloud, we've crafted a robust permission system that empowers document owners to dictate edit and view rights. This level of granularity guarantees that sensitive information remains confidential while facilitating collaboration.\n\n* Please note that there might be initial limitations on invitations, so we highly recommend starting with one invite. We have more exciting collaboration features on the horizon, set to launch in our stable version. If you have additional collaboration needs, don't hesitate to reach out to us through AFFiNE Community.\n\n![RFCrZzO0MCUusua-HEbCIbizQamQjtJpskDCRsLL8Kw=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/RFCrZzO0MCUusua-HEbCIbizQamQjtJpskDCRsLL8Kw=)\n\n**④ Unleash Creativity with Collaborative Edgeless Mode**\n\nCollaboration is everywhere, but isn't it time for a fresh perspective? At AFFiNE Cloud, we're redefining collaboration beyond the constraints of traditional document-based approaches.\n\nWith this collaborative whiteboarding feature, you can see each other's presence, all within a shared cloud space. Whiteboarding – a limitless canvas where you can use pens, shapes, images, and connectors to collaborate with others, unlocking the full potential of your imagination.\n\n\n![geVdzkEXxJy55-tagrtTlTRCSJjFXK03lLprTpvrv5M=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/geVdzkEXxJy55-tagrtTlTRCSJjFXK03lLprTpvrv5M=)\n\n**⑤ Single Page Sharing - Precision Collaboration Made Simple**\n\nSharing specific pages without revealing your entire workspace is crucial, and we understand that. At AFFiNE, you no longer have to expose unrelated pages. We prioritize precise collaboration by allowing you to share only what's necessary while securely safeguarding the rest. With just a few clicks, you can distribute documents, reports, and designs to your team, partners,Demo Workspace or clients, maintaining control and tracking changes effortlessly for improved teamwork and communication.\n\n\n![VsmRQKKT_JWfocv6kdTdmSw3-22k1EUrdWeyjhL8xjQ=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/VsmRQKKT_JWfocv6kdTdmSw3-22k1EUrdWeyjhL8xjQ=)\n\n\n\n### 2) Become our early-access sponsor to explore the full experience of Cloud\n\n\n![flDBAikMzQhG8jKLpZtfJH2pOuwCSeLvU8kuuh0bGpw=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/flDBAikMzQhG8jKLpZtfJH2pOuwCSeLvU8kuuh0bGpw=)\n\nJoin us as an early access sponsor for the AFFiNE Cloud, and unlock advanced collaboration capabilities while upholding the local-first nature of your data. As a token of our appreciation, you'll enjoy:\n\n* Early Access, be among the first to experience AFFiNE Cloud's powerful features, including permission settings and control.\n* One-year Free Pro Plan, have a complimentary one-year premium AFFiNE Pro Plan subscription, packed with advanced tools to boost your productivity and creativity.\n* Lifetime 50% Discount on Pro Plan, benefit from a lasting 50% discount as long as you continue to find value in your subscription.\n* Other details:\n  * AFFiNE Cloud enhances collaboration without compromising your data's local-first\n  * The free plan will remain available and always an option, with ongoing improvements.\n* More details: [https://affine.pro/blog/affine-cloud-early-access](https://affine.pro/blog/affine-cloud-early-access)\n",
  "publish": true
}