{
  "id": "rZ4nOj8_pSVIpn7NiUZ67",
  "title": "What's new - AFFiNE - 20240522",
  "createDate": 1716369740294,
  "updatedDate": 1716462192751,
  "guid": "rZ4nOj8_pSVIpn7NiUZ67",
  "author": "Yixuan Guo, Shuangcao Li",
  "tags": [
    "Release Note"
  ],
  "slug": "whats-new-affine-20240522",
  "description": "AFFiNE is the alternative of Notion, Miro, and Monday, this article introduces what’s new, and what updates, Improvements, and bug fixes have been released in the latest version.",
  "created": 1716336000000,
  "updated": 1716336000000,
  "layout": "blog",
  "publish": true,
  "authors": [
    "Yixuan Guo",
    "Shuangcao Li"
  ],
  "md": "In our latest release, we have introduced AFFiNE AI, a breakthrough artificial intelligence feature that enhances your ability to handle a wide range of creative tasks. With AFFiNE AI, you can write, draw and present with total intelligence. Whether it's refining and editing documents, brainstorming, creating captivating presentations, or sketching visual ideas, AFFiNE AI simplifies your workflow and instantly boosts your creativity.\n\n\n# **Write Better:  Enhance Your Writing Process at Every Stage**\n\n\nFor enhanced writing support, we offer a range of features to suit your needs, from word selection to full-text writing. Whether you're creating content, brainstorming, professionally rewriting, adjusting tone, or correcting spelling and grammar, simply select the text, click \"Ask AI\", select the specific feature button, and AFFiNE AI will make your writing more vivid and accurate. For writing, these are some of the features we offer for your reference:\n\n\n* Edit: translate, change tone, shorten/lengthen, correct spelling/grammar, fix spelling/grammar.\n\n\n* Generate: summarize, create headings/outlines.\n\n\n* Draft Writing: compose an article/tweet/poem/blog.\n\n\nIf you have any other requests, just tap the right sidebar to speak your mind in the Chatbox and the AFFiNE AI assistant will respond quickly!\n\n\n<video muted autoplay loop preload=\"auto\" playsinline>\n  <source src=\"https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/UHxST_t5Q_twEjYK-jYBtGIhkcU91YilmvabE7GCZQA=\" type=\"video/mp4\" />\n</video>\n\n\n\n\n\n# **Draw Better: Visualize Your Ideas with Precision**\n\n\nAFFiNE AI transforms your outlines or ideas into compelling visual creations: just type in a few short sentences and you'll instantly receive stunning images. AFFiNE AI helps you express your ideas clearly in a few tens of seconds.\n\n\nGenerate an image: Switch to edgeless mode by selecting all the content and clicking \"Generate an image.\"Multiple unique images can be generated by clicking multiple times. Additionally, click on the image, select \"Explain this image,\" you will receive a comprehensive explanation of the image.\n\n\n<video muted autoplay loop preload=\"auto\" playsinline>\n  <source src=\"https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/D3mR1l9arpur_KRZcI6MLZq_OH1rFIwZ-5GIlgDuZzQ=\" type=\"video/mp4\" />\n</video>\n\n\n\n\n\n# **Present better(beta): Craft polished,presentation-readyslides with just one click**\n\n\nIn the latest version, AFFiNE AI can convert a topic word into a high-quality PPT with just one click, so that users can focus on their own content, while AFFiNE AI is responsible for the design and the output of the basic content. Once the presentation is ready, users can effortlessly present it directly on AFFiNE, facilitating an efficient visual display that enhances your presentation.\n\n\n<video muted autoplay loop preload=\"auto\" playsinline>\n  <source src=\"https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/vujw61W_l_BfAjiH7CfJriNMyqZYEN-U7DswVC-6qIA=\" type=\"video/quicktime\" />\n</video>\n\n\n\n\n\n**Mind Map: expand thinking and untangle complexity with magic mindmap**\n\n\nThe newly launched mindmap generation function of AFFiNE AI can, based on a required theme prompt word, with a simple click. Even after the AI generates the answer, you can select the template you want, and AFFiNE AI will enable your memories, observations, thoughts, and insights to expand limitlessly on a canvas.\n\n\n\n![4pvjZK8gFhTZg36160Sv4Y6DTyEfof7H7FjV9lHCtuw=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/4pvjZK8gFhTZg36160Sv4Y6DTyEfof7H7FjV9lHCtuw=)\n\n\n\n\n\n**Make it  real(beta): From concept to completion, turn ideas into reality.**\n\n\nThe \"Make It Real\" function of AFFiNE AI can easily transform sketches into application components effortlessly. This feature empowers designers to rapidly visualize and bring their creations to life, bridging the gap between concept and reality. The toolset of affine includes an array of drawing instruments such as brushes, arrows, polygons and pencils, enabling detailed and precise designs. Adding to its robust feature set, \"Make It Real\" also allows users to replicate complex user interfaces and even create interactive games. Designers can craft functional games such as a ticking dial clock, a classic snake game, or a Pong game directly from simple sketches.\n\n\n<video muted autoplay loop preload=\"auto\" playsinline>\n  <source src=\"https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/3yJqWYNMz6lnhk-rhcHzn8brJTThNI0y29y2_qKWvOI=\" type=\"video/mp4\" />\n</video>\n\n\n# \n\n\n# **Contact us**\n\n\n* Official Website: [https://AFFiNE.pro/](https://affine.pro/)\n\n\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n\n\n* Twitter: [https://twitter.com/AFFiNEOfficial](https://twitter.com/AffineOfficial)\n\n\n* Community: [https://community.AFFiNE.pro/home](https://community.affine.pro/home)\n\n\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n\n\n* Telegram: [https://t.me/AFFiNEworkos](https://t.me/affineworkos)\n\n\n",
  "valid": false
}