{
  "id": "OC22e0rx5K",
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/Qt7T2MfeOwoxcvcSA_Eesr5eo9WlpC4aGnN8SSw6N-g=",
  "coverAlt": "",
  "md": "**The beta is the** **best app for testing upcoming features and providing us with feedback. This build has been lightly tested but is not suitable for production**\n\n\n## 1.What's new\n\n\nHello to all AFFiNE users, We are delighted to announce the release of the beta version, which incorporates a range of new features and improvements that we have been diligently working on behind the scenes for the past few weeks.\n\n\n### 1) **New features**\n\n\nExciting updates within AFFiNE: this time we bring so many exciting new features like the **Text highlight, Database Kanban, Presentation mode, and Edgeless TOC**,kick off your journey to explore the fancy stuff!\n\n\n### 2) **Improvements**\n\n\nOur latest improvement to AFFiNE bringsa series of iterations and optimizations regarding the **Multiple block selection supported, Improved readability of the overall UI in Dark mode,** which will bring your user experience to the next level.\n\n\n### 3) Bug fixed\n\n\nA series of bugs have been fixed, which allow more slick and intuitive use of AFFiNE for our users.\n\n\n## 2.To get started, download the latest beta version\n\n\n* We invite you to download the **[beta version](https://affine.pro/download)** first to embark on an exciting journey with our latest enhancements. This will allow you to be among the first to experience the positive benefits we have in store for our valued users.\n\n\n* Want to learn how to get even more out of [AFFiNE](https://affine.pro/)? Join the conversation in our [growing AFFiNE community](https://community.affine.pro/home) and get inspired by others, give feedback, or [ask any questions](https://community.affine.pro/c/questions-answers/) you may have.\n\n\n## 3.Detailed iteration\n\n\n### 1) New Features\n\n\n* **Text Highlight**\n\n\n  * Text Highlight allows you to easily highlight and emphasize important text within Page mode. Simply select the text you want to highlight and choose the highlighted color of your preference from the toolbar.\n\n\n  <img\n  src=\"https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/CkUr84Fp_vp_9DzYmHASY87M2Ac-3Zic72bEY_q3CJk=\"\n  alt=\"\"\n  width=\"539.6614379882812\"\n  height=\"399.81768798828125\"\n/>\n\n![CkUr84Fp_vp_9DzYmHASY87M2Ac-3Zic72bEY_q3CJk=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/CkUr84Fp_vp_9DzYmHASY87M2Ac-3Zic72bEY_q3CJk=)\n\n\n* **Database Kanban**\n\n\n  * With Kanban view, you can visualize your data as cards on a board, making it easy to track progress and manage tasks.\n\n\n\n![ewYPtjXyiVWT-QtZlG1Lc2gyE8164gOXn7cWgcbpl1I=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/ewYPtjXyiVWT-QtZlG1Lc2gyE8164gOXn7cWgcbpl1I=)\n\n\n\n\n\n* **Presentation mode**\n\n\n  * You can now create multiple frames (referred to as slides) and seamlessly display your presentation. Experience the pleasure of showcasing your content within our edgeless mode. This is another step towards achieving our all-in-one goal!\n\n\n  \n![qyV8voX83IdtbuodUR91sIFRXftc5bgnxOxZTnKZ5e8=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/qyV8voX83IdtbuodUR91sIFRXftc5bgnxOxZTnKZ5e8=)\n\n\n### 2) Improvements\n\n\n* **Multiple block selections supported**\n\n\n  * We know our users complained about the lack of multiple block selections all the time. Now you can simultaneously select and edit multiple content blocks, streamlining tasks and boosting efficiency!\n\n\n  <img\n  src=\"https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/Dx4k0ATDU6s_1yQVcz92oxb27agSgA1NKUb9-iU7Jls=\"\n  alt=\"\"\n  width=\"569.6614379882812\"\n  height=\"420.8984375\"\n/>\n  \n![Dx4k0ATDU6s_1yQVcz92oxb27agSgA1NKUb9-iU7Jls=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/Dx4k0ATDU6s_1yQVcz92oxb27agSgA1NKUb9-iU7Jls=)\n\n\n* **Improved readability of the overall UI in Dark mode**\n\n\n  * Reducing your eye strain while offering improved readability matters a lot, so we took time optimizing it and making it particularly beneficial for use in low-light conditions and contributing to a more visually comfortable user experience.\n\n\n\n![awWSF4vNHXuptVYzeEfnOg-pVs0s-IsOyukavmPltYw=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/awWSF4vNHXuptVYzeEfnOg-pVs0s-IsOyukavmPltYw=)\n\n\n### 3) Bug fixed\n\n\n* Fixed: Unable to use block hub and its button duplicates\n\n\n  * Details: You can now trigger Block Hub without any hindrance, and the issue causing button duplication has been fixed as well.\n\n\n  * Link: [https://github.com/toeverything/blocksuite/issues/3487](https://github.com/toeverything/blocksuite/issues/3487)\n\n\n* Fixed: Wrong background colour on copied PNG in edgeless mode\n\n\n  * Details: We rectified the problem of incorrect background colour when copying PNG images in edgeless mode. The copied PNG images now maintain accurate background colours, ensuring you a consistent and accurate visual experience.\n\n\n  * Link: [https://github.com/toeverything/blocksuite/issues/3489](https://github.com/toeverything/blocksuite/issues/3489)\n\n\n* Fixed: Database - selection will flash when selecting the text\n\n\n  * Details: We fixed the flashing effect observed while selecting text in the database. Text selection now occurs seamlessly without any disruptive flashing, enhancing your user experience and readability.\n\n\n  * Link: [https://github.com/toeverything/blocksuite/issues/3510](https://github.com/toeverything/blocksuite/issues/3510)\n\n\n* Fixed: When clicking the page title in Page mode, it has no response.\n\n\n  * Details: We have fixed the non-responsive behaviour when clicking on a page title. Now, clicking the page title triggers the expected response, which ensures you a more user-friendly navigation experience.\n\n\n  * Link: [https://github.com/toeverything/AFFiNE/issues/3400](https://github.com/toeverything/AFFiNE/issues/3400)\n\n\n* Fixed: Copy as PNG format error\n\n\n  * Details: We have fixed the shading problems of the Copy-as-PNG functionality. You can now utilize this feature without encountering any shading issues, ensuring accurate and high-quality outputs.\n\n\n  * Link: [https://github.com/toeverything/blocksuite/issues/3615](https://github.com/toeverything/blocksuite/issues/3615)\n\n\nOh, by the way, we're excited to announce our newly launched sponsorship project and would like to extend an exclusive invitation to you.\n\n\n\n![Adgcn71WTJjCLnGBUMnuOS7QcI2GTiQ9HKzqfUvQEu4=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/Adgcn71WTJjCLnGBUMnuOS7QcI2GTiQ9HKzqfUvQEu4=)\n\n\nJoin us as an early access sponsor for the AFFiNE Cloud, and unlock advanced collaboration capabilities while upholding the local-first nature of your data. As a token of our appreciation, **you'll enjoy**:\n\n\n* **Early Access**, be among the first to experience AFFiNE Cloud's powerful features, including permission settings and control.\n\n\n* **One-year Free Pro Plan**, have a complimentary one-year premium AFFiNE Pro Plan subscription, packed with advanced tools to boost your productivity and creativity.\n\n\n* **Permanent 50% Discount**, benefit from a lasting 50% discount as long as you continue to find value in your subscription.\n\n\n**Other details:**\n\n\n* AFFiNE Cloud enhances collaboration without compromising your data's local-first\n\n\n* The free plan will remain available and always an option, with ongoing improvements.\n\n\n* More details: [https://affine.pro/blog/affine-cloud-early-access](https://affine.pro/blog/affine-cloud-early-access)\n\n\n",
  "title": "What’s new - AFFiNE - 20230818",
  "createDate": 1692336685033,
  "favorite": false,
  "guid": "d35538af-33e3-44ec-9ebe-dd9efc0abd75",
  "author": "Xuan Pang, Jackie Peng",
  "tags": [
    "Release Note"
  ],
  "slug": "what-is-new-affine-0818",
  "description": "AFFiNE is the alternative of Notion, Miro, and Monday, this article introduces what’s new, and what updates, improvements, and bug fixes have been released in the Stable version.",
  "created": 1692316800000,
  "updated": 1692316800000,
  "layout": "blog",
  "publish": true,
  "authors": [
    "Xuan Pang",
    "Jackie Peng"
  ],
  "valid": true,
  "relatedBlogIds": [],
  "linkedPageIds": [],
  "relatedBlogs": []
}