{
  "title": "What’s new  -  AFFiNE- 20230601",
  "authors": [
    "Jackie Peng"
  ],
  "tags": [
    "Release Note"
  ],
  "description": "AFFiNE is the alternative of Notion, Miro, and Monday, this article introduces what’s new, and what updates, Improvements, and bug fixes have been released in the Stable version.",
  "created": 1685577600000,
  "updated": 1685577600000,
  "layout": "blog",
  "id": "6ENM9DKA0m",
  "slug": "whats-new-affine-0601",
  "cover": "/blobs/kqxYZaWThvzi3oMCESjramVRrHukqWYXBR-_W0I4A80=",
  "md": "---\n\n\ntitle: What’s new  -  AFFiNE- 20230601\n\n\nauthor: Jackie Peng\n\n\ntags: Release Note\n\n\nslug: whats-new-affine-0601\n\n\ndescription: AFFiNE is the alternative of Notion, Miro, and Monday, this article introduces what’s new, and what updates, Improvements, and bug fixes have been released in the Stable version.\n\n\ncreated: 2023-06-01\n\n\nupdated: 2023-06-01\n\n\nlayout: blog\n\n\npublish: True\n\n\n---\n\n\n\n![kqxYZaWThvzi3oMCESjramVRrHukqWYXBR-_W0I4A80=](/blobs/kqxYZaWThvzi3oMCESjramVRrHukqWYXBR-_W0I4A80=)\n\n\nThe stable version is the most reliable and well-tested version, perfect for users who want a smooth and consistent experience without worrying about crashes or glitches.\n\n\n* Please note that this article only compares it with the current beta version and it already incorporates improvements from the current beta version. So if you wanna know more in relation to what improvements we've made within the current beta version, you may wanna [check this article](https://affine.pro/blog/whats-new-affine-0518).\n\n\n## 1.What’s new\n\n\nHello to all AFFiNE users, whether you use it individually, with friends and family, or as part of a team.We are thrilled to announce the introduction of the AFFiNE stable version, incorporating a range of significant changes that we have been diligently working on behind the scenes for the past few weeks.\n\n\n### 1) **New features**\n\n\nExperience a transformational upgrade with AFFiNE's latest changes - **Notion/html/markdown import-supported**, **well-looked bookmark** to facilitate user experiences of **better saving, organizing and accessing the online pages**\n\n\n### 2) **Improvements**\n\n\nOur latest improvement to AFFiNE brings not only a seamless and visually stunning user interface, featuring an **all-page UI update with filter options**, but also a **significantly improved and stabilized editing experience in terms of the paper mode.**\n\n\n### 3) Bug fixed\n\n\nA series of bugs have been fixed, which allow more slick and intuitive use of AFFiNE for our users.\n\n\n## 2.To get started, download the latest stable version\n\n\n\n![XfWQVrdBQXHsXEw3j8NQvgiHh0VPlmDdG44Eljxu6wU=](/blobs/XfWQVrdBQXHsXEw3j8NQvgiHh0VPlmDdG44Eljxu6wU=)\n\n\n* We invite you to download the [stable version](https://affine.pro/download) first to embark on an exciting journey with our latest enhancements. This will allow you to be among the first to experience the positive benefits we have in store for our valued users.\n\n\n* Want to learn how to get even more out of [AFFiNE](https://affine.pro/)? Join the conversation in our [growing AFFiNE community](https://community.affine.pro/home) and get inspired by others, give feedback, or [ask any questions](https://community.affine.pro/c/questions-answers/) you may have.\n\n\n## 3.Detailed iteration\n\n\n### 1) New Features\n\n\n* Notion/html/markdown/.db import-supported\n\n\n  * Effortlessly import Notion, HTML, or Markdown content into AFFiNE with just a few simple clicks, preserving formatting, and structure, and saving time, enhancing user experience. Say goodbye to the complicated process of manually converting and adjusting content.\n\n\n  * Link: [https://github.com/toeverything/AFFiNE/pull/2533](https://github.com/toeverything/AFFiNE/pull/2533)\n\n\n  * More detail: https://affine.pro/blog/import-your-data-from-notion-into-affine\n\n\n  * Note that importing from notion is experimental (particularly the database import is invalid), and now only supports page-by-page import, which may cause some inconvenience. We welcome any feedback from our users.\n\n\n\n![Funez4FG6_YYPlgBYoKy3M7F2NJLCtwrE7NplHuuB4Q=](/blobs/Funez4FG6_YYPlgBYoKy3M7F2NJLCtwrE7NplHuuB4Q=)\n\n\n* Bookmark supported in the paper mode\n\n\n  * This stable version provides a meticulously designed bookmark feature within it, offering users a visually appealing and efficient solution for saving, organizing, and accessing online pages. It ultimately fosters productivity and empowers users to build a valuable collection of online resources.\n\n\n  * Link: [https://github.com/toeverything/AFFiNE/pull/2458](https://github.com/toeverything/AFFiNE/pull/2458)\n\n\n  \n![Mk4bAD2Dj7RWsY9M58yCcoEgfb-Zyy-EYYRql4po_cY=](/blobs/Mk4bAD2Dj7RWsY9M58yCcoEgfb-Zyy-EYYRql4po_cY=)\n\n\n  ### 2) Improvements\n\n\n  * Powerful Edgeless mode\n\n\n    * Visualize and connect your ideas smoothly with better cartoon-style shapes, slick pens, and connectors. No constraints. Limited only by your imagination. Ohhh, by the way, images now are supported to upload!! We just make everything easy for you. Now you may enjoy your creative time!\n\n\n    * Link: [https://github.com/toeverything/blocksuite/pull/2575](https://github.com/toeverything/blocksuite/pull/2575)\n\n\n\n![6ANoWk9Wn5mf2IsgS-yy-MRN-cf1iRf4VZfF9ihUAgs=](/blobs/6ANoWk9Wn5mf2IsgS-yy-MRN-cf1iRf4VZfF9ihUAgs=)\n\n\n* Featuring an all-page UI update with filter options\n\n\n  * Users can now effortlessly access the all-page, which enables them to conveniently sort previous articles in ascending or descending order, or favourites with the filter function. Enjoy efficient organization, quick access to desired content, and a seamless browsing experience.\n\n\n  * Link: [https://github.com/toeverything/AFFiNE/pull/2510](https://github.com/toeverything/AFFiNE/pull/2510)\n\n\n\n![1g2H5Hhy5gspGUGP2LnD5e2O2dyKzVpE-6rvabbR5oA=](/blobs/1g2H5Hhy5gspGUGP2LnD5e2O2dyKzVpE-6rvabbR5oA=)\n\n\n* Blocksuite update (editor experience update)\n\n\n  * With a series of meticulous adjustments, refinements, and enhancements, Blocksuite now offers users an enhanced and stable editing experience.\n\n\n  * Link:[Release v0.6.0 · toeverything/blocksuite (github.com)](https://github.com/toeverything/blocksuite/releases/tag/v0.6.0)\n\n\n* Export and move folders are now saved with suffixes of \".affine\"\n\n\n  * the automatic saving of workspaces with the empowering suffix of \"affine.\" This feature ensures seamless document distribution, searching and finding, elevating collaboration and fostering a cohesive environment for optimized productivity.\n\n\n  * Link: [https://github.com/toeverything/AFFiNE/pull/2491](https://github.com/toeverything/AFFiNE/pull/2491)\n\n\n\n![94w56ULvwV3scsCUTNKZAPZ-m5ubrC6i6LPXfClsV0c=](/blobs/94w56ULvwV3scsCUTNKZAPZ-m5ubrC6i6LPXfClsV0c=)\n\n\n### 3) Bug fixed\n\n\n* Fixed: Replace new Windows install loading gif\n\n\n  * Details: The updated loading GIF not only provides a visually appealing and engaging animation, but it also ensures a smoother and more streamlined installation process. Users will now enjoy faster loading times, reducing the waiting period during the initial setup.\n\n\n  * Link: [https://github.com/toeverything/AFFiNE/pull/2513](https://github.com/toeverything/AFFiNE/pull/2513)\n\n\n* Fixed: tweak all page styles\n\n\n  * Details: Users now can appreciate the corresponding page styles on the all-page, no more weird and different font sizes to distract their attention.\n\n\n  * Link: [https://github.com/toeverything/AFFiNE/pull/2540](https://github.com/toeverything/AFFiNE/pull/2540)\n\n\n* Fixed: Update user guide style\n\n\n  * Details: Experience an updated user guide style in this version, providing users with a clear and intuitive reference for maximizing their productivity.\n\n\n  * Link: [https://github.com/toeverything/AFFiNE/pull/2536](https://github.com/toeverything/AFFiNE/pull/2536)\n\n\n* Fixed: Cannot delete last workspace\n\n\n  * Details: The problem of invalid implementation of deleting the workspace now has been solved, no worries on this part anymore.\n\n\n  * Link: [https://github.com/toeverything/AFFiNE/pull/2537](https://github.com/toeverything/AFFiNE/pull/2537)\n\n\n* Fixed: adjust some Windows style issues\n\n\n  * Details: Some windows related issues have now been resolved.\n\n\n  * Link: [https://github.com/toeverything/AFFiNE/pull/2454](https://github.com/toeverything/AFFiNE/pull/2454)\n\n\nWe highly value your feedback and ideas, as you are of utmost importance to us. We would be absolutely thrilled to hear what aspects of our work you find most useful and which areas you feel require improvement. Please do not hesitate to get in touch with us through any of our social media channels to share your valuable insights. We are eagerly looking forward to hearing from you!!\n\n\n* Official Website: [https://affine.pro/](https://affine.pro/)\n\n\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n\n\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n\n\n* Telegram: [https://t.me/affineworkos](https://t.me/affineworkos)\n\n\n",
  "publish": true
}