{
  "title": "What’s new - AFFiNE - 20230728",
  "authors": [
    "Jackie Peng",
    "Yanxi Liu"
  ],
  "tags": [
    "Release Note"
  ],
  "description": "AFFiNE is the alternative of Notion, Miro, and Monday, this article introduces what’s new, and what updates, improvements, and bug fixes have been released in the Stable version.",
  "created": 1690502400000,
  "updated": 1690502400000,
  "layout": "blog",
  "id": "qxm5MbeCgz",
  "slug": "what-is-new-affine-0728",
  "cover": "https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/v7aTUh1LAwe_qyBxjyGjgEGeVGp2l1Ra0GAmHbM4HkI=.webp",
  "md": "---\n\ntitle: \"What’s new - AFFiNE - 20230728\"\n\nauthor: Jackie Peng, Yanxi Liu\n\ntags: Release Note\n\nslug: what-is-new-affine-0728\n\ndescription:  AFFiNE is the alternative of Notion, Miro, and Monday, this article introduces what’s new, and what updates, improvements, and bug fixes have been released in the Stable version.\n\ncreated: 2023-07-28\n\nupdated: 2023-07-28\n\nlayout: blog\n\npublish: true\n\n---\n\nStable is the most reliable and well-tested version, perfect for users who want a smooth and consistent experience without worrying about crashes or glitches. For more detailed information, we encourage you to check our previous articles on the launch week preview 0.7.0, which you can find at the end of this publication.\n\n_**Kind reminder: If you have stored your data in the previous stable version, we recommend you restart the app or try using the \"**_⌘_**+R\" or \"Ctrl+R\" shortcut to refresh the system and retrieve your data.**_\n\n## 1.What’s new\n\nHello to all AFFiNE users, We are delighted to announce the new release of the stable version, which incorporates a range of new features and improvements that we have been diligently working on behind the scenes for the past few weeks.\n\n### 1) **New features**\n\nExciting updates within AFFiNE: this time, we bring so many exciting new features like the **Doc filter**, **Collections**, **Page tag**, **backlinks supported**, **Blockspicer,** **and** **a** **powerful** **database**. Kick off your journey to explore fancy stuff!\n\n### 2) **Improvements**\n\nOur latest improvement to AFFiNE brings a series of iterations and optimizations regarding the **New** **Settings** **Page**, **PDF** **&** **PNG** **Export,** **and** **Enhanced** **UI/UX** **Experience,** which will bring your user experience to the next level.\n\n### 3) Bug fixed\n\nA series of bugs have been fixed, which allow more slick and intuitive use of AFFiNE for our users.\n\n## 2.To get started, download the latest stable version\n\n\n![v7aTUh1LAwe_qyBxjyGjgEGeVGp2l1Ra0GAmHbM4HkI=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/v7aTUh1LAwe_qyBxjyGjgEGeVGp2l1Ra0GAmHbM4HkI=)\n\n* We invite you to download the **[Stable version](https://affine.pro/download)** first to embark on an exciting journey with our latest enhancements. This will allow you to be among the first to experience the positive benefits we have in store for our valued users.\n* Want to learn how to get even more out of [AFFiNE](https://affine.pro/)? Join the conversation in our [growing AFFiNE community](https://community.affine.pro/home) and get inspired by others, give feedback, or [ask any questions](https://community.affine.pro/c/questions-answers/) you may have.\n## 3. Detailed iteration\n\n### 1) **New features**\n\n* Doc filter & Collections\n  * Document filter: The recently introduced document filter allows users to efficiently navigate through the documents using date ranges, favorites, and tags.\n  \n![KSzOi0HHfUE3MHiWFE1sb7xKV4LOGrVFoQVixdqZQpI=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/KSzOi0HHfUE3MHiWFE1sb7xKV4LOGrVFoQVixdqZQpI=)\n\n  * Collections: Users can easily define criteria, gather filtered pages, and seamlessly curate frequently accessed content. This ensures efficient organization, easy retrieval, and comprehensive management of data.\n  \n![lWmboopIBpGPXguszJKPus_9hg3AgCrQUUmJARNPtJQ=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/lWmboopIBpGPXguszJKPus_9hg3AgCrQUUmJARNPtJQ=)\n\n  * Page tag\n    * Experiencing an abundance of pages? Fear not! You can now employ descriptive labels to tag your content, simplifying the process of finding and accessing it whenever needed.\n\n![CgxJfxH0NgPs6vyUnGLDNyJXoZf9DNl8NYJwo5TZ25I=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/CgxJfxH0NgPs6vyUnGLDNyJXoZf9DNl8NYJwo5TZ25I=)\n\n* Backlinks support\n  * Transform any link into a backlink with ease, now featuring enhanced information previews for better clarity and quick access to all your previous pages.\n\n![0ZvMGNB3m1GojJ4VU21vNjIAwc9PAg-TsXR1dTJQDcg=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/0ZvMGNB3m1GojJ4VU21vNjIAwc9PAg-TsXR1dTJQDcg=)\n\n* Powerful database\n  * With a simple click, effortlessly convert your text into structured tables, presenting information in a visually appealing manner. Bid farewell to the cumbersome task of manually inputting text cell by cell into the database.\n\n![wzNppJMgVjC8ThVR9TlhVkPu5OXTEsEsqnuv-Xmrr0g=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/wzNppJMgVjC8ThVR9TlhVkPu5OXTEsEsqnuv-Xmrr0g=)\n\n* Say goodbye to tedious manual adjustments! You can now easily rearrange your table columns by simply dragging them to your desired positions. No more hassle!\n\n![wzNppJMgVjC8ThVR9TlhVkPu5OXTEsEsqnuv-Xmrr0g=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/wzNppJMgVjC8ThVR9TlhVkPu5OXTEsEsqnuv-Xmrr0g=)\n\n* Quick Access to External Resources with hyperlinks\n\n![G6CMsggjutVcZaot4zLiuj_PQugl_SxseczPL-fMygo=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/G6CMsggjutVcZaot4zLiuj_PQugl_SxseczPL-fMygo=)\n\n* Blockspicer\n  * To provide you with enhanced customization options, we are introducing a pair of scissors tool that allows you to divide your creations into as many pieces as you desire, unlocking more possibilities for the layout of the edgeless mode. Get creative!\n  \n![3TFGwfygZi1ykMGTGdJOvICIyYvtWg3FW-z7bKEVDhM=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/3TFGwfygZi1ykMGTGdJOvICIyYvtWg3FW-z7bKEVDhM=)\n\n### 2) Improvements\n\n* New Settings Page\n  * Personalize your note-taking environment with our new pop-up settings page. Better dark-mode settings and a translucent sidebar are available now.\n\n![Wo5IpH2IIpnrEw30VfdmZgjL4w4bCaUp90yGRv5_nIo=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/Wo5IpH2IIpnrEw30VfdmZgjL4w4bCaUp90yGRv5_nIo=)\n\n* PDF &amp; PNG Export\n  * We are excited to announce that both PDF and PNG formats are now supported for exporting! Feel free to share your documents effortlessly in whichever format suits you best. Enjoy the seamless sharing experience!\n\n![7aaWXOkOPNEHl2gVWp0LcY9jUYoKF1PsqejKfO1X1fQ=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/7aaWXOkOPNEHl2gVWp0LcY9jUYoKF1PsqejKfO1X1fQ=)\n\n* Enhanced UI/UX Experience\n  * New Edgeless Toolbar: In edgeless mode, we've completely redesigned the toolbar to elevate its visual appeal and interactivity. With intuitive symbols, you'll enjoy a more engaging and user-friendly interface.\n  \n![9vpoW3K_qpmoYB3r4uWR8fzJbEWqrDjn5gFQ3IeHoxE=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/9vpoW3K_qpmoYB3r4uWR8fzJbEWqrDjn5gFQ3IeHoxE=)\n\n  * New Titlebar: We've crafted a unique visual experience for Windows users, ensuring seamless harmony between the Titlebar and the page design. Enjoy the cohesive and aesthetic interface!\n  \n![orMPWEgelZYCBw4dU_HXVQp-jhr9icO9dIyTLc7sCro=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/orMPWEgelZYCBw4dU_HXVQp-jhr9icO9dIyTLc7sCro=)\n\n  * Full-width mode supported: This enhancement will significantly improve your page viewing experience.\n  \n![Q85_3R3Lo9tSqSHv_REmdZNohewjY7iIC49lxb73IKM=](https://app.affine.pro/api/workspace/H6vffRmJbCfA-r3kq_36_/blob/Q85_3R3Lo9tSqSHv_REmdZNohewjY7iIC49lxb73IKM=)\n\n### 3) Bug fixed\n\n* Fixed: Edgeless fatal crash when editing on the first load\n  * Details: we know this bug causes quite negative implications and experiences, so we took days on fixing it, and now there's no fatal crash within Edgeless anymore\n  * Link: [https://github.com/toeverything/AFFiNE/issues/3141](https://github.com/toeverything/AFFiNE/issues/3141)\n* Fixed: When using the database, you can not change the title name if you add a new column.\n  * Details: This bug has been noticed and solved properly, now no constraints that will cause any impediments to you anymore.\n  * Link: [https://github.com/toeverything/blocksuite/issues/3069](https://github.com/toeverything/blocksuite/issues/3069)\n* Fixed: Can the Delete key be used as the same function as the backspace\n  * Details: With the efforts made, now the issue no longer exists, you can use the backspace just like the delete to erase the content you just created. No more impediments that contradict your implementation habit or behavior.\n  * Link: [https://github.com/toeverything/blocksuite/issues/2550](https://github.com/toeverything/blocksuite/issues/2550)\n* Fixed: the image was lost after exporting\n  * Details: This bug has already been fixed thanks to the developer's efforts, now, you will get full experience of exporting your file without any concern to your photos.\n  * Link: [https://github.com/toeverything/AFFiNE/pull/3150](https://github.com/toeverything/AFFiNE/pull/3150)\n* Fixed: Wrong background color on copied PNG in edgeless mode\n  * Details: Previously, when changing the block color into different colors and choosing \"Copy as PNG,\" the pasted PNG image showed errors. This issue has been resolved, and the PNG image now appears correctly without any mistakes.\n  * Link: [https://github.com/toeverything/blocksuite/issues/3489](https://github.com/toeverything/blocksuite/issues/3489)\n* Fixed: Content text lost when using copy-as-PNG with shape and text inside\n  * Details: Previously, using \"Copy as PNG\" with shapes and text inside resulted in the loss of text content. Now, when using this function, both shapes and text are preserved accurately in the pasted PNG image.\n  * Link: [https://github.com/toeverything/blocksuite/issues/3492](https://github.com/toeverything/blocksuite/issues/3492)\nWe highly value your feedback and ideas, as you are of utmost importance to us. We would be absolutely thrilled to hear what aspects of our work you find most useful and which areas you feel require improvement. Please do not hesitate to get in touch with us through any of our social media channels to share your valuable insights. We are eagerly looking forward to hearing from you!!\n\n* Official Website: [https://affine.pro/](https://affine.pro/)\n* GitHub: [https://github.com/toeverything/AFFiNE](https://github.com/toeverything/AFFiNE)\n* Discord: [https://discord.gg/Arn7TqJBvG](https://discord.gg/Arn7TqJBvG)\n* Telegram: [https://t.me/affineworkos](https://t.me/affineworkos)\n",
  "publish": true
}