{
  "title": "Why you should try AFFiNE: Tag-app system",
  "authors": [
    "Jiachen He",
    "Fangyuan Zheng",
    "Christopher Smolak",
    "Yipei Wei",
    "Fanjing Zhang"
  ],
  "tags": [
    "User Guide"
  ],
  "description": "Tags are a useful way to get an idea quickly of what a text is trying to say and its context",
  "created": 1660953600000,
  "updated": 1660953600000,
  "layout": "blog",
  "id": "710436ef1e8d4524a3f2caaa99b344aa",
  "slug": "why-you-should-try-affine-tag-app-system",
  "cover": "https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/sLi_TO1GjCda4RfgjfX-_RMpLrgPq2q_DulioeZGS-Q=.webp",
  "md": "---\n\ntitle: \"Why you should try AFFiNE: Tag-app system\"\n\nauthor: Jiachen He, Fangyuan Zheng, Christopher Smolak, Yipei Wei, Fanjing Zhang\n\ntags: User Guide\n\nslug: why-you-should-try-affine-tag-app-system\n\ndescription: Tags are a useful way to get an idea quickly of what a text is trying to say and its context\n\ncreated: 2022-08-20\n\nupdated: 2022-08-20\n\nlayout: blog\n\npublish: true\n\n---\n\n\n![sLi_TO1GjCda4RfgjfX-_RMpLrgPq2q_DulioeZGS-Q=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/sLi_TO1GjCda4RfgjfX-_RMpLrgPq2q_DulioeZGS-Q=.webp)\n\nTags are a useful way to get an idea quickly of what a text is trying to say and its context. When reading an article, it is also possible to use tags to determine in advance whether it is what we are looking for. In modern note taking & check list apps, tags are greatly extended. These \"#tags\" can be tags, attached files, locations, time stamps, timers, images, or links. Tags can save us time and make our work more efficient.Tags are usually found in task management tools and are used to label lists of tasks. For example, who the task is assigned to, which department it belongs to, etc. For AFFiNE, we hope to use tags to help us mark up the structure of articles, or to synchronise them with text state transitions, so that tags can be extended more flexibly to help our users collaborate better.\n\n## **Key Features：**\n\n### **1. Progress & Status Management**\n\nThe labelling system not only provides basic labelling functionality for each block, but also helps with progress status management. AFFiNE supports a seamless transition between kanban and text views, so that tasks under 'not started' and 'in process' in the kanban board are converted to text and the corresponding text is added with a label like 'no started'. The status of these labels is also updated as the Kanban board is updated.\n\n\n![fnBhPupCHKE8J-OMeGLFRIDyKJ5Pq8ROqh0lKUKrvm4=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/fnBhPupCHKE8J-OMeGLFRIDyKJ5Pq8ROqh0lKUKrvm4=.webp)\n\n### **2. One-ClickTransition**\n\nAFFiNE supports seamless switching between text view and kanban view. We support the creation of multiple group blocks in paper mode, and all blocks can support conversion between the text and Kanban views. Any data changes made to either view will be available and saved for use when switching back. Allowing you to store data in one place, while making different changes in various views/modes. Automatic synchronisation.\n\n\n![VpHVi34tTEI9QGAHAo8xY8y7UnKX-T7KMeeEzXTYSww=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/VpHVi34tTEI9QGAHAo8xY8y7UnKX-T7KMeeEzXTYSww=.webp)\n\n## **Key Technology：**\n\nIn the tag-app, the data for attributes and values are stored in a separated form, with attributes being stored in groups and values in blocks. With this type of storage, groups can easily transform not only the blocks under them into kanban schemas (status), but also blocks into Gant charts (in the near future) and many more schemas.\n\n\n![Es0dIc-7IsIKG2NAdk4Wy-Z6qfa4Amk_69Wab4LXV0Y=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/Es0dIc-7IsIKG2NAdk4Wy-Z6qfa4Amk_69Wab4LXV0Y=.webp)\n\n## **Key Design：**\n\n**Colour matching of tags system**：AFFiNE classifies these functions from a functional point of view, thus determining the effect of the icon and the colours. It is hoped that visually the different functional labels can be distinguished, making it easier for users to identify them and giving them a lot of scope for customization.\n\n\n![jcaXRBhS30fn1qIbv-HTvrWHnMZsMRDVcAKm8CUVwX0=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/jcaXRBhS30fn1qIbv-HTvrWHnMZsMRDVcAKm8CUVwX0=.webp)\n\n### Differences from other competing products：\n\n\n![9PcGt3TTeoV1Ry8A_yO2Zt7HwfS0ZraCRHR6sLXwVMc=](https://app.affine.pro/api/workspaces/qf73AF6vzWphbTJdN7KiX/blobs/9PcGt3TTeoV1Ry8A_yO2Zt7HwfS0ZraCRHR6sLXwVMc=.webp)\n\nWe hope this gives you a better understanding of what the tag-app is, some possible use cases and what extra functionality it supports over similar existing systems.\n\nYou're welcome to head over to our website and try it out for yourself in our demo, or deploy your own version. We invite you to offer any feedback you may have on this feature, or the product in general. We are always looking to improve so any further questions or suggestions you have are all welcome.\n\n",
  "publish": true
}